Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/processing/01_first_steps_drawing.po
Languages: de

source: Zeichnen mit dem miniworlds - Grundlagen
de: Drawing with the miniworlds - Basics

source: Vorwort
de: Preface

source: Dieses Tutorial ist stark inspiriert vom großartigen Vorlesungsskript von Prof. Dr. Michael Kipp https://michaelkipp.de/processing/, welches sich auf Processing bezieht.
de: This tutorial is heavily inspired by the great lecture script by Prof. Dr. Michael Kipp https://michaelkipp.de/processing/, which relates to Processing.

source: Der miniworlds-Port von processing übernimmt einige Ideen und Konzepte von Processing, setzt dies aber oft auf leicht abweichende Art um. In diesem Tutorial lernst du das Programmieren mit dem miniworlds kennen. Der miniworlds hat einen *Processing*-Modus, der sich an der populären Grafikprogrammierumgebung orientiert.
de: The miniworlds port of Processing adopts some ideas and concepts from Processing, but often implements them in a slightly different way. In this tutorial, you will learn programming with miniworlds. The miniworlds has a *Processing* mode that is oriented towards the popular graphics programming environment.

source: Wie zeichnet man auf einem PC?
de: How do you draw on a PC?

source: Monitore bestehen aus einem Gitter kleinester Quadrate. Diese Quadrate sind so klein, dass sie für uns wie Punkte aussehen. Man nennt diese kleinsten Quadrate *Pixel*.
de: Monitors bestehen aus einem Gitter kleinster Quadrate. Diese Quadrate sind so klein, dass sie für uns wie Punkte aussehen. Man nennt diese kleinsten Quadrate *Pixel*.

source: Die Pixel sind in einem *Koordinatensystem* angeordnet. Dieses ist allerdings leicht anders aufgebaut, denn in der Regel ist der Ursprung in der oberen linken Ecke:
de: The pixels are arranged in a *coordinate system*. However, this is slightly different because usually the origin is in the upper left corner:

source: coordinates
de: Koordinaten

source: Informatiker zählen in der Regel beginnend mit 0, d.h. die obere linke Ecke hat die Koordinaten (0,0). Ist das Bildschirmfenster 800x600 groß, so hat die untere rechte Ecke die Koordinaten (799, 599)
de: Computer scientists usually start counting from 0, i.e., the top left corner has the coordinates (0,0). If the screen window is 800x600 in size, the bottom right corner has the coordinates (799, 599)

source: Das erste Programm
de: The first program

source: 2: Ein Spielfeld wird erstellt.
de: 2: A playing field is being created.

source: 6: Am Ende wird die mainloop gestartet, dies muss immer die letzte Zeile deines Programms sein.
de: 6: At the end, the mainloop is started, this must always be the last line of your program.

source: Dazwischen findet sich ein *Kommentar* - Kommentare beginnen immer mit einer # und werden vom Computer ignoriert und sind für **Menschen** gemacht. Sie dienen dazu, Programmierern Hinweise zu geben, hier z.B. das an diese Stelle dein eigener Code kommt.
de: In der Mitte befindet sich ein *Kommentar* - Kommentare beginnen immer mit einer # und werden vom Computer ignoriert und sind für **Menschen** gemacht. Sie dienen dazu, Programmierern Hinweise zu geben, hier z.B. dass an diese Stelle dein eigener Code kommt.

source: Dieser könnte z.B. so aussehen:
de: This could look like this, for example:

source: A pixel
de: Ein Pixel

source: Du kannst auch die Größe des Worlds anpassen, indem du dem World beim erstellen zwei Argumente übergibst:
de: You can also adjust the size of the world by passing two arguments when creating the world:

source: Zeichnen geometrischer Grundformen.
de: Drawing basic geometric shapes.

source: Als nächstes lernst du, geometrische Grundformen zu zeichnen.
de: Next, you will learn to draw basic geometric shapes.

source: Die Syntax zum Zeichnen einer Linie sieht folgendermaßen aus:
de: The syntax for drawing a line is as follows:

source: Die Parameter `startpoint` und `endpoint` sind jeweils Tupel, z.B. (1, 2) für x=1 und y=2.
de: The parameters `startpoint` and `endpoint` are each tuples, e.g., (1, 2) for x=1 and y=2.

source: Wenn du eine Linie von (10,10) zu (100, 200) zeichnen willst so musst du z.B. folgendes schreiben:
de: If you want to draw a line from (10,10) to (100, 200), you must write the following, for example:

source: ![A line](../_images/processing/line2.png)
de: ![Eine Linie](../_images/processing/line2.png)

source: A line
de: Eine Zeile

source: Kreise kannst du allgemein folgendermaßen erstellen:
de: You can generally create circles as follows:

source: Die übergebene Position bei Kreisen ist der *Mittelpunkt* des Kreises
de: The passed position in circles is the *center* of the circle

source: Wenn du einen Kreis an der Stelle (100,200) mit Radius 20 erstellen willst, musst du folgendes schreiben:
de: If you want to create a circle at the position (100,200) with a radius of 20, you must write the following:

source: ![A circle](../_images/processing/circle.png)
de: ![Ein Kreis](../_images/processing/circle.png)

source: A circle
de: Ein Kreis

source: Ein Rechteck wird beschrieben durch Position, Breite und Höhe:
de: A rectangle is described by position, width, and height:

source: Der Parameter `position` beschreibt die obere linke Ecke des Rechtecks.
de: The parameter `position` describes the top left corner of the rectangle.

source: Willst du ein Rechteck an der Position (100, 100) mit Breite 20 und Höhe 100 zeichnen, so musst du folgendes schreiben:
de: Wenn du ein Rechteck an der Position (100, 100) mit Breite 20 und Höhe 100 zeichnen möchtest, musst du Folgendes schreiben:

source: ![A rectangle](../_images/processing/rectangle.png)
de: ![Ein Rechteck](../_images/processing/rectangle.png)

source: A rectangle
de: Ein Rechteck

source: Willst du eine Ellipse an der Position (100, 100) mit Breite 20 und Höhe 100 zeichnen, so musst du folgendes schreiben:
de: To draw an ellipse at position (100, 100) with a width of 20 and a height of 100, you must write the following:

source: ![An ellipse](../_images/processing/ellipse.png)
de: ![Eine Ellipse](../_images/processing/ellipse.png)

source: An ellipse
de: Eine Ellipse

source: Rechteck und Ellipse in die Mitte verschieben.
de: Move rectangle and ellipse to the center.

source: Oft will man ein Rechteck oder eine Ellipse nicht an der oberen linken Position erstellen, sondern am Mittelpunkt. Es gibt mehrere Möglichkeiten, wie man dies erreichen kann, ohne die Position manuell auszurechnen.
de: Oft möchte man ein Rechteck oder eine Ellipse nicht an der oberen linken Position erstellen, sondern am Mittelpunkt. Es gibt mehrere Möglichkeiten, wie man dies erreichen kann, ohne die Position manuell auszurechnen.

source: 1. from_center
de: 1. vom_Zentrum

source: from_center Method
de: from_center Methode

source: 2. Verschieben mit ellipse.center
de: 2. Move with ellipse.center

source: Du kannst die Ellipse nach dem Verschieben an den Mittelpunkt verschieben;
de: You can move the ellipse to the center after moving it;

source: Komplexere geometrische Grundformen
de: Complex geometric basic shapes

source: Arc
de: Bogen

source: Kreisbögen und Kreisausschnitte zeichnest du mit folgendem Befehl:
de: You draw circular arcs and circular segments with the following command:

source: Bedeutung der Parameter:
de: Meaning of the parameters:

source: ``width``, ``height``: Breite und Höhe bei Erstellung einer Ellipse. Wähle beide gleich, damit sich der Radius für einen Kreisbogen ergibt oder wähle unterschiedle Werte, damit sich der Bogen und Ausschnitt einer Ellipse ergibt.
de: ``width``, ``height``: Breite und Höhe bei Erstellung einer Ellipse. Wähle beide gleich, damit sich der Radius für einen Kreisbogen ergibt oder wähle unterschiedliche Werte, damit sich der Bogen und Ausschnitt einer Ellipse ergibt.

source: ``start_angle``, ``end_angle``: Die Winkel des Ausschnitts. Die Winkel werden von einer gedachten Linie *gegen den Uhrzeigersinn* gemessen.
de: ``start_angle``, ``end_angle``: The angles of the segment. The angles are measured from an imaginary line *counterclockwise*.

source: Arc - Start and Endangle
de: Bogen - Start- und Endwinkel

source: Beispiel:
de: Example:

source: Triangle
de: Dreieck

source: Ein Dreieck erstellst du mit folgendem Befehl:
de: You create a triangle with the following command:

source: p1, p2 und p3 sind Punkte, die du jeweils als Tupel schreiben kannst.
de: p1, p2 und p3 are points that you can write as tuples.

source: Polygon
de: Vieleck

source: Ein Polygon (d.h. ein n-Eck) erstellst du mit folgendem Befehl:
de: You create a polygon (i.e., an n-gon) with the following command:

source: Training
de: Schulung

source: House
de: Haus

source: Zeichne ein Gesicht mit Grundformen
de: Draw a face with basic shapes

source: Face
de: Gesicht
