Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/processing/02_color_and_contour.po
Languages: de

source: Farben und Konturen
de: Colors and contours

source: Einfärben
de: Coloring

source: Eine geometrische Form kann mit dem Attribut ``fill_color`` eingefärbt werden:
de: A geometric shape können with the attribute "fill_color" colored werden:

source: Eine **Farbe** wird als 3-Tupel angegeben:
de: A color is specified as a 3-tuple:

source: Der erste Wert ist der *rot*-Anteil
de: The first value is the *red* component

source: Der zweite Wert ist der *grün*-Anteil
de: The second value is the *green* component

source: Der dritte Wert ist der *blau*-Anteil
de: The third value is the *blue* component

source: Durch "mischen" dieser Farben erhält man eine konkrete Farbe:
de: By "mixing" these colors you get a specific color:

source: rgb colors
de: rgb Farben

source: Variablen
de: Variables

source: Wir haben hier *Variablen* verwendet. Bisher wenn wir ein Objekt angelegt haben, konnten wir darauf nicht mehr zugreifen. Hier haben wir den Rechtecken Namen gegeben (z.B. r) über die man später wieder auf die Objekte zugreifen kann.
de: We have used *variables* here. So far when we created an object, we could no longer access it. Here we have given the rectangles names (e.g. r) through which one can later access the objects again.

source: So bedeutet ``r.fill_color = (255, 0, 0)`` dass wir die Füllfarbe des zuvor mit r benannten Rechtecks ändern.
de: So means ``r.fill_color = (255, 0, 0)`` that we change the fill color of the rectangle previously named r.

source: Umrandung
de: Border

source: Das folgende Bild erzeugt ein rotes Rechteck mit gelben Rand:
de: The following image generates a red rectangle with a yellow border:

source: Ausgabe:
de: Issue:

source: borders
de: Grenzen

source: Füllung
de: Filling

source: Du kannst auch Figuren zeigen, die nur einen Rand aber über keine Füllung besitzen. Das Attribut ``fill`` legt fest, ob ein Objekt eine Füllung hat.
de: You can also show shapes that only have an edge but no fill. The attribute "fill" determines whether an object has a fill.

source: Das folgende Rechteck hat z.B. keine Füllung:
de: The following rectangle, for example, has no fill:

source: Das World
de: The World

source: Alle Figuren werden auf einem ``World`` gezeichnet. Auch das World hat verschiedene Eigenschaften, die verändert werden können, z.B. Größe und Hintergrundfarbe.
de: All figures are drawn on a "World". Also the World has various properties that can be changed, e.g. size and background color.

source: Bachte folgenden Code, welcher Größe und Hintergrund des Worlds festlegt.
de: Check the following code, which sets the size and background of the world.

source: Übung 2.1: Black Face
de: Exercise 2.1: Schwarzes Gesicht

source: Zeichne folgende Form:
de: Draw the following shape:

source: ![Face](../_images/processing/face2.png)
de: ![Gesicht](../_images/processing/face2.png)

source: Face
de: Gesicht
