Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/processing/04_variables.po
Languages: de

source: Werte und Variablen
de: Values and variables

source: Ein `Wert` ist etwas, dass im Computer gespeichert wird und von einem Computer-Programm manipuliert werden kann. Im Folgenden werden Werte als ``Objekte`` bezeichnet und die Wörter werden synonym verwendet.
de: A value is something that is stored in the computer and can be manipulated by a computer program. In the following, values are referred to as ``objects`` and the words are used synonymously.

source: In anderen Programmiersprachen unterscheidet man primitive Datentypen, die nur verändert werden können und **Objekte**, welche oft auch Attribute und Methoden mitbringen, wie z.B. die Klasse ``world``, welche das Attribut ``size`` besitzt und deren Hintergrund mit der Methode `add_background` verwendet werden kann.
de: In other programming languages, a distinction is made between primitive data types, which can only be modified, and **objects**, which often also bring attributes and methods, such as the class ``world``, which has the attribute ``size`` and whose background can be used with the method `add_background`.

source: Python hat die einfache Philosphie: Alles ist ein Objekt - Daher wird hier generell der Begriff *Wert* verwendet.
de: Python hat die einfache Philosophie: Alles ist ein Objekt - Daher wird hier generell der Begriff *Wert* verwendet.

source: Jeder Wert hat einen Datentyp, welchen du abfragen kannst, z.B. liefert folgendes Programm:
de: Every value has a data type, which you can query, for example, the following program provides:

source: Die folgende Ausgabe auf der Kommandozeile:
de: The following output on the command line:

source: Damit im Computer erstellte Objekte wiedergefunden werden können, muss man speichern, wo diese zu finden ist. Auf technischer Ebene speichert man dazu den *Speicherplatz* eines Objekts im Rechner. In einer Programmiersprache wie Python verwenden wir einen Namen um Objekte wiederzufinden.
de: In order to find objects created on the computer again, one must save where they can be found. On a technical level, the *memory location* of an object in the computer is stored for this purpose. In a programming language like Python, we use a name to find objects again.

source: speichert die Linie unter dem Namen line. Wenn du jetzt den Namen line verwendest, kannst du auf die Variable zugreifen und das Objekt verändern.
de: Stores the line under the name line. If you now use the name line, you can access the variable and modify the object.

source: Du hast z.B. in den vorherigen Kapiteln schon die Farbe einer Linie verändert:
de: For example, in the previous chapters, you have already changed the color of a line:

source: Genauso kannst du z.B. auch mit Zahlen rechnen
de: In gleicher Weise kannst du z.B. auch mit Zahlen rechnen

source: Zuweisungen
de: Assignments

source: Zuweisungen schreibt man als:
de: Assignments are written as:

source: Die bedeutet:
de: Das bedeutet:

source: Zuerst wird das Ergebnis auf der rechten Seite ausgewertet.
de: First, the result on the right side is evaluated.

source: Dann wird das Ergebnis in die Variable auf der linken Seite gespeichert.
de: Then the result is stored in the variable on the left side.

source: Nach folgendem Programm:
de: According to the following program:

source: hat a den Wert 3, b den Wert 4 und c den Wert 7.
de: a hat den Wert 3, b den Wert 4 und c den Wert 7.

source: Genauso kannst du aber auch Werte von Objekten, z.B. die Position eines Kreises verändern. Das folgende Programm lässt dich einen Kreis mit den Tasten a und d nach links oder rechts bewegen. Die x-Position ist über den Namen ``circle.x`` zugreifbar und kann auch so verändert werden.
de: In gleicher Weise kannst du aber auch Werte von Objekten, z.B. die Position eines Kreises, verändern. Das folgende Programm lässt dich einen Kreis mit den Tasten a und d nach links oder rechts bewegen. Die x-Position ist über den Namen ``circle.x`` zugreifbar und kann auch so verändert werden.

source: Die Zeile ``circle.x = circle.x + 1`` sagt folgendes: Berechne zuerst den Wert ``circle.x + 1`` (d.h. erhöhe die x-Koordinate des Kreises um 1.) und speichere das Ergebnis dieser Berechnung wieder in ``circle.x``.
de: The line ``circle.x = circle.x + 1`` says the following: First calculate the value ``circle.x + 1`` (i.e., increase the x-coordinate of the circle by 1) and store the result of this calculation back in ``circle.x``.

source: Das = bedeutet nicht das der Ausdruck links und rechts mathematisch gleich ist. Stattdessen wird das Ergebnis der rechten Seite zuerst ausgewertet und das Ergebnis dieser Berechnung in die Variable auf der linken Seite gespeichert.
de: Das = bedeutet nicht, dass der Ausdruck links und rechts mathematisch gleich ist. Stattdessen wird das Ergebnis der rechten Seite zuerst ausgewertet und das Ergebnis dieser Berechnung in die Variable auf der linken Seite gespeichert.

source: Man liest den Ausdruck ``a = b`` als b wird a **zugewiesen**.
de: One reads the expression ``a = b`` as b is **assigned** to a.

source: Manche Programmiersprachen verwenden statt dem = Zeichen ein anderes Zeichen um Verwirrung bei Programmieranfängern zu vermeiden.
de: Some programming languages use a different symbol instead of the = sign to avoid confusion among beginner programmers.

source: Überall wo du bisher eine Zahl oder einen Text verwendet hast, kannst du auch direkt Variablen einsetzen, z.B.
de: Everywhere you have used a number or text so far, you can also directly use variables, e.g.

source: Dies funktioniert immer dann, wenn der **Datentyp** der Variablen mit dem erwarteten **Datentyp** übereinstimmt.
de: This works whenever the **data type** of the variable matches the expected **data type**.

source: Folgender Code z.B. führt z.B. zu einem Fehler:
de: Der folgende Code z.B. führt z.B. zu einem Fehler:

source: Der Fehler versucht dir einen Hinweis zu geben, was du falsch gemacht hast, oft hilft es also die Fehlermeldungen zu lesen.
de: The error is trying to give you a hint about what you did wrong, so it often helps to read the error messages.

source: Gültigkeitsbereich - Scope
de: Gültigkeitsbereich - Umfang

source: Wenn Programmierer größere Programme schreiben -und das auch oft im Team-, dann kommt dem Namen von Variablen eine besondere Bedeutung zu: Wie verhindert man, dass andere Programmierer die eigenen Variablennamen verwenden und dadurch sogar unvorhergesehene Nebenwirkungen verursachen können?
de: When programmers write larger programs - often in a team - the names of variables take on special significance: How can one prevent other programmers from using their own variable names and potentially causing unforeseen side effects?

source: Die Antwort darauf sind "Gültigkeitsbereiche: Eine Variable hat unterschiedliche Gültigkeitsbereiche, je nachdem wo sie definiert wurde:
de: The answer to this is "Scopes: A variable has different scopes depending on where it was defined:

source: Eine Variable die innerhalb einer Funktion eingeführt wird hat einen lokalen Gültigkeitsbereich. Sie ist innerhalb dieser Funktion **lokal** sichtbar, aber nicht innerhalb von anderen Funktionen.
de: A variable introduced within a function has a local scope. It is **locally** visible within this function, but not within other functions.

source: Eine Variable die außerhalb einer Funktion definiert wurde, ist **global** sichtbar und kann in allen Funktionen deines Programms verwendet werden. **Achtung**: Wenn man auf globale Variablen zugreifen und diese verändern will, muss man das Schlüsselwort global verwenden.
de: A variable defined outside a function is **globally** visible and can be used in all functions of your program. **Warning**: If you want to access and modify global variables, you must use the global keyworld.

source: Folgendes funktioniert:
de: The following works:

source: Es wird der Wert 3 ausgegeben.
de: The value 3 is output.

source: Dies funktioniert aber nicht, da bei der Zuweisung a als lokale Variable interpretiert wird (die nicht definiert wurde)
de: This does not work, however, because when assigning, a is interpreted as a local variable (which was not defined)

source: Dies funktioniert wieder, da a als globale Variable definiert wird und daher auch auf die globale Variable zugegriffen wird.
de: This works again because a is defined as a global variable and therefore the global variable is also accessed.
