Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/processing/09_lists.po
Languages: de

source: Listen
de: Hör zu

source: Oft wollen wir viele ähnliche Elemente gleichzeitig zugreifen z.B. Monate:
de: Oft wollen wir auf viele ähnliche Elemente gleichzeitig zugreifen, z.B. Monate:

source: Angenommen wir wollen die durchschnittlichen Monatstemperaturen in einer Stadt speichern und haben folgende Daten gemessen:
de: Suppose we want to store the average monthly temperatures in a city and have measured the following data:

source: Wenn die Daten weiter verarbeitet werden sollen, dann wird dies sehr unpraktisch, da wir jedesmal jeden einzelnen Wert "anfassen" müssen. Daher verwendet man stattdessen Listen.
de: If the data is to be further processed, it becomes very impractical because we have to "touch" each individual value every time. Therefore, lists are used instead.

source: Man verwendet daher für diesen Einsatzzweck Listen, bei der gleichartige Elemente unter einem gemeinsamen **Namen** zusammengefasst werden und mit Hilfe eines **Index** zugreifbar sind.
de: Therefore, lists are used for this purpose, where similar elements are grouped under a common **name** and can be accessed using an **index**.

source: Was sind Listen?
de: What are lists?

source: Listen sind eine Zusammenfassung von Daten, bei der jedes Datum durch einen Index identifiziert wird. Die einzelnen Werte einer Liste nennt man *Elemente*.
de: Lists sind eine Zusammenfassung von Daten, bei der jedes Datum durch einen Index identifiziert wird. Die einzelnen Werte einer Liste nennt man *Elemente*.

source: Listen erzeugen
de: Listen erstellen

source: Man kann in Python Listen auf verschiedene Art und Weise erzeugen. Die einfachste Möglichkeit ist es, Listen mit Hilfe von eckigen Klammern zu erzeugen:
de: In Python kann man Listen auf verschiedene Arten und Weisen erzeugen. Die einfachste Möglichkeit ist es, Listen mit Hilfe von eckigen Klammern zu erzeugen:

source: Wie du siehst, ist es sogar möglich (und oft notwendig) eine Liste innerhalb einer Liste zu erstellen.
de: As you can see, it is even possible (and often necessary) to create a list within a list.

source: Länge einer Liste
de: Length einer Liste

source: Die Länge einer Liste kannst du mit der Funktion len() berechnen:
de: You can calculate the length of a list with the function len():

source: Auf Elemente zugreifen
de: Access elements

source: Mit Hilfe des `Index` kannst du auf Elemente einer Liste zugreifen. die Syntax dafür ist folgende
de: Using the `index`, you can access elements of a list. The syntax for this is as follows

source: Listenelemente verändern
de: Listenelemente ändern

source: Du kannst mit Hilfe des Index auch Listenelemente verändern:
de: You can also change list elements using the index:

source: Dies ist ein bedeutender Unterschied zu anderen Programmiersprachen, die als Datenstruktur anstelle von Listen *Arrays* kennen. Arrays sind nicht veränderbar und haben eine feste Länge.
de: This is a significant difference from other programming languages that know *arrays* as a data structure instead of lists. Arrays are immutable and have a fixed length.

source: Beispiel : Monate
de: Example : Monate

source: Am Beispiel der Monate schauen wir uns dies nochmal genauer an. Anstelle von einzelnen Variablen kann man die Monate als Liste anlegen:
de: Anhand des Beispiels der Monate schauen wir uns dies nochmal genauer an. Anstelle von einzelnen Variablen kann man die Monate als Liste anlegen:

source: Wir können auf die einzelnen Listenelemente mit einem Index zugreifen:
de: We can access the individual list elements with an index:

source: Und wir können mit einer Schleife über die Liste iterieren. So können wir z.B. die Durchschnittstemperatur berechnen:
de: And we can iterate over the list with a loop. This way, we can calculate the average temperature, for example:

source: Dies können wir nutzen, um die Daten zu visualisieren:
de: We can use this to visualize the data:

source: months
de: Monate

source: Grafische Objekte speichern
de: Save graphic objects

source: Wir können auch Objekte in Arrays speichern. Dies wird z.B. oft bei der Kollissionserkennung benötigt.
de: We can also store objects in arrays. This is often needed for collision detection, for example.

source: z.B. wollen wir ein Programm schreiben, bei denen grüne Kreise eingesammelt und rote Punkte vermieden werden sollen. Dies können wir folgendermaßen mit Listen umsetzen:
de: Zum Beispiel wollen wir ein Programm schreiben, bei dem grüne Kreise eingesammelt und rote Punkte vermieden werden sollen. Dies können wir folgendermaßen mit Listen umsetzen:

source: Wenn man die grünen Kreise anklickt, wird der Punktestand um 1 erhöht, ansonsten um 1 verringert.
de: When you click on the green circles, the score increases by 1, otherwise it decreases by 1.

source: Die Kollissionserkennung funktioniert mit Hilfe von Listen: die Kreise werden jeweils in die Liste red_circles und green_circles hinzugefügt - Auf diese Weise kann man mit `circle in green_circles` überprüfen, ob ein Kreis in einer dieser beiden Listen enthalten ist.
de: The collision detection works with the help of lists: the circles are each added to the list red_circles and green_circles - In this way, you can check with `circle in green_circles` whether a circle is contained in one of these two lists.
