Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/processing/10_image_processing.po
Languages: de

source: Bildbearbeitung
de: Image editing

source: Was sind Bilder
de: What are pictures

source: Bilder bestehen aus winzig kleinen Pixeln, die alle eine bestimmte Farbe haben:
de: Images consist of tiny little pixels, each having a specific color:

source: ![sunflower](../_images/sunflower.png)
de: ![Sonnenblume](../_images/sunflower.png)

source: sunflower
de: Sonnenblume

source: Bildbearbeitung besteht darin, diese Pixel nach bestimmten Kriterien zu verändern und zu manipulieren.
de: Image editing consists in changing and manipulating these pixels according to certain criteria.

source: Dazu benötigen wir `Arrays` die eine spezielle Form von Listen sind (Arrays haben begrenze Größen).
de: For this we need `Arrays` which are a special form of lists (Arrays have limited sizes).

source: Laden des Hintergrunds
de: Loading background

source: Im miniworlds können wir den `Hintergrund` mit der Funktion `arr = background.to_colors_array()` laden.
de: Im miniworlds können wir den `Hintergrund` mit der Funktion `arr = background.to_colors_array()` laden. In miniworlds we can load the `background` with the function `arr = background.to_colors_array()`.

source: Wenn wir z.B. dieses minimale Programm schreiben:
de: If we, for example, write this minimal program:

source: , dann bearbeiten wir im folgenden den Standard-Hintergrund:
de: , then we edit the standard background:

source: grey
de: Grau

source: Du erhälst ein verschachteltes, zweidimensionales Array, das folgendermaßen aussieht:
de: You receive a nested, two-dimensional array that looks like this:

source: Die innerste Liste steht jeweils für ein 3-Tupel an Farben. [150, 150, 150].
de: The innermost list represents a 3-tuple of colors. [150, 150, 150].

source: Diese beschreiben jeweils den rot, grün und blau-Anteil des jeweiligen Pixels. Jede Farbe wird durch "Mischen" dieser 3 Grundfarben erzeugt:
de: These describe the red, green, and blue component of the respective pixel. Each color is generated by "mixing" these 3 primary colors.

source: ![rgb](../_images/processing/rgb.png)
de: ![rgb](../_images/verarbeitung/rgb.png)

source: Der Minimalwert für jede Farbe ist 0, der Maximalwert ist 255.
de: The minimum value for each color is 0, the maximum value is 255.

source: Das Bild-Array besteht:
de: The picture array consists:

source: Aus einer Liste von Spalten
de: From a list of columns

source: und jede dieser Spalten enthält für jede Zeile einen Farbwert (der selbst wiederrum eine Liste mit 3 Werten ist)
de: and each of these columns contains a color value for each row (which is in turn a list of 3 values)

source: ![array](../_images/array1.png)
de: ![array](../_bilder/array1.png)

source: Verändern des Hintergrunds
de: Changing the background

source: Man kann über dieses Array folgendermaßen iterieren:
de: One can iterate over this array as follows:

source: Die Zählervariable x iteriert über die Spalten und wählt jeweils eine Spalte aus. Über jede ausgewählte Spalte wird nun mit der Zählervariablen y iteriert:
de: The count variable x iterates over the columns and selects a column each time. Now iterate through each selected column with the count variable y:

source: ![array](../_images/array2.png)
de: array

source: Mit der Anweisung `arr[i][j][0] = 0` wird jeweils die erste Farbe, also der rot-Anteil auf 0 gesetzt. Das Array sieht folgendermaßen aus:
de: With the instruction `arr[i][j][0] = 0`, the first color, i.e. the red component, is set to 0 each time. The array looks as follows:

source: Dieses Array können wir nun wieder mit dem Befehl `background.from_array(arr)` als Hintergrund laden, so sieht das vollständige Programm aus:
de: This array we can now again with the command `background.from_array(arr)` load as background, so the complete program looks like this:

source: ...und so sieht das Ergebnis aus. Die Farbe Grau verliert ihre rot-Anteile und wird dadurch grün-bläulich:
de: ...and this is what the result looks like. The color gray loses its red components and becomes greenish-blue:

source: ![green-blue](../_images/bg_greenblue.png)
de: ![grün-blau](../_images/bg_greenblue.png)

source: green-blue
de: grün-blau

source: Hier haben wir einfach jedem Bildpunkt den rot-Wert 0 zugewiesen. Wir können aber auch jedem Bildpunkt einen Wert zwischen 0 und 255 zuweisen.
de: Here we simply assigned the red value 0 to each pixel. But we can also assign a value between 0 and 255 to each pixel.

source: Man kann auch anders über diese Liste iterieren und z.B. nur jede zweite Zeile färben:
de: One can also iterate over this list in a different way, for example, only coloring every second line:

source: Genauso ist es möglich, den Wert Abhängig von der Zählervariablen i zu verwenden - Auf diese Weise kann man Farbübergänge erzeugen, z.B. so :
de: Similarly it is possible to use the value depending on the counter variable i - In this way color transitions can be created, for example like this:

source: Man erhält folgenden Farbübergang.
de: One receives the following color transition.

source: Dies kann man auch mit der y-Variable machen, und das Programm wie folgt erweitern:
de: This can also be done with the y variable, and expand the program as follows:

source: Oben ist der grün-Wert minimal, unten ist er maximal:
de: Above is the green value minimal, below it is maximal:

source: Man kann dies nun zusammensetzen:
de: One can now put this together:

source: Man erhält diesen Farbübergang:
de: One receives this color transition:

source: Bisher haben wir nun einen einfarbigen Hintergrund bearbeitet, aber genau dies geht natürlich auch mit einem Bild als Hintergrund.
de: So far, we have edited a solid background, but of course this can also be done with an image as a background.

source: Auf diese Weise können wir verschiedene Filter über das Bild legen.
de: In this way, we can apply different filters over the image.

source: Wir laden z.B. die Sonnenblume von oben als Hintergrundbild:
de: We load for example the sunflower from above as background image.

source: ![array](../_images/sunflower1.png)
de: ![array](../_images/sonnenblume1.png)

source: Da die rot-Werte aus dem Bild entfernt werden, erhält das Bild einen gründlichen Farbton. Wir haben hier also einen ersten Farbfilter geschrieben. So sieht das Ergebnis aus:
de: Since the red values are removed from the image, the image receives a thorough color tone. So we have written a first color filter here. This is what the result looks like:

source: Als nächstes manipulieren wir die Helligkeit. Dazu können wir sowohl den rot, grün als blau-Wert mit einer Konstante multiplizieren.
de: Next, we manipulate the brightness. To do this, we can multiply both the red, green, and blue values by a constant.

source: Der erste Versuch sieht allerdings so aus!
de: The first attempt looks like this, however!

source: Wie ist dies passiert?
de: How is this happened?

source: Jeder Farbton hat einen Wert zwischen 0 und 255, beim Multiplizieren wurden allerdings einige unserer Werte größer als 255 und sind daher "übergelaufen". Du erkennst dies an besonders dunklen Bereichen, die eigentlich hell sein sollten.
de: Every shade has a value between 0 and 255, however, when multiplying some of our values ​​became larger than 255 and have therefore "overflowed". You can see this in particularly dark areas that should actually be light.

source: Wir müssen also sicherstellen, dass das Ergebnis kleiner als 255 ist, z.B. so:
de: We must therefore ensure that the result is less than 255, for example like this:

source: Bildbearbeitung II (mit Funktionen)
de: Image editing II (with functions)

source: Helligkeit
de: Brightness

source: Oft benötigen wir die Helligkeit eines Pixels. Die "einfachste Methode dies zu berechnen ist den Durchschnitt der r,g und b-Werte zu berechnen:
de: Häufig benötigen wir die Helligkeit eines Pixels. Die "einfachste Methode dies zu berechnen ist den Durchschnitt der r, g und b-Werte zu berechnen:

source: In der Funktion brightness müssen die Werte r, g und b zunächst umgewandelt werden: Es handelt sich um `uint8`-Werte, so dass das Ergebnis niemals größer als 255 werden darf (Ansonsten ensteht ein "Overflow"). Deshalb müssen die Variablen in den Datentyp `int` umgewandelt werden, damit das Ergebnis der Addition auch ein `int`-Wert und damit beliebig groß ist.
de: In the function brightness, the values r, g, and b must first be converted: They are `uint8` values, so that the result must never be larger than 255 (Otherwise an "Overflow" occurs). Therefore, the variables must be converted to the data type `int`, so that the result of the addition is also an `int` value and therefore arbitrarily large.

source: Dies können wir nutzen, um jeden Pixel grau zu färben, abhängig von seiner Helligkeit:
de: This can be used to color every pixel gray depending on its brightness.

source: ![sunflower grey](../_images/sunflower5grey.png)
de: ![Sonnenblume grau](../_images/sunflower5grey.png)

source: sunflower grey
de: Sonnenblume grau

source: Farbunterschied und wahrgenommener Farbunterschied
de: Color difference and perceived color difference

source: Beim Arbeiten mit Bildern und Tönen ist es wichtig zu wissen, wie wir Menschen diese wahrnehmen.
de: When working with images and sounds, it is important to know how we humans perceive them.

source: Die *wahrgenommene* Helligkeit entspricht nicht der hier berechneten Helligkeit. Für die folgenden Zwecke ist die hier verwendete Form zur Berechnung der Helligkeit aber ausreichend.
de: The *perceived* brightness does not correspond to the brightness calculated here. However, for the following purposes, the form used here to calculate brightness is sufficient.

source: Kantenerkennung
de: Edge detection

source: Eine wichtige Funktion in der Bildbearbeitung ist das Erkennen von Kanten. Auch in der künstlichen Intelligenz ist dies wichtig, weil Kantenerkennung ein erster Schritt ist, um Objekte in einem Bild zu erkennen.
de: A important function in the image processing is the recognition of edges. Also in the artificial intelligence is this important, because edge detection a first step is, to objects in a image to recognize.

source: Wie funktioniert Kantenerkennung?
de: How does edge detection work?

source: Helferfunktionen
de: Helper functions

source: Um uns auf den eigentlichen Algorithmus zu konzentrieren, verwenden wir einige Helfer-Funktionen:
de: To focus on the actual algorithm, we use some helper functions. Um uns auf den eigentlichen Algorithmus zu konzentrieren, verwenden wir einige Helfer-Funktionen:

source: Ist ein Bildpunkt im Bild?:
de: Is ein Bildpunkt im Bild?:

source: Gebe alle Nachbarzellen eines Bildpunktes zurück:
de: Return all neighboring cells of a pixel:

source: Wir bereiten das Bild vor. Mit `arr.copy()`` können wir eine Kopie des Bildes erstellen, in der wir nur die Helligkeitswerte speichern.
de: We prepare the image. With `arr.copy()` we can create a copy of the image in which we only store the brightness values.

source: Auf diese Weise müssen wir später nicht mit allen drei Farbwerten rechnen.
de: In this way, we do not have to calculate with all three color values later.

source: und jetzt ergänzen wir noch den Algorithmus zur Kantenerkennung:
de: and now we add the algorithm for edge detection:

source: Der Algorithmus funktioniert so: Wir berechnen mit Hilfe der neighbour_cells-Funktion den durchschnittlichen Helligkeitswert aller Nachbarzellen und färben das Bild entsprechend ein.
de: The algorithm works like this: We calculate the average brightness value of all neighboring cells using the neighbour_cells function and color the image accordingly.

source: ![sunflower grey](../_images/sunflower6black.png)
de: ![Sonnenblume grau](../_images/sunflower6black.png)

source: Die Farben sind noch invertiert, d.h. wir brauchen eine Funktion, die die Farben erneut invertiert, so dass der schwarze Hintergrund weiß wird und die Kanten statt weiß schwarz werden.
de: The colors are still inverted, i.e. we need a function that inverts the colors again so that the black background becomes white and the edges become black instead of white.

source: Dies geht so:
de: This goes like this:

source: ![sunflower grey](../_images/sunflower8_edge.png)
de: ![Sonnenblume grau](../_images/sunflower8_edge.png)

source: Diesen Algorithmus können wir noch auf verschiedene Art verändern verbessern. Eine Möglichkeit ist es, nur Zellen weiß zu färben, die einen gewissen Schwellenwert überschreiten und alle anderen Zellen schwarz, man könnte auch das Feld der Nachbarzellen größer gestalten, ...
de: This algorithm we can still in various ways change improve. One possibility is to color only cells white that exceed a certain threshold value and all other cells black, one could also make the field of neighboring cells larger, ...

source: Probiere es aus!
de: Try it out!
