Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: de

source: Weitere Tutorials
de: More Tutorials

source: Konzepte
de: Concepts

source: Anleitungen
de: Instructions

source: API > Basics
de: API > Grundlagen

source: API > Actor Classes
de: API > Schauspielerklassen

source: API > World Classes
de: API > Weltklassen

source: API > Sound & Music
de: API > Sound & Musik

source: Helpers
de: Helfer

source: Impressum
de: Imprint

source: miniworlds
de: miniwelten

source: **miniworlds** ist eine in Python und Pygame geschriebene Spiel-Engine, die für SchülerInnen entwickelt wurde, um 2D-Miniwelten und Spiele zu erstellen.
de: **miniworlds** is a game engine written in Python and Pygame, developed for students to create 2D miniworlds and games.

source: Die Erstellung der ersten Spiele mit **minigames** ist einfach und macht Spaß.
de: The creation of the first games with minigames is easy and fun.

source: miniworlds und miniworldmaker
de: miniwelten und miniweltmacher

source: **miniworlds** ist das Nachfolgeprojekt des **miniworldmakers**. Sehr vieles ist ähnlich, manche Bezeichnungen und Funktionen unterscheiden sich vom miniworldmaker. (z.B. aus Tokens wurden Actors, aus Boards wurden Worlds)
de: **miniworlds** is the successor project of **miniworldmakers**. Very much is similar, some designations and functions differ from the miniworldmaker. (e.g. Tokens became Actors, Boards became Worlds)

source: Beispiele
de: Examples

source: Zwei Actors, die per Tastatur gesteuert werden
de: Two actors controlled by keyboard

source: Example: Two actors
de: Zwei Schauspieler

source: Ein zufällig platziertes Ziel kann mit der Maus "abgeschossen" werden.
de: A randomly placed target can be "fired" with the mouse.

source: Example: Skeetshooting
de: Skeetshooting

source: Aircrafts
de: Flugzeuge

source: Klassisches Spiel, bei dem man ein Flugzeug steuert und Gegner abwehrt und ausweicht.
de: Classic game where one pilots an airplane and fends off and dodges enemies.

source: RPG with console and sidebar
de: RPG mit Konsole und Seitenleiste

source: Example: RPG
de: Beach resort

source: Credits
de: Guthaben

source: Links
de: Verknüpfungen
