Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/02_00_world.po
Languages: de

source: Um eine Welt zu erstellen, brauchst du nur ein paar Zeilen Code:
de: To create a world, you only need a few lines of code:

source: Was passiert in diesem Code?
de: What is happening in this code?

source: Welt starten: world.run() startet die Welt und zeigt sie auf dem Bildschirm an. Stell dir diese Zeile wie den "Play"-Button vor – erst danach wird deine Welt sichtbar.
de: Starten der Welt: world.run() startet die Welt und zeigt sie auf dem Bildschirm an. Stell dir diese Zeile wie den "Play"-Button vor – erst danach wird deine Welt sichtbar.

source: Schau dir das folgende Bild an, das den ersten Schritt zeigt:
de: Look at the following image that shows the first step:

source: ![First miniworlds Example](../_images/01firstworld.png)
de: ![Erstes Miniwelten-Beispiel](../_images/01firstworld.png)

source: First miniworlds Example
de: Erstes Miniwelten-Beispiel

source: Hintergrund hinzufügen
de: Add background

source: Damit die Welt nicht leer aussieht, kannst du ihr ein Bild als Hintergrund hinzufügen. Dazu brauchst du ein Bild, das du im images-Ordner deines Projekts speicherst. Die Ordnerstruktur deines Projekts könnte folgendermaßen aussehen:
de: To prevent the world from looking empty, you can add an image as a background. For this, you need an image that you save in the images folder of your project. The folder structure of your project might look like this:

source: Nachdem du dein Bild (z.B. grass.png) in den Ordner images gelegt hast, kannst du es mit der Methode add_background der Welt hinzufügen:
de: After you have placed your image (e.g. grass.png) in the images folder, you can add it to the world using the add_background method:

source: ![First miniworlds Example](../_images/pixel_addbackground.png)
de: ![Erstes Miniworlds-Beispiel](../_images/pixel_addbackground.png)

source: Die Methode add_background("images/grass.png") lädt das Bild grass.png aus dem angegebenen Pfad und setzt es als Hintergrund für deine Welt.
de: The method add_background("images/grass.png") loads the image grass.png from the specified path and sets it as the background for your world.

source: Es gibt verschiedene Arten von `Worlds` in miniworlds. Die `TiledWorld` ist speziell für Spiele auf gekachelten Flächen gedacht, z.B. Top-Down RPGs.
de: There are different types of `Worlds` in miniworlds. The `TiledWorld` is specifically designed for games on tiled surfaces, such as top-down RPGs.
