Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/03_00_actors.po
Languages: de

source: Actors
de: Akteure

source: Actors: Building Blocks of Your World
de: Akteure: Die Bausteine deiner Welt

source: An Actor is anything in your world that can move or be modified. It could be a character controlled by the player, or an object like a wall or obstacle. In Miniworlds, every Actor is a standalone object displayed in the world and can interact with other objects.
de: Ein Akteur ist alles in deiner Welt, was sich bewegen oder verändert werden kann. Es kann ein vom Spieler gesteuerter Charakter sein oder ein Objekt wie eine Wand oder ein Hindernis. In Miniworlds ist jeder Akteur ein eigenständiges Objekt, das in der Welt angezeigt wird und mit anderen Objekten interagieren kann.

source: Creating an Actor
de: Einen Akteur erstellen

source: Let's start by placing an Actor in your world. First, we'll create a simple world with a background and place an Actor.
de: Lass uns damit beginnen, einen Akteur in deiner Welt zu platzieren. Zuerst erstellen wir eine einfache Welt mit einem Hintergrund und platzieren einen Akteur.

source: Here's how:
de: So geht's:

source: Output
de: Ausgabe

source: Explanation:
de: Erklärung:

source: We create an Actor at position x=100, y=40. It appears as a purple rectangle since it doesn't yet have a costume.
de: Wir erstellen einen Akteur an der Position x=100, y=40. Er erscheint als violettes Rechteck, da er noch kein Kostüm hat.

source: Note that the *origin* of the coordinate system is *top-left*.
de: Beachte, dass der *Ursprung* des Koordinatensystems *oben links* liegt.

source: The Coordinate System
de: Das Koordinatensystem

source: Example: The Coordinate System
de: Beispiel: Das Koordinatensystem

source: The position (100, 20) refers to the **center** of the Actor.
de: Die Position (100, 20) bezieht sich auf die **Mitte** des Akteurs.

source: Costumes
de: Kostüme

source: Every Actor in Miniworlds can wear a costume that determines its external appearance.
de: Jeder Akteur in Miniworlds kann ein Kostüm tragen, das sein äußeres Erscheinungsbild bestimmt.

source: A costume is simply an image you assign to an Actor to give it a visual identity.
de: Ein Kostüm ist einfach ein Bild, das du einem Akteur zuweist, um ihm eine visuelle Identität zu geben.

source: Step 1: Prepare Images
de: Schritt 1: Bilder vorbereiten

source: Before you can add a costume to an Actor, you need to copy the relevant images to the images folder of your project. A typical project structure might look like this:
de: Bevor du einem Akteur ein Kostüm hinzufügen kannst, musst du die entsprechenden Bilder in den Bilderordner deines Projekts kopieren. Eine typische Projektstruktur könnte so aussehen:

source: Step 2: Add Costume
de: Schritt 2: Kostüm hinzufügen

source: Once your images are prepared, you can assign an image as a costume to your Actor using the `add_costume()` method.
de: Sobald deine Bilder vorbereitet sind, kannst du einem Akteur mithilfe der Methode `add_costume()` ein Bild als Kostüm zuweisen.

source: Output:
de: Ausgabe:

source: Explanation
de: Erklärung

source: After running the code, you see an Actor with the costume `knight.png`.
de: Nach Ausführung des Codes siehst du einen Akteur mit dem Kostüm `knight.png`.

source: Bonus: Experiment with Your Own Costumes!
de: Bonus: Experimentiere mit deinen eigenen Kostümen!

source: Now that you know how to assign costumes, you can get creative:
de: Jetzt, wo du weißt, wie man Kostüme zuweist, kannst du kreativ werden:

source: Create custom images and save them in the images folder.
de: Erstelle eigene Bilder und speichere sie im Bilderordner.

source: Change the position and appearance of your Actors.
de: Ändere die Position und das Aussehen deiner Akteure.

source: For example, try creating an Actor at a new position and assigning it a different image:
de: Versuche zum Beispiel, einen Akteur an einer neuen Position zu erstellen und ihm ein anderes Bild zuzuweisen:

source: Summary:
de: Zusammenfassung:

source: Actors receive a costume using the add_costume() method.
de: Akteure erhalten ein Kostüm durch die Methode add_costume().

source: The images must be stored in the correct folder to be found.
de: Die Bilder müssen im richtigen Ordner gespeichert sein, damit sie gefunden werden können.

source: You can place and design as many Actors with different costumes in the world as you like.
de: Du kannst so viele Akteure mit verschiedenen Kostümen in der Welt platzieren und gestalten, wie du möchtest.

source: FAQ: Common Issues and Solutions
de: FAQ: Häufige Probleme und Lösungen

source: My Actor is misaligned, what can I do?
de: Mein Akteur ist falsch ausgerichtet, was kann ich tun?

source: If your Actor is facing the wrong direction, there are two simple solutions:
de: Wenn dein Akteur in die falsche Richtung zeigt, gibt es zwei einfache Lösungen:

source: Problem Description
de: Problembeschreibung

source: Actor Orientation
de: Ausrichtung des Akteurs

source: The orientation of the image is facing upward, but Miniworlds expects images oriented to the right.
de: Die Ausrichtung des Bildes zeigt nach oben, aber Miniworlds erwartet nach rechts ausgerichtete Bilder.

source: Therefore, in the example, the Actor is facing the wrong direction.
de: Daher zeigt der Akteur im Beispiel in die falsche Richtung.

source: Solution
de: Lösung

source: **Rotate the image**: You can rotate the image in an image editing program so it points in the desired direction (typically upwards).
de: **Bild drehen**: Du kannst das Bild in einem Bildbearbeitungsprogramm drehen, sodass es in die gewünschte Richtung zeigt (typischerweise nach oben).

source: **Adjust orientation in code**: Alternatively, you can change the costume's orientation directly in Miniworlds. Use the `orientation` attribute to rotate the costume:
de: **Ausrichtung im Code anpassen**: Alternativ kannst du die Ausrichtung des Kostüms direkt in Miniworlds ändern. Verwende das Attribut `orientation`, um das Kostüm zu drehen:

source: You can also use other values, such as -90 or 180, to adjust the orientation depending on how your original image is aligned.
de: Du kannst auch andere Werte wie -90 oder 180 verwenden, um die Ausrichtung anzupassen, je nachdem wie dein ursprüngliches Bild ausgerichtet ist.

source: The example above could be corrected as follows:
de: Das obige Beispiel könnte wie folgt korrigiert werden:

source: The image is rotated -90° to the left from the expected position. With this adjustment, the image is now correctly aligned.
de: Das Bild wird von der erwarteten Position um -90° nach links gedreht. Mit dieser Anpassung ist das Bild nun korrekt ausgerichtet.

source: How do I prevent the costume from rotating with the Actor?
de: Wie verhindere ich, dass sich das Kostüm mit dem Akteur dreht?

source: If you want the costume not to rotate, even when the Actor moves or rotates, you can disable the costume's rotation. Set the `is_rotatable` attribute to False:
de: Wenn du nicht möchtest, dass sich das Kostüm dreht, auch wenn sich der Akteur bewegt oder dreht, kannst du die Drehung des Kostüms deaktivieren. Setze das Attribut `is_rotatable` auf False:

source: An **actor** is anything in your world that can move or be changed. It could be a character controlled by the player or an object like a wall or obstacle. In Miniworlds, every actor is an independent object that appears in the world and can interact with other objects.
de: Ein Actor ist alles in deiner World, das sich bewegen oder verändert werden kann. Es kann sich um eine Figur handeln, die vom Spieler gesteuert wird, oder um ein Objekt wie eine Wand oder ein Hindernis. In Miniworlds ist jeder Actor ein eigenständiges Objekt, das in der World erscheint und mit anderen Objekten interagieren kann.

source: Let’s start by placing an actor in your world. We’ll first create a simple world with a background and place an actor in it:
de: Lass uns damit beginnen, einen Actor in deiner World zu platzieren. Zuerst erstellen wir eine einfache World mit einem Background und platzieren einen Actor darin:

source: We create an actor at position x=100, y=40. It is shown as a purple rectangle because it doesn’t have a costume yet.
de: Wir erstellen einen Actor an der Position x=100, y=40. Er wird als lilafarbenes Rechteck angezeigt, weil er noch kein Costume hat.

source: Note that the **origin** of the coordinate system is at the **top left**.
de: Beachte, dass der **Ursprung** des Koordinatensystems sich in der **oberen linken** Ecke befindet.

source: Coordinate system
de: Das Koordinatensystem

source: Example: Coordinate system
de: Beispiel: Das Koordinatensystem

source: The position (100, 20) refers to the **center point** of the actor.
de: Die Position (100, 20) bezieht sich auf den **Mittelpunkt** des Actors.

source: Every actor in Miniworlds can wear a **costume**, which defines its visual appearance. A costume is simply an image assigned to the actor to give it a visual identity.
de: Jeder Actor in Miniworlds kann ein **Costume** tragen, das sein äußeres Erscheinungsbild / Appearance festlegt. Ein Costume ist einfach ein Bild, das dem Actor zugewiesen wird, um ihm eine visuelle Identität zu verleihen.

source: Before you can add a costume to an actor, copy the image files into your project’s `images` folder. A typical project structure might look like this:
de: Bevor du einem Actor ein Costume hinzufügen kannst, kopiere die Bilddateien in den `images`-Ordner deines Projekts. Eine typische Projektstruktur könnte so aussehen:

source: Step 2: Add a Costume
de: Schritt 2: Ein Kostüm hinzufügen

source: Once your images are ready, you can assign a costume to your actor using the `add_costume()` method:
de: Sobald deine Bilder bereit sind, kannst du deinem Actor mit der Methode `add_costume()` ein Costume zuweisen:

source: After running the program, you’ll see an actor with the costume `knight.png`.
de: Nach dem Ausführen des Programms siehst du einen Actor mit dem Costume `knight.png`.

source: Create your own images and save them in the `images` folder.
de: Erstelle deine eigenen Bilder und speichere sie im Ordner `images`.

source: Change the position and appearance of your actors.
de: Ändere die Position und das Aussehen deiner Actors.

source: For example, try creating an actor in a new position and give it a different image:
de: Erstelle zum Beispiel einen Actor an einer neuen Position und gib ihm ein anderes Bild:

source: The images must be saved in the correct folder to be found.
de: Die Bilder müssen im richtigen Ordner gespeichert sein, damit sie gefunden werden können.

source: You can place and customize as many actors as you like with different costumes.
de: Du kannst beliebig viele Actors mit unterschiedlichen Costumes platzieren und anpassen.

source: My actor is facing the wrong direction. What can I do?
de: Mein Actor schaut in die falsche Richtung. Was kann ich tun?

source: If your actor is pointing in the wrong direction, here are two simple fixes:
de: Wenn dein Actor in die falsche Richtung zeigt, gibt es zwei einfache Lösungen:

source: Actor orientation
de: Actor Ausrichtung

source: The image is oriented upwards. However, Miniworlds expects images to face to the right.
de: Das Bild ist nach oben ausgerichtet. Miniworlds erwartet jedoch, dass Bilder nach rechts zeigen.

source: So in this example, the actor appears to be facing the wrong direction.
de: In diesem Beispiel sieht es so aus, als schaue der Actor in die falsche Richtung.

source: **Rotate the image**: You can rotate the image using an image editor so that it faces the desired direction (usually rightwards).
de: **Bild drehen**: Du kannst das Bild mit einem Bildbearbeitungsprogramm so drehen, dass es in die gewünschte Richtung zeigt (in der Regel nach rechts).

source: **Adjust orientation in code**: Alternatively, you can rotate the costume directly in Miniworlds using the `orientation` attribute:
de: **Ausrichtung im Code anpassen**: Alternativ kannst du das Costume direkt in Miniworlds über das Attribut `orientation` drehen:

source: You can also use other values like `-90` or `180` to get the correct orientation, depending on how your image is designed.
de: Du kannst auch andere Werte wie `-90` oder `180` verwenden, um die richtige Ausrichtung zu erreichen – je nachdem, wie dein Bild gestaltet ist.

source: The example above can be corrected like this:
de: Das obige Beispiel kann so korrigiert werden:

source: **Explanation**:
de: **Erklärung**:

source: The image was rotated -90° to the left relative to the expected position. This correction makes the actor face the right direction in-game.
de: Das Bild war um -90° nach links gegenüber der erwarteten Position gedreht. Diese Korrektur sorgt dafür, dass der Actor im Spiel in die richtige Richtung schaut.

source: How do I prevent the costume from rotating with the actor?
de: Wie verhindere ich, dass sich das Costume mit dem Actor mitdreht?

source: If you want the costume to stay fixed and not rotate with the actor’s movement or orientation, you can disable costume rotation by setting `is_rotatable` to `False`:
de: Wenn du möchtest, dass sich das Costume nicht mit der Bewegung oder Ausrichtung des Actors mitdreht, kannst du die Drehung des Costumes deaktivieren, indem du `is_rotatable` auf `False` setzt:
