Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/03_01_actors_position.po
Languages: de

source: Positionierung und Ausrichtung von Actors
de: Positioning and alignment of actors

source: In diesem Abschnitt lernst du, wie du Actors im Koordinatensystem positionieren und ausrichten kannst.
de: In this section, you will learn how to position and align actors in the coordinate system.

source: Grundlagen
de: Basics

source: Zunächst eine kurze Wiederholung der wesentlichen Konzepte:
de: First, a brief review of the essential concepts:

source: Du kannst einen Actor an einer beliebigen Position erstellen:
de: You can create an actor at any position:

source: Das Koordinatensystem hat seinen Ursprung oben links:
de: The coordinate system has its origin at the top left:

source: Das Koordinatensystem
de: The coordinate system

source: Die Position eines Actors bezieht sich immer auf dessen **Mittelpunkt** (auch Ursprung genannt).
de: The position of an actor always refers to its **center** (also called origin).

source: Position eines Actors nachträglich ändern
de: Position eines Akteurs nachträglich ändern

source: Du kannst die Position eines Actors auch nach dessen Erstellung anpassen, indem du die Attribute `x`, `y` oder `position? änderst:
de: You can also adjust the position of an actor after its creation by changing the attributes `x`, `y`, or `position`:

source: Ausrichtung des Actors ändern
de: Change actor's orientation

source: In der folgenden Darstellung siehst du, wie der Wert für `Direction` zu interpretieren ist.
de: In the following illustration, you can see how the value for `Direction` is to be interpreted.

source: Ausrichtung des Actors
de: Orientation des Akteurs

source: 0 up
de: 0 hoch

source: 90 right | -90 left
de: 90 rechts | -90 links

source: 180 oder - 180 down
de: 180 oder - 180 runter

source: Ursprung des Actors ändern
de: Ursprung des Akteurs ändern

source: Du kannst den Ursprung (den Punkt, auf den sich die Position des Actors bezieht) ändern. Dies wird durch das Attribut `origin` festgelegt:
de: You can change the origin (the point to which the actor's position refers). This is set by the `origin` attribute:

source: (0|20) bezeichnet jetzt die obere linke Koordinate des Actors.
de: (0|20) now refers to the top-left coordinate of the actor.

source: Du kannst auch spezifisch das Zentrum oder die linke obere Ecke des Actors festlegen:
de: You can also specifically set the center or the top left corner of the actor:
