Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/04_02_messages.po
Languages: de

source: Messages
de: Nachrichten

source: Sending Messages
de: Nachrichten senden

source: With **`send_message(self, message)`**, you can send a message to all objects in your world. These messages can be received and handled by other objects that are listening for that specific event.
de: Mit **`send_message(self, message)`** kannst du eine Nachricht an alle Objekte in deiner World senden. Diese Nachrichten können von anderen Objekten empfangen und verarbeitet werden, wenn sie auf dieses bestimmte Event hören.

source: Example:
de: Beispiel:

source: In this example, player 1 sends a message when they move:
de: In diesem Beispiel sendet player1 eine Nachricht, sobald er sich bewegt:

source: Receiving Messages
de: Nachrichten empfangen

source: You can register a handler for a message using the `@register_message("message")` decorator:
de: Du kannst einen Handler für eine Nachricht mit dem Dekorator `@register_message("message")` registrieren:

source: In the following example, the message sent by player1 is received by player2. Player2 then moves toward player1 whenever player1 moves.
de: Im folgenden Beispiel wird die Nachricht, die player1 sendet, von player2 empfangen. Player2 bewegt sich dann in Richtung von player1, sobald sich player1 bewegt.

source: Explanation:
de: Erklärung:

source: In this example, **player1** sends the message `"p1moved"` when the <kbd>A</kbd> key is pressed.
de: In diesem Beispiel sendet **player1** die Nachricht `"p1moved"`, wenn die Taste <kbd>A</kbd> gedrückt wird.

source: **player2** has a method registered to listen for that message. As soon as **player1** moves, **player2** receives the message and moves toward **player1**.
de: **player2** hat eine Methode registriert, die auf diese Nachricht hört. Sobald sich **player1** bewegt, empfängt **player2** die Nachricht und bewegt sich in Richtung **player1**.
