Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/04_01_events.po
Languages: de

source: Make Your Game Interactive
de: Mach dein Spiel interaktiv

source: In this section, you'll learn how to make your game interactive by responding to keyboard input, mouse actions, or collisions.
de: In diesem Abschnitt lernst du, wie du dein Spiel interaktiv gestalten kannst, indem du auf Tastatureingaben, Mausaktionen oder Kollisionen reagierst.

source: What Are Events?
de: Was sind Events?

source: **Events** are the key to interactive games. They allow your game to respond to user actions such as key presses or mouse movements, and dynamically change the behavior of your actors.
de: **Events** sind der Schlüssel zu interaktiven Spielen. Sie ermöglichen es deinem Spiel, auf Benutzeraktionen wie Tastendrücke oder Mausbewegungen zu reagieren und das Verhalten deiner Actors dynamisch zu verändern.

source: **`on_setup()`**: Called at the beginning to initialize and prepare your world.
de: **`on_setup()`**: Wird zu Beginn aufgerufen, um deine World zu initialisieren und vorzubereiten.

source: **`act()`**: Called on every frame to update the world and its actors.
de: **`act()`**: Wird in jedem Frame aufgerufen, um die World und ihre Actors zu aktualisieren.

source: There are special event methods like **`on_key_pressed`**, **`on_mouse_left`**, or **`on_clicked_left`** to respond to user actions.
de: Es gibt spezielle Event-Methoden wie **`on_key_pressed`**, **`on_mouse_left`** oder **`on_clicked_left`**, um auf Benutzeraktionen zu reagieren.

source: Registering Events
de: Events registrieren

source: For an actor or the world to respond to an event, the corresponding method must be **registered** — just like with the `act()` method.
de: Damit ein Actor oder die World auf ein Event reagieren kann, muss die entsprechende Methode **registriert** werden – genau wie bei der Methode `act()`.

source: Example: Simple Keyboard Input
de: Beispiel: Einfache Tastatureingabe

source: Explanation:
de: Erklärung:

source: This method is executed when the <kbd>w</kbd> key is pressed. The `player` actor moves up by one step.
de: Diese Methode wird ausgeführt, wenn die Taste <kbd>w</kbd> gedrückt wird. Der Actor `player` bewegt sich um einen Schritt nach oben.

source: Example: Multi-Key Movement
de: Beispiel: Steuerung mit mehreren Tasten

source: In the next example, an actor is controlled using the <kbd>W</kbd>, <kbd>A</kbd>, <kbd>S</kbd>, and <kbd>D</kbd> keys:
de: Im nächsten Beispiel wird ein Actor mit den Tasten <kbd>W</kbd>, <kbd>A</kbd>, <kbd>S</kbd> und <kbd>D</kbd> gesteuert:

source: In this example, the actor is controlled as follows:
de: In diesem Beispiel wird der Actor wie folgt gesteuert:

source: <kbd>W</kbd>: Move up
de: <kbd>W</kbd>: Nach oben bewegen

source: <kbd>A</kbd>: Move left
de: <kbd>A</kbd>: Nach links bewegen

source: <kbd>D</kbd>: Move right
de: <kbd>D</kbd>: Nach rechts bewegen

source: <kbd>S</kbd>: Move down
de: <kbd>S</kbd>: Nach unten bewegen

source: Difference: `on_key_down` vs. `on_key_pressed`
de: Unterschied: `on_key_down` vs. `on_key_pressed`

source: There are two types of keyboard events for handling key input:
de: Es gibt zwei Arten von Tastatur-Events zur Verarbeitung von Tasten-Eingaben:

source: **`on_key_down(self, key)`**: Called once when the key is initially pressed.
de: **`on_key_down(self, key)`**: Wird einmal aufgerufen, wenn die Taste gedrückt wird.

source: **`on_key_pressed(self, key)`**: Continuously called while the key is being held down.
de: **`on_key_pressed(self, key)`**: Wird fortlaufend aufgerufen, solange die Taste gedrückt gehalten wird.

source: Example: Different Keyboard Events
de: Beispiel: Unterschiedliche Tastatur-Events

source: You can either define specific keys like `on_key_down_b(self)` or handle all key input using `on_key_down(self, key)` for general keyboard event handling.
de: Du kannst entweder bestimmte Tasten wie `on_key_down_b(self)` definieren oder allgemeine Tasteneingaben über `on_key_down(self, key)` verarbeiten.
