Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/04_00_act.po
Languages: de

source: So far, you’ve learned how to create worlds and place actors in them. Now it’s time to bring things to life:
de: Bis jetzt hast du gelernt, wie man Worlds erstellt und Actors darin platziert. Jetzt ist es Zeit, alles zum Leben zu erwecken:

source: The `act()` Method
de: Die Methode `act()`

source: The `act()` method controls the behavior of your world and all its actors. It is called once every frame (i.e., every `world.step` time unit), continuing until the program ends.
de: Die Methode `act()` steuert das Verhalten deiner World und aller enthaltenen Actors. Sie wird in jedem Frame (also bei jedem `world.step`) aufgerufen und läuft, bis das Programm beendet wird.

source: ![First Actor](../_images/act.png)
de: ![Erster Actor](../_images/act.png)

source: First Actor
de: Erster Actor

source: Example: Moving Actor
de: Beispiel: Bewegender Actor

source: When you create an `Actor`, you can define its `act()` method and register it using the `@register` decorator:
de: Wenn du einen `Actor` erstellst, kannst du seine Methode `act()` definieren und mit dem Decorator `@register` registrieren:

source: Explanation
de: Erklärung

source: The `act()` method moves the `player` up by one unit on every frame.
de: Die Methode `act()` bewegt den `player` in jedem Frame um eine Einheit nach oben.

source: New here is the use of `self`, which lets the object refer to itself. So the line `self.y = self.y - 1` means the `player` object is reducing its own y-coordinate by 1.
de: Neu ist hier die Verwendung von `self`, wodurch das Objekt auf sich selbst zugreifen kann. Die Zeile `self.y = self.y - 1` bedeutet, dass das Objekt `player` seine eigene y-Koordinate um 1 verringert.
