Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/05_movement.po
Languages: de

source: Bewegungen
de: Movements

source: Grundlagen
de: Basics

source: Bevor wir tiefer in die Bewegungsfunktionen eintauchen, hier eine kurze Wiederholung der wichtigsten Konzepte:
de: Before we dive deeper into the movement functions, here's a brief review of the most important concepts:

source: Mit **`self.direction`**, **`self.x`**, **`self.y`** und **`self.position`** kannst du die Position und Ausrichtung eines Akteurs direkt steuern.
de: With **`self.direction`**, **`self.x`**, **`self.y`**, and **`self.position`**, you can directly control the position and orientation of an actor.

source: Darüber hinaus gibt es spezielle Methoden, mit denen du einen Akteur geradeaus oder in bestimmte Richtungen bewegen kannst.
de: In addition, there are special methods that allow you to move an actor straight or in specific directions.

source: Die `move()`-Funktion
de: The `move()` function

source: Die Methode **`move()`** bewegt deinen Akteur in die Richtung, in die er gerade schaut (basierend auf der aktuellen **`direction`**). Wenn du die **`direction`** vorher änderst, passt sich die Bewegung automatisch an die neue Ausrichtung an.
de: The **`move()`** method moves your actor in the direction it is currently facing (based on the current **`direction`**). If you change the **`direction`** beforehand, the movement will automatically adapt to the new orientation.

source: `turn_left()` und `turn_right()`
de: `turn_left()` and `turn_right()`

source: Mit **`turn_left()`** und **`turn_right()`** kannst du den Akteur um eine bestimmte Gradzahl nach links oder rechts drehen.
de: With **`turn_left()`** and **`turn_right()`**, you can turn the actor by a certain number of degrees to the left or right.

source: **`player.turn_left(degrees)`**: Dreht den Akteur um **degrees** Grad nach links.
de: **`player.turn_left(degrees)`**: Turns the actor by **degrees** degrees to the left.

source: **`player.turn_right(degrees)`**: Dreht den Akteur um **degrees** Grad nach rechts.
de: **`player.turn_right(degrees)`**: Turns the actor by **degrees** degrees to the right.

source: Beispiel:
de: Example:

source: Alternativ zur Standardbewegung kannst du den Akteur mit **`move_in_direction()`** in eine beliebige Richtung bewegen, indem du einen Winkel angibst.
de: Alternatively to the standard movement, you can move the actor in any direction using **`move_in_direction()`** by specifying an angle.

source: Beispiel: Bewegung schräg nach oben
de: Example: Moving diagonally upwards

source: Beispiel: Bewegung in Richtung des Mauszeigers
de: Example: Moving in the direction of the mouse cursor

source: Das folgende Beispiel zeigt, wie der Akteur mithilfe von **`move_in_direction()`** der Position des Mauszeigers folgt:
de: The following example shows how the actor follows the position of the mouse pointer using **`move_in_direction()`**:

source: `move_in_direction()`
de: Bewegen_in_Richtung()
