Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/06_00_sensors.po
Languages: de

source: Sensoren
de: Sensors

source: Actors verfügen über **Sensoren**, mit denen sie ihre Umwelt abtasten können und z.B andere Actors an ihrer Position aufspüren können.
de: Actor haben **Sensoren**, mit denen sie ihre Umgebung scannen können und z.B. andere Actor an ihrer Position lokalisieren können.

source: Es gibt zwei Möglichkeiten, Sensoren zu verwenden:
de: There are two possibilities to use sensors:

source: Du kannst Objekte "aktiv" aufspüren.
de: You can track objects "actively."

source: Du kannst Events registrieren, die durch Sensoren getriggert werden.
de: You can register events triggered by sensors.

source: Objekte aufspüren
de: Find objects

source: Du kannst Objekte aufspüren, indem du die Sensoren eines Akteurs direkt nutzt. Hier ein Beispiel, wie das funktioniert:
de: You can track objects by directly using the sensors of an actor. Here's an example of how it works:

source: Ausgabe
de: Issue

source: Erklärung
de: Explanation

source: In der `act()`-Methode des Rechtecks wird der Sensor **`self.detect()`** verwendet, um zu prüfen, ob sich an der aktuellen Position ein anderer Akteur befindet. Wenn das Rechteck ein Objekt erkennt, ändert es seine Farbe. Die Variable actor enthält den gefundenen Actor. Wenn kein Akteur gefunden wird, gibt die Methode `None` zurück.
de: In the `act()` method of the rectangle, the sensor **`self.detect()`** is used to check if another actor is located at the current position. If the rectangle detects an object, it changes its color. The variable actor contains the found Actor. If no actor is found, the method returns `None`.

source: Die Anweisung `if actor` ist eine Abkürzung für `if actor != None`. Man kann so überprüfen, ob eine Variable einen Wert enthält.
de: The instruction `if actor` is a shortcut for `if actor != None`. One can check if a variable contains a value like this.

source: Ereignisse registrieren
de: Events aufnehmen

source: Im obigen Beispiel wurde **aktiv** nach Akteuren gesucht. Alternativ kannst du ein Ereignis registrieren, das automatisch aufgerufen wird, wenn der Sensor etwas entdeckt:
de: Im above example was **active** searched for actors. Alternatively you can register an event which is automatically called when the sensor detects something:

source: Erklärung:
de: Explanation:

source: Die registrierte Methode **`on_detecting(self, other)`** wird aufgerufen, sobald der Akteur ein anderes Objekt an seiner Position entdeckt.
de: The registered method **`on_detecting(self, other)`** is called as soon as the actor detects another object at its position.

source: Der Parameter **`other`** repräsentiert das gefundene Objekt, sodass du herausfinden kannst, welcher Akteur entdeckt wurde.
de: The parameter **`other`** represents the found object, so you can find out which actor was discovered.

source: Unterschiedliche Objekte erkennen
de: Recognize different objects

source: Mit Sensoren und **if-else-Verzweigungen** kannst du bestimmen, welches spezifische Objekt gefunden wurde:
de: Mit Sensoren un 2-if-4-Verzweigungen k£nst du bestimmen, welches spezifische Objekt gefunden wurde:

source: In der Methode **`on_detecting`** wird überprüft, ob das erkannte Objekt **`c1`** oder **`c2`** ist, und die Farbe des Rechtecks wird entsprechend angepasst.
de: In the method **`on_detecting`** wird überprüft, ob das erkannte Objekt **`c1`** oder **`c2`** ist, und die Farbe des Rechtecks wird entsprechend angepasst.

source: Beispiel: Kollision mit Wänden verhindern
de: Example: Avoid collision with walls

source: Mit Sensoren kannst du auch verhindern, dass sich Objekte durch Wände bewegen. Hier ein Beispiel:
de: With sensors you can also prevent objects from moving through walls. Here is an example:

source: FAQ
de: Q&A

source: **Meine Kollisionen werden nicht erkannt, was kann ich tun?**
de: My collisions are not detected, what can I do?

source: Teste zuerst, ob die Methode überhaupt aufgerufen wird. Füge dazu eine `print`-Anweisung ein:
de: Test first if the method is even called. Add a `print` statement for that.

source: Falls die `print`-Anweisung nicht aufgerufen wird, funktioniert der Sensor nicht.
de: If the `print` statement is not called, the sensor does not work.
