Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/07_animations.po
Languages: de

source: Kostüme und Animationen
de: Costumes und Animationen

source: Jeder Actor verfügt über ein oder mehrere Kostüme. Diese Kostüme bestehen aus mehreren Bildern, die für Animationen verwendet werden können.
de: Each actor has one or more costumes. These costumes consist of several images that can be used for animations.

source: Wenn du in der *API* nach den Attributen und Methoden der Klasse `Costume` suchst, findest du sie unter der Klasse `Appearance`. `Appearance` ist die Oberklasse von `Costume` und `Background`, da sich Hintergründe und Kostüme in vielen Eigenschaften ähneln.
de: If you search in the *API* for the attributes and methods of the class `Costume`, you will find them under the class `Appearance`. `Appearance` is the superclass of `Costume` and `Background`, as backgrounds and costumes share many properties.

source: Ein Kostüm hinzufügen
de: Add a costume

source: Mit der folgenden Funktion kannst du ein neues Kostüm zu einem Actor hinzufügen:
de: With the following function you can add a new costume to an actor:

source: Falls noch kein Kostüm vorhanden ist, wird dieses automatisch das erste Kostüm des Actors.
de: If no costume exists, this will automatically become the actor's first costume.

source: Weitere Bilder zu einem Kostüm hinzufügen
de: Add more pictures to a costume

source: Um ein Kostüm zu erweitern, kannst du mit der Methode `add_image` zusätzliche Bilder hinzufügen:
de: To expand a costume, you can add additional images with the method `add_image`:

source: Alternativ kannst du auch eine Liste von Bildern gleichzeitig hinzufügen:
de: Alternatively you can also add a list of images at the same time:

source: Animationen
de: Animations

source: 2D-Animationen funktionieren ähnlich wie ein Daumenkino:
de: 2D-Animationen work similar like a flip book:

source: Indem die Bilder eines Actors schnell hintereinander gewechselt werden, entsteht der Eindruck einer Bewegung.
de: By changing the images of an actor quickly one after the other, the impression of movement is created.

source: ![Kostüme für den Actor](../_images/costumes.png)
de: Kostüme für den Schauspieler

source: Kostüme für den Actor
de: Costumes for the actor

source: Um eine Animation zu erstellen, musst du zunächst mehrere Bilder zu einem Kostüm hinzufügen (siehe oben).
de: To create an animation, you first have to add several images to a costume (see above).

source: Dann kannst du die animation mit dem Befehl `costume.animate()` starten. Mit dem Parameter `loop` kannst du festlegen, ob die Animation wiederholt werden soll:
de: Then you can start the animation with the command `costume.animate()`. With the parameter `loop` you can specify whether the animation should be repeated.

source: Beispiel:
de: Example:

source: Zwischen Kostümen wechseln
de: Switch between costumes

source: Um zwischen verschiedenen Kostümen zu wechseln, kannst du die Methode `switch_costume` verwenden:
de: To switch between different costumes, you can use the method `switch_costume`:

source: Diese Methode wechselt zum nächsten Kostüm in der Liste. Du kannst optional auch eine Zahl als Parameter angeben, um direkt zu einem bestimmten Kostüm zu springen:
de: This method switches to the next costume in the list. You can also optionally specify a number as a parameter to jump directly to a specific costume:
