Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/09_timers.po
Languages: de

source: Timers
de: Timer

source: With **timers**, you can execute events **with a delay**. This means an action doesn’t happen immediately, but after a specified delay in milliseconds or frames.
de: Mit **Timern** kannst du Ereignisse **mit einer Verzögerung** ausführen. Das bedeutet, dass eine Aktion nicht sofort, sondern erst nach einer bestimmten Anzahl an Millisekunden oder Frames stattfindet.

source: Timers are useful, for example, if you want something to happen after a certain amount of time.
de: Timer sind hilfreich, wenn etwas erst nach einer bestimmten Zeit passieren soll.

source: \:::{note} Python’s `time` library offers the function `time.sleep(...)` to create delays. However, you should **not** use it here, as it causes global pauses and may lead to unwanted side effects. \:::
de: \:::{note} Pythons `time`-Bibliothek enthält die Funktion `time.sleep(...)`, um Verzögerungen zu erzeugen. Diese sollte hier jedoch **nicht** verwendet werden, da sie globale Pausen verursacht und zu unerwünschten Nebeneffekten führen kann. \:::

source: Starting a Timer
de: Einen Timer starten

source: To start a timer, you can use the following example:
de: Um einen Timer zu starten, kannst du folgendes Beispiel verwenden:

source: Explanation
de: Erklärung

source: After 24 frames, the timer is triggered.
de: Nach 24 Frames wird der Timer ausgelöst.

source: The method `player.move` is then executed.
de: Dann wird die Methode `player.move` ausgeführt.

source: Different Timer Types
de: Verschiedene Timer-Typen

source: There are different types of timers, depending on your use case:
de: Je nach Anwendungsfall gibt es verschiedene Arten von Timern:

source: The **ActionTimer** executes a method once after a set amount of time, then removes itself automatically. It’s ideal for one-time delayed actions.
de: Der **ActionTimer** führt nach einer bestimmten Zeit eine Methode einmalig aus und entfernt sich danach automatisch. Er eignet sich gut für verzögerte Einzelaktionen.

source: In this example, the `move` function of the `player` object is executed once after 24 frames.
de: In diesem Beispiel wird die `move`-Funktion des Objekts `player` einmalig nach 24 Frames ausgeführt.

source: The **LoopActionTimer** works similarly to the ActionTimer but repeats the action at regular intervals. It’s ideal for actions that should occur continuously.
de: Der **LoopActionTimer** funktioniert ähnlich wie der ActionTimer, wiederholt die Aktion jedoch in regelmäßigen Abständen. Er eignet sich für fortlaufende Aktionen.

source: Here, the `move` method of the `player` will be executed every 24 frames.
de: Hier wird die Methode `move` des `player` alle 24 Frames ausgeführt.

source: To stop a `LoopActionTimer`, you can unregister it:
de: Um einen `LoopActionTimer` zu stoppen, kannst du ihn wie folgt entfernen:

source: Linking Timers to Events
de: Timer mit Ereignissen verknüpfen

source: Just like with sensors, you can configure timers to trigger methods at specific times. To do this, register methods that should be executed on a timer event.
de: Ähnlich wie bei Sensoren kannst du Timer so konfigurieren, dass Methoden zu bestimmten Zeiten ausgeführt werden. Dazu registrierst du Methoden, die bei einem Timer-Ereignis aufgerufen werden sollen.

source: Example of a one-time timer event:
de: Beispiel für ein einmaliges Timer-Ereignis:

source: In this case, the `moving` function is executed once after 24 frames, triggering `player.move()`.
de: In diesem Fall wird die Funktion `moving` einmalig nach 24 Frames aufgerufen und führt `player.move()` aus.

source: To register a **looping timer** that repeats regularly, use:
de: Um einen **wiederholenden Timer** zu registrieren, verwende:

source: Here, the `moving` method is called every 48 frames, turning the actor left and moving it forward.
de: Hier wird die Methode `moving` alle 48 Frames aufgerufen, dreht den Actor nach links und bewegt ihn vorwärts.
