Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/tutorial/10_status.po
Languages: de

source: Text and Numbers
de: Text und Zahlen

source: Score / Game Status
de: Punktestand / Spielstatus

source: In many games, you’ll want to display the current score or other status indicators.
de: In vielen Spielen möchtest du den aktuellen Punktestand oder andere Statusanzeigen einblenden.

source: **Miniworlds** provides special actor types like **Text** and **Number** actors that help you display this information easily.
de: **Miniworlds** bietet dafür spezielle Akteurstypen wie **Text**- und **Number**-Akteure, mit denen du solche Informationen leicht anzeigen kannst.

source: Creating Text
de: Text erstellen

source: To display text, you can use the following:
de: Um Text anzuzeigen, kannst du Folgendes verwenden:

source: `position`: A tuple that defines the top-left corner of the text.
de: `position`: Ein Tupel, das die obere linke Ecke des Texts definiert.

source: `string`: The text to display.
de: `string`: Der anzuzeigende Text.

source: \:::{note} In a regular **World**, the text is automatically scaled. In a **TiledWorld**, the text is shown inside a tile, which can cause space issues for longer text. \:::
de: \:::{note} In einer normalen **World** wird der Text automatisch skaliert. In einer **TiledWorld** wird der Text innerhalb einer Kachel dargestellt, was bei längeren Texten zu Platzproblemen führen kann. \:::

source: Example:
de: Beispiel:

source: Text example
de: Textbeispiel

source: Changing Text
de: Text ändern

source: You can update the displayed text at any time using the `text` attribute.
de: Du kannst den angezeigten Text jederzeit über das Attribut `text` ändern.

source: The following example shows the most recently pressed key:
de: Das folgende Beispiel zeigt die zuletzt gedrückte Taste an:

source: Text with key input
de: Text mit Tasteneingabe

source: Displaying Numbers
de: Zahlen anzeigen

source: To show numbers on screen, you can use **Number actors**. They work similarly to text actors. In the following example, the number increases by 1 every time a key is pressed:
de: Um Zahlen auf dem Bildschirm anzuzeigen, kannst du **Number-Akteure** verwenden. Sie funktionieren ähnlich wie Text-Akteure. Im folgenden Beispiel erhöht sich die angezeigte Zahl bei jedem Tastendruck um 1:
