Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/02_scrolling.po
Languages: de

source: Scrolling
de: Scrollen

source: Oft möchtest du den Bildschirm "scrollen lassen.
de: Often you want to let the screen "scroll".

source: Die einfachste Möglichkeit dazu ist es einen Hintergrund zu "verschieben":
de: The simplest way to do this is to "move" a background.

source: Damit dies wirklich gut funktioniert, musst du den Hintergrund als "Actor anlegen" und benötigst zwei Hintergründe.
de: In order for this to work really well, you have to create the background as "actor" and need two backgrounds.

source: ![scrolling background](../_images/scrolling.png)
de: ![scrollendender Hintergrund](../_images/scrolling.png)

source: scrolling background
de: scrollendes Hintergrund

source: Beide Hintergründe wandern von rechts nach links (oder von oben nach unten, links nach rechts, ... - Je nach Spiel) - Sobald ein Hintergrund das Spielfeld verlassen würde, wird er wieder ganz rechts angefügt.
de: Both backgrounds move from right to left (or from top to bottom, left to right, ... - Depending on the game) - As soon as a background would leave the playing field, it is added back in all the way to the right.

source: Auf diese Weise entsteht der Eindruck einer "unendlich langen Landschaft".
de: In this way arises the impression of a "infinitely long landscape".

source: Lege mden Hintergrund zweimal mit dem gleichen Hintergrund an und platziere diese nebeneinander.
de: Read the background twice with the same background and place them side by side.

source: Es kann sinnvoll sein die Hintergründe in einer Liste zu speichern, da du sie dann gemeinsam bewegen kannst.
de: It can be useful to save the backgrounds in a list, because then you can move them together.

source: In der `world.act`-Methode die jedes Frame einmal aufgerufen wird, kannst den Bildschirm langsam verschieben:
de: In the `world.act` method that is called once every frame, you can slowly move the screen:

source: Als Code sieht dies so aus:
de: The translated text in German is: Es sieht so aus:

source: Notiz: Die Idee stammt von dem Blog [schockwellenreiter](http://blog.schockwellenreiter.de/2022/05/2022051502.html) - Jörg Kantereit hat dort dieses Snippet mit Pygame Zero programmiert.
de: Notiz: The idea comes from the blog [schockwellenreiter](http://blog.schockwellenreiter.de/2022/05/2022051502.html) - Jörg Kantereit programmed this snippet with Pygame Zero there. Hinweis: Die Idee stammt vom Blog [schockwellenreiter](http://blog.schockwellenreiter.de/2022/05/2022051502.html) - Jörg Kantereit hat dort dieses Snippet mit Pygame Zero programmiert.
