Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/03_game_over.po
Languages: de

source: Game Over
de: Spiel vorbei

source: Typischerweise passiert bei einem Game-Over-Event folgendes:
de: Typically happens at a game-over event the following:

source: Das Spiel wird angehalten
de: The game is paused

source: Ein Text erscheint (ggf. mit einer High-Score)
de: A text appears (possibly with a high score)

source: Es gibt eine Möglichkeit das Spiel neu zu starten.
de: There is a possibility to restart the game.

source: Zunächst macht es dazu Sinn eine Methode zu erstellen, die alle Actors erstellt, die beim Start eines Spiels erstellt werden sollen:
de: First, it makes sense to create a method that creates all actors that should be created at the start of a game:

source: In dieser Methode wird z.B. ein Spieler-Objekt erstellt und auch bereits Events an dieses Spieler-Objekt registriert. Wenn z.B. ein anderes Actor aufgespürt wird, dann wird die `game_over`-Methode getriggert.
de: In this method, for example, a player object is created and events are already registered to this player object. If another actor is detected, the `game_over` method is triggered.

source: In der `game_over`-Methode wird das World angehalten:
de: In the `game_over` method the World is paused.

source: Global wird überprüft, ob die SPACE-Taste gedrückt wird - Wenn das World angehalten wird, wird die `restart`-Methode getriggert:
de: Global is checked if the SPACE key is pressed - If the World is paused, the `restart` method is triggered:

source: Die restart-Methode löscht alle Actors, startet das World erneut und ruft `setup` auf
de: The restart method deletes all Actors, restarts the World and calls `setup`

source: Insgesamt sieht dies dann so aus:
de: Overall, this looks like this:
