Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/04_level_loading.po
Languages: de

source: Level Loading
de: Level laden

source: A common use case: You want to load a new level when a character reaches the edge of the screen or enters a door, etc.
de: Ein häufiger Anwendungsfall: Du möchtest ein neues Level laden, wenn eine Spielfigur den Rand des Bildschirms erreicht oder durch eine Tür geht usw.

source: You can do this as follows:
de: Das kannst du folgendermaßen umsetzen:

source: Store your level in a database, a text file, or a simple list.
de: Speichere dein Level in einer Datenbank, einer Textdatei oder einer einfachen Liste.

source: You need a **function** that loads the level when something happens (you reach the edge, touch an actor, ...)
de: Du brauchst eine **Funktion**, die das Level lädt, sobald etwas passiert (du erreichst den Rand, berührst einen Actor, ...).

source: Storing your level as a list
de: Speichern des Levels als Liste

source: You can store your level in a two-dimensional list. A very simple case might look like this:
de: Du kannst dein Level in einer zweidimensionalen Liste speichern. Ein ganz einfacher Fall könnte so aussehen:

source: You then need a translation to actors — `w` stands for `Wall`, `d` for `Door`.
de: `w` steht dabei für `Wall`, `d` für `Door`.

source: You can store your rooms in a list or a dictionary, for example:
de: Du kannst deine Räume zum Beispiel in einer Liste oder einem Dictionary speichern:

source: ...or like this:
de: ...oder so:

source: Creating classes for individual objects
de: Klassen für einzelne Objekte erstellen

source: To create objects of a specific kind, it's useful to define a class:
de: Um Objekte einer bestimmten Art zu erzeugen, ist es sinnvoll, eine Klasse zu definieren:

source: Translating the list
de: Übersetzen der Liste

source: You can now translate the list into actors:
de: Du kannst die Liste jetzt in Actors übersetzen:

source: Switching rooms
de: Raumwechsel

source: With the groundwork done, switching rooms is easy — just call `setup_room` at the right moment:
de: Mit dieser Vorarbeit ist ein Raumwechsel ganz einfach — du musst einfach nur `setup_room` im richtigen Moment aufrufen:

source: Complete example:
de: Vollständiges Beispiel:

source: When the player is on the door and presses the spacebar, the room changes.
de: Wenn der Spieler auf der Tür steht und die Leertaste drückt, wird der Raum gewechselt.
