Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/05_database.po
Languages: de

source: Daten aus der Datenbank laden
de: Load data from the database

source: In diesem Artikel wirst du lernen, wie man ein Datenmodell erstellt und dieses mit einer Datenbank synchronisiert. Du kannst dies für vielfältige Zwecke einsetzen, z.B. Fragen und Antworten in einem Quiz-Spiel, eine High-Score, Laden von Spieldaten, ...
de: In this article, you will learn how to create a data model and synchronize it with a database. You can use this for various purposes, e.g., questions and answers in a quiz game, a high score, loading game data, ...

source: Eine Highscore z.B. könntest du als einfache Liste speichern, in der du Namen und Punktezahl speicherst, z.B. so:
de: A high score, for example, you could store as a simple list in which you store names and scores, like this:

source: Die Reihenfolge der Daten spielt noch keine Rolle, denn du kannst diese ja jederzeit sortieren
de: The order of the data does not matter yet, because you can sort it at any time

source: Deine Klasse könnte also erstmal so aussehen:
de: So könnte deine Klasse zunächst aussehen:

source: Die Klasse enthält ein Attribut `scores`, welches entweder aus dem Parameter der __init__-Methode gelesen wird oder eine leere Liste enthält.
de: The class contains an attribute `scores`, which is either read from the parameter of the __init__ method or contains an empty list.

source: Einrichten der Datenbank
de: Setting up the database

source: Mit dem Programm DBBrowser for sqlite kannst du die Datenbank einrichten.
de: With the program DBBrowser for sqlite, you can set up the database.

source: Richte einer Tabelle und 3 Feldern ein: Name, Score und ID.
de: Richte eine Tabelle mit 3 Feldern ein: Name, Punktzahl und ID.

source: ![Database](../_images/database1.png)
de: ![Datenbank](../_images/database1.png)

source: Database
de: Datenbank

source: Warum benötige ich eine ID?
de: Why do I need an ID?

source: Wenn du dein Programm später erweitern willst, dann können die einzelnen Datensätze in der Tabelle nur identifiziert werden, wenn du ein eindeutiges Attribut ergänzt. Daher ist es sinnvoll eine *ID* zu ergänzen.
de: If you want to expand your program later, the individual records in the table can only be identified if you add a unique attribute. Therefore, it makes sense to add an *ID*.

source: Speichere Beispieldaten in die Datenbank, damit du damit später das Einlesen testen kannst:
de: Save sample data in the database so you can test reading it later:

source: ![Database](../_images/database2.png)
de: ![Datenbank](../_images/database2.png)

source: Aus der Datenbank lesen
de: Read from the database

source: Als nächstes kannst du eine Methode zum Lesen der Daten implementieren.
de: Next, you can implement a method to read the data.

source: Füge dazu folgende Klasse deiner Datenbank hinzu:
de: Addiere die folgende Klasse zu deiner Datenbank:

source: Die Methode ist eine `classmethod` - Diese Methoden dienen dazu, Objekte einer Klasse (wie eine Art *Factory*) zu erzeugen, in diesem Fall wird ein neues Highscore-Objekt mit Daten aus der Datenbank erzeugt.
de: The method is a `classmethod` - These methods are used to create objects of a class (like a kind of *Factory*), in this case, a new highscore object is created with data from the database.

source: Zunächst wird dazu eine Verbindung aufgebaut. Hier muss der Dateiname zu deiner sqlite3-Datenbank angegegeben werden.
de: First, a connection is established. Here, the filename of your sqlite3 database must be specified.

source: Anschließend wird ein Cursor erstellt, der SQL-Abfragen aus der Datenbank auslesen und diese ausführen kann.
de: Then a cursor is created that can read SQL queries from the database and execute them.

source: Aufgabe: Sortiere die Ergebnisse der Highscore absteigend.
de: Task: Sort the high score results in descending order.

source: Du kannst dein Programm testen, indem du am Ende der Datei ein Highscore-Objekt erzeugst. Vergiss aber nicht dies zu löschen, wenn du die Datei später importierst!
de: You can test your program by creating a highscore object at the end of the file. But don't forget to delete it when you import the file later!

source: Ergänze folgende Funktion, um in die Datenbank zu schreiben:
de: Add the following function to write to the database:

source: Hier wird wieder zunächst eine Verbindung aufgebaut und ein Cursor erstellt, der diesesmal eine INSERT-Anfrage an die Datenbank stellt, um einen neuen Datensatz hinzuzufügen.
de: Here, a connection is first established again and a cursor is created, which this time sends an INSERT request to the database to add a new record.

source: Damit die lokalen Daten und die Daten in der Datenbank synchron bleiben, wird der Datensatz auch in der Tabelle gelöscht.
de: To keep the local data and the data in the database synchronized, the record is also deleted in the table.

source: Als CRUD bezeichnet man:
de: CRUD steht für:

source: Dies sind die Operationen über die du dir Gedanken machen musst, wenn du eine Verbindung zur Datenbank herstellen möchtest.
de: These are the operations you need to consider when you want to connect to the database.

source: Create
de: Erstellen

source: Die Create-Funktion wurde mit der Funktion `create` implementiert.
de: The create function was implemented with the `create` function.

source: Read
de: Lesen

source: Mit der Funktion `from_db` wurde die komplette Tabelle `Highscore` in unserer Datenbank in die Liste `self.scores` geladen.
de: With the `from_db` function, the entire `Highscore` table in our database was loaded into the `self.scores` list.

source: Update
de: Aktualisieren

source: Einen Datensatz kannst du aktualisieren (Wenn ein Spieler das Spiel z.B. wiederholt.)
de: You can update a record (e.g., if a player repeats the game.)

source: Ergänze dazu folgende Methode:
de: Addiere dazu folgende Methode:

source: Delete
de: Löschen

source: Ergänze folgende Methode:
de: Addiere die folgende Methode:

source: Kompletter Code:
de: Vollständiger Code:

source: Dein Modell in deine Anwendung einbinden.
de: Integrate your model into your application.

source: Wenn du dein Modell geschrieben hast, kannst du dies in deinem Basisprogramm einbinden.
de: When you have written your model, you can integrate it into your base program.

source: Hier wurde z.B. ein Programm geschrieben, bei welchem man Kugeln ausweichen muss. Sobald du getroffen wirst. Das Spiel sieht zunächst so aus:
de: Here, for example, a program was written where you have to dodge balls. As soon as you get hit. The game initially looks like this:

source: Highscore
de: Höchstpunktzahl

source: Dieses Spiel braucht nun zwei Funktionalitäten:
de: This game now needs two functionalities:

source: Nach Spielende wird das Spiel gelöscht.
de: After the game ends, the game will be deleted.

source: Es wird die Highscore angezeigt.
de: The high score is displayed.

source: Ändere dafür zunächst die act-Methode:
de: Change the act method first:

source: Die letzte if-Anweisung beinhaltet die Funktionalität. Das World wird gelöscht, es wird nach einer neuen Highscore gefragt die dann mit der Funktion `new_highscore` angezeigt wird.
de: The last if statement includes the functionality. The world is deleted, a new high score is requested, which is then displayed with the `new_highscore` function.

source: Diese sieht so aus:
de: This looks like this:

source: Zuerst wird die aktuelle Highscore geladen, dann wird ein neuer Eintrag erstellt und dann die ersten 10 Elemente der Highscore mit Hilfe neuer Actors auf dem Bildschirm ausgegeben.
de: First, the current high score is loaded, then a new entry is created, and then the first 10 elements of the high score are displayed on the screen using new actors.
