Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/flappy_physics.po
Languages: de

source: Tutorial: Flappy Bird
de: Anleitung: Flappy Bird

source: In diesem Kapitel erstellen wir Schritt für Schritt ein Flappy Bird-Spiel unter Verwendung der `miniworlds_physics` Engine.
de: In this chapter we will create step by step a Flappy Bird game using the `miniworlds_physics` Engine.

source: ![Flappy Bird Spiel](../_images/patterns_flappy.png)
de: ![Flappy Bird game](../_images/patterns_flappy.png)

source: Flappy Bird Spiel
de: Flappy Bird game

source: Schritt 1: Importieren der Physik-Engine
de: Step 1: Importing the physics engine Schritt 1: Importieren der Physik-Engine

source: Installiere das Paket `miniworlds_physics` genauso, wie du `miniworlds` installiert hast. Danach importierst du die `PhysicsWorld`:
de: Install the package `miniworlds_physics` just like you installed `miniworlds`. After that, import the `PhysicsWorld`:

source: Schritt 2: Röhren (Pipes) erstellen
de: Step 2: Tubes erstellen

source: Röhren hinzufügen und in einer Liste speichern
de: Add tubes and store them in a list

source: Füge mehrere Röhren (Pipes) hinzu und speichere sie in einer Liste, um später ihre Eigenschaften leichter ändern zu können:
de: Add multiple tubes (pipes) and save them in a list to be able to change their properties more easily later:

source: Erklärung:
de: Explanation:

source: Es werden vier Röhren erstellt, die in der Liste `pipes[]` gespeichert werden.
de: Four tubes are created and stored in the list `pipes[]`.

source: Eigenschaften der Röhren festlegen
de: Properties of the tubes specify

source: Verwende eine Schleife, um Eigenschaften für alle Röhren festzulegen:
de: Use a loop to set properties for all tubes:

source: Für die 2. und 4. Röhre (die von oben nach unten zeigen) wird die Orientierung um 180 Grad gedreht:
de: For the 2nd and 4th tube (those showing from top to bottom) the orientation is rotated by 180 degrees.

source: **pipe.physics.simulation**: Mit `manual` wird festgelegt, dass die Schwerkraft keine Wirkung auf die Röhre hat.
de: **pipe.physics.simulation**: With `manual` it is determined that gravity has no effect on the pipe.

source: **pipe.physics.velocity_x**: Die Bewegung erfolgt durch Ändern der Geschwindigkeit.
de: **pipe.physics.velocity_x**: The movement occurs by changing the velocity. **pipe.physics.velocity_x**: Die Bewegung erfolgt durch Ändern der Geschwindigkeit.

source: **pipe.origin**: Der Referenzpunkt ist die obere linke Ecke der Röhre, was das Verschieben vereinfacht.
de: **pipe.origin**: The reference point is the top left corner of the pipe, making it easier to move.

source: Methoden für die Röhren registrieren
de: Methods for registering tubes

source: Nun fügen wir den Röhren zwei wichtige Methoden hinzu:
de: Now we add the tubes two important methods.

source: **act**: Diese Methode prüft, ob die Röhre vom Spieler überquert wurde.
de: **act**: This method checks if the tube was passed by the player. **act**: Diese Methode prüft, ob die Röhre vom Spieler überquert wurde.

source: **on_detecting_left_border**: Wenn die Röhre den linken Bildschirmrand erreicht, wird sie an eine zufällige Position rechts verschoben.
de: **on_detecting_left_border**: When the tube reaches the left screen edge, it will be moved to a random position on the right.

source: Schritt 3: Den Vogel (Bird) erstellen
de: Step 3: Create the bird

source: Attribute festlegen
de: Setze das Attribut fest

source: Der Vogel wird als `Actor` erstellt und seine Attribute festgelegt:
de: The bird is created as an 'Actor' and its attributes are set:

source: **bird.physics.simulation**: Der Vogel wird durch die Schwerkraft beeinflusst.
de: **bird.physics.simulation**: The bird is influenced by gravity. **Vogel wird durch die Schwerkraft beeinflusst**

source: **bird.physics.size**: Ein kleinerer Kollisionsbereich macht das Spiel etwas einfacher.
de: **bird.physics.size**: ᖴᖇoᑎtäՇՇ мᗩḳεຖ ՇՅε ѕթïεl εïռfäᖇεг.

source: Methoden für den Vogel registrieren
de: Methods to register the bird

source: Erkennen des Spielfeldrands
de: Recognize the edge of the playing field

source: Wenn der Vogel den Bildschirm verlässt, endet das Spiel mit einer "Game Over"-Nachricht:
de: When the bird leaves the screen, the game ends with a "Game Over" message.

source: Erkennen von Kollisionen mit Röhren
de: Recognizing collisions with tubes

source: Berührt der Vogel eine Röhre, endet ebenfalls das Spiel:
de: Touches the bird a tube, also ends the game:

source: Erkennen von Benutzereingaben
de: Recognizing user inputs

source: Wenn die Leertaste gedrückt wird, bewegt sich der Vogel nach oben:
de: When the space bar is pressed, the bird moves up:

source: Schritt 4: Punktestand hinzufügen
de: Step 4: add points

source: Die Punktanzeige wird statisch festgelegt, damit sie nicht von der Physik beeinflusst wird:
de: The point display is set statically so that it is not influenced by physics.

source: In der `act`-Methode der Röhren wird der Punktestand jedes Mal erhöht, wenn der Spieler eine Röhre überquert:
de: In the `act` method of the tubes, the score is increased every time the player crosses a tube:

source: Kompletter Code
de: Complete code
