Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/maze_game.po
Languages: de

source: Tutorial: Labyrinth-Spiel
de: Anleitung: Labyrinth-Spiel

source: In diesem Kapitel erstellen wir Schritt für Schritt gemeinsam ein Labyrinth-Spiel.
de: In this chapter we will create step by step together a maze game.

source: ![Labyrinth-Spiel - Erster Schritt](../_images/maze_tiles.png)
de: ![Labyrinth game - First step](../_images/maze_tiles.png)

source: Labyrinth-Spiel - Erster Schritt
de: Labyrinth game - First step

source: Die Technik, eine Kachelkarte (Tilemap) zu erstellen, ist in vielen Spielen gängig. Nachdem du es hier gelernt hast, wirst du in der Lage sein, diese Technik in deine eigenen Projekte zu integrieren.
de: The technique to create a tile map is common in many games. After you have learned it here, you will be able to integrate this technique into your own projects.

source: **Basierend auf**: `https://github.com/electronstudio/pygame-zero-book`
de: **Based on**: `https://github.com/electronstudio/pygame-zero-book`

source: **Lizenz:** Attribution-NonCommercial-ShareAlike 4.0 International
de: **Lizenz:** Zuschreibung-Nichtkommerziell-Weitergabe unter gleichen Bedingungen 4.0 International

source: Schritt 1: Schauspieler aus einer Kachelkarte laden
de: Step 1: Load actor from a tile card

source: Eine Kachelkarte verwendet eine kleine Anzahl von Bildern (Kacheln), die mehrmals gezeichnet werden, um ein großes Spiellevel (die Karte) zu erstellen. Dies spart Arbeit beim Erstellen vieler Grafiken und erleichtert Änderungen am Level-Design. In diesem Beispiel erstellen wir ein Labyrinth-Level.
de: A tile map uses a small number of images (tiles) that are drawn multiple times to create a large game level (the map). This saves work in creating many graphics and facilitates changes to the level design. In this example, we are creating a maze level.

source: Wir benötigen drei Bilddateien: `player.png`, `wall.png`. Diese müssen im Ordner `mu_code/images` gespeichert werden.
de: We need three image files: `player.png`, `wall.png`. These must be saved in the folder `mu_code/images`.

source: Jetzt können wir den Rahmen für unser Spiel programmieren:
de: Now we can program the framework for our game. Jetzt können wir den Rahmen für unser Spiel programmieren.

source: Eine Welt erstellen
de: Create a world

source: Verwende dieses Grundgerüst für dein Spiel:
de: Use this framework for your game:

source: In Zeile 2 wird eine `TiledWorld` erstellt, die die Logik für gekachelte Welten bereitstellt. In der letzten Zeile musst du unbedingt `world.run()` aufrufen, um das Spiel zu starten.
de: In line 2, a `TiledWorld` is created, which provides the logic for tiled worlds. In the last line, you must definitely call `world.run()` to start the game. In Zeile 2 wird eine `TiledWorld` erstellt, die die Logik für gekachelte Welten bereitstellt. In der letzten Zeile musst du unbedingt `world.run()` aufrufen, um das Spiel zu starten.

source: Schauspieler-Unterklassen erstellen
de: Actor subclasses erstellen

source: Erstelle Schauspieler-Unterklassen für jeden **Typ** von Schauspieler:
de: Create actor subclasses for each **type** of actor:

source: `self.add_costume` fügt dem Schauspieler ein Kostüm hinzu, das auf einem Bild basiert (z. B. "player", "wall" – Dateiendungen wie `.png` oder `.jpeg` können weggelassen werden) oder auf einer Farbe, die als (r, g, b, a)-Tupel angegeben wird.
de: `self.add_costume` adds a costume to the actor based on an image (e.g. "player", "wall" - file extensions like `.png` or `.jpeg` can be omitted) or on a color specified as an (r, g, b, a) tuple.

source: Eine Kachelkarte erstellen
de: Create a tile card

source: Eine Kachelkarte ist eine 2D-Liste, die die Positionen der Schauspieler bestimmt.
de: A tile map is a 2D list that determines the positions of the actors.

source: 0: Leer
de: 0: Empty

source: 1: Wand
de: 1: Zauberstab

source: Objekte für jede Zelle der Kachelkarte erstellen
de: Create objects for each cell of the tile map.

source: Für jede Zelle der Kachelkarte kann ein Schauspieler erzeugt werden. Die Klasse für jeden Schauspieler wird aus der Kachelkarte abgerufen.
de: For each cell of the tile map, an actor can be created. The class for each actor is retrieved from the tile map.

source: Schritt 2: Bewegung
de: Step 2: Movement

source: Spieler bewegen
de: Players move

source: Füge folgenden Code zur `Player`-Klasse hinzu, um den Spieler zu bewegen:
de: Add the following code to the `Player` class to move the player:

source: Bewegung blockieren
de: Block movement

source: Verwende die Methode `move_back()`, um die Bewegung des Spielers zu blockieren, wenn er auf eine Wand trifft:
de: Use the method 'move_back()' to block the movement of the player when they hit a wall.

source: Einen Gegner erstellen
de: Create an opponent

source: Erstelle eine Gegner-Klasse, die den Spieler jagt:
de: Create an opponent class that hunts the player:

source: Zusammenfassung
de: Summary

source: In diesem Tutorial hast du ein einfaches Labyrinth-Spiel mit beweglichen Schauspielern und Kachelkarten erstellt. Mit dieser Grundlage kannst du weitere Funktionen wie Punkte, Levelaufstiege oder komplexere Gegner hinzufügen!
de: In this tutorial you have created a simple maze game with movable actors and tile cards. With this foundation you can add more features like points, level increases or more complex enemies!
