Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/patterns/red_baron.po
Languages: de

source: Tutorial: Roter Baron
de: Anleitung: Roter Baron

source: In diesem Kapitel erstellen wir Schritt für Schritt einen Side-Scrolling-Shooter.
de: In this chapter we create step by step a side-scrolling-shooter.

source: Die Techniken zur Erstellung von Parallax-Hintergründen, der Verwaltung von Geschwindigkeit und Bewegung sowie das Generieren von Gegnern sind in Spielen weit verbreitet. Nachdem du sie hier gesehen hast, solltest du in der Lage sein, sie in deinen eigenen Projekten zu verwenden.
de: The techniques for creating parallax backgrounds, managing speed and motion, and generating enemies are widely used in games. After you have seen them here, you should be able to use them in your own projects.

source: **Basierend auf**: `https://github.com/kantel/pygamezero/tree/master/tappyplane`
de: **Basiert auf**: `https://github.com/kantel/pygamezero/tree/master/tappyplane`

source: **Lizenz**: Attribution-NonCommercial-ShareAlike 4.0 International
de: **License**: Attribution-NonCommercial-ShareAlike 4.0 International

source: Voraussetzug: Kenntis im Umgang mit Klasse.
de: Prerequisite: Knowledge in dealing with class.

source: Schritt 1: Grundgerüst erstellen
de: Step 1: Create basic framework

source: Erstelle ein Grundgerüst: Du benötigst eine Welt, in der Akteure platziert werden können.
de: Create a basic structure: You need a world in which actors can be placed.

source: Deine letzte Zeile muss `world.run()` sein.
de: Your last line must be `world.run()`.

source: Ordner vorbereiten
de: Prepare folder

source: Du musst Bilder für Hintergründe, Spieler und Gegner im Verzeichnis `images` innerhalb deines Code-Verzeichnisses ablegen.
de: You must place pictures for backgrounds, players, and opponents in the directory `images` within your code directory.

source: Hintergründe erstellen
de: Create backgrounds

source: Mit dem folgenden Code kannst du zwei Hintergründe generieren, die einen **endlos scrollenden** Effekt erzeugen.
de: With the following code you can generate two backgrounds that create an **endless scrolling** effect.

source: Erstelle zwei Hintergründe, die nebeneinander den gesamten Bildschirm füllen:
de: Create two backgrounds that fill the entire screen side by side:

source: Nun animieren wir die Hintergründe:
de: Now we animate the backgrounds:

source: Beide Hintergründe bewegen sich konstant von rechts nach links.
de: Both backgrounds move constantly from right to left.

source: Wenn ein Hintergrund den linken Bildschirmrand verlässt, wird er nach rechts verschoben.
de: When a background leaves the left edge of the screen, it is moved to the right.

source: Dies erzeugt einen **endlos scrollenden** Hintergrund.
de: This generates a **endless scrolling** background.

source: Schritt 2: Flugzeug-Klasse erstellen
de: Step 2: Create airplane class

source: Flugzeug-Klasse erstellen
de: Create airplane class

source: Instanz der Flugzeug-Klasse erstellen
de: Instance der Airplane-Klasse erstellen

source: Erstelle am Ende deines Codes, vor `world.run()`, eine Instanz dieser Klasse:
de: Create at the end of your code, before `world.run()`, an instance of this class:

source: Physik hinzufügen
de: Add physics

source: Nun fügen wir der Flugzeug-Klasse Physik hinzu. Modifiziere die `on_setup()`-Methode der Klasse:
de: Now we add physics to the airplane class. Modify the `on_setup()` method of the class:

source: `velocity_y` beschreibt die aktuelle Geschwindigkeit des Flugzeugs in y-Richtung.
de: `velocity_y` describes the current speed of the aircraft in the y-direction.

source: `gravity` repräsentiert die Schwerkraft, die die Geschwindigkeit des Flugzeugs beeinflusst.
de: `gravity` represents the gravity that influences the speed of the airplane.

source: Physik simulieren
de: Physics simulieren

source: Die Physik wird in der `act()`-Methode der Klasse simuliert:
de: Physics is simulated in the `act()` method of the class.

source: Dies fügt die Geschwindigkeit zu den y-Koordinaten des Flugzeugs hinzu. Die Schwerkraft verringert die Geschwindigkeit kontinuierlich, während die Reibung die Bewegung glättet.
de: This adds the speed to the y-coordinates of the aircraft. Gravity continuously reduces the speed, while friction smoothes the movement.

source: Kraft bei Tastendruck hinzufügen
de: Add force with key press

source: Verwende das `on_key_down`-Event, um eine Aufwärtskraft auf den Actor anzuwenden:
de: Use the `on_key_down` event to apply an upward force to the actor.

source: Schritt 3: Gegner hinzufügen
de: Step 3: Opponent add

source: Importiere `randint` und `choice`, um zufällig Gegner zu generieren:
de: Importiere `randint` und `choice`, um zufällig Gegner zu generieren: -> Importiere `randint` und `choice`, um zufällig Gegner zu generieren:

source: Gegner-Klasse erstellen
de: Create opponent class

source: Füge eine Gegner-Klasse als Vorlage hinzu:
de: Add an opponent class as a template:

source: Die Methode `reset()` setzt die Position des Gegners zufällig innerhalb eines bestimmten Bereichs.
de: The method `reset()` sets the position of the opponent randomly within a certain range.

source: Gegner zur Welt hinzufügen
de: Opponent to add to the world

source: Erstelle mehrere Instanzen der Gegner-Klasse mit einer Schleife und füge sie der Welt hinzu:
de: Erstelle mehrere Instanzen der Gegner-Klasse mit einer Schleife und füge sie der Welt hinzu: 0100200005002100070008012007060400012100000402000400

source: Gegner bewegen
de: Opponent move

source: Modifiziere die `on_setup()`-Methode der Gegner-Klasse:
de: M0diffz0r3 d13 `0n_setμp()`-M3th0d3 d3r G3gn3r-Kl@ss3:

source: Die `speed`-Eigenschaft gibt an, wie viele Schritte sich der Gegner in jeder Frame in x-Richtung bewegt.
de: The `speed` property indicates how many steps the opponent moves in x-direction in each frame.

source: Füge eine `act()`-Methode hinzu, um die Bewegung zu simulieren:
de: Add an `act()` method to simulate the movement: Füge eine `act()`-Methode hinzu, um die Bewegung zu simulieren:

source: Schritt 4: Schießen hinzufügen
de: Step 4: Shooting add

source: Erstelle eine `Bullet`-Klasse, um die Schussfunktion hinzuzufügen:
de: エルステーレエインネ 'Bullet'-クラッセ, ウム ディエ シュースフンクティオン ヒンズウズフュュゲン:

source: Komplettcode:
de: Complete code:
