Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_functions.po
Languages: de

source: Konzept: Funktionen und Code-Blöcke
de: Concept: Functions and Code Blocks

source: Funktionen und Decorators
de: Functions und Dekorateure

source: Im letzten Kapitel wurde folgender Code verwendet:
de: In the last chapter the following code was used:

source: In der zweiten Zeile wird eine Funktion definiert, die bestimmte Anweisungen durchführt (dazu später mehr).
de: In the second line, a function is defined that performs certain instructions (more on that later).

source: In der ersten Zeile wird diese Funktion mit einem Decorator versehen. Dieser Decorator "heftet" die Funktion an das World an. Immer wenn das System die Funktion `world.on_setup` aufrufen will, wird die von dir definierte Funktion aufgerufen. Auf diese Weise kannst du später Funktionen definieren, die auf beliebige Ereignisse reagieren, z.B. Tastendrücke, ...
de: In the first line, this function is adorned with a decorator. This decorator "attaches" the function to the World. Whenever the system wants to call the function `world.on_setup`, the function defined by you will be called. This way you can later define functions that react to any events, e.g. key presses, ...

source: Einrückung und Code-Blöcke
de: Indentation and code blocks

source: Code-Blöcke dienen in Python immer dazu, zu definieren wann eine bestimmte Verzweigung in deinem Programm beginnt und wann sie endet. Alles was gleich weit eingerückt wird gehört zu einem gemeinsamen Code-Block.
de: Code blocks are always used in Python to define when a specific branch in your program begins and when it ends. Everything indented at the same level belongs to a common code block.

source: Coding-Standards Wie weit sollte eingerückt werden?
de: Coding-Standards How far should be indented?

source: Die Programmiersprache Python selbst definiert nicht, wie weit ein Code-Block eingerückt werden soll, ob du drei, vier oder fünf Zeichen verwendest ist egal - Entscheidend ist, dass alle Zeilen *gleich weit* eingerückt sind.
de: The programming language Python itself does not define how far a code block should be indented, whether you use three, four, or five characters is irrelevant - What matters is that all lines are *indented equally*.

source: Es gibt in Python aber bestimmte Coding-Standards, auf die sich Programmierer geeinigt haben, damit Code immer ähnlich aussieht.
de: There are in Python however certain coding standards, on which programmers have agreed, so that code always looks similar.

source: So hat man sich darauf geeinigt, dass man Code immer 4 Zeichen einrückt. Du kannst dies für dich natürlich anders handhaben - Spätestens wenn ihr im Team arbeitet, ist es aber hilfreich sich an solche Konventionen zu halten.
de: So it has been agreed that one always indents code by 4 characters. Of course, you can handle this differently for yourself - but it is helpful to adhere to such conventions, especially when working in a team.

source: In Python sind Funktionen und Konventionen in sogenannten PEPs ("Python Enhancement Proposal) definiert. Style Guides findest du z.B. in [PEP 8](https://www.python.org/dev/peps/pep-0008/).
de: In Python functions and conventions are defined in so-called PEPs ("Python Enhancement Proposal). Style Guides can be found e.g. in [PEP 8](https://www.python.org/dev/peps/pep-0008/).

source: Neben der Einrückung findest du dort noch viel mehr, z.B. schreibt man `a = a + 3` anstatt `a=a+3`, weil ersteres leichter zu lesen ist. die Programmiersprache zwingt dich nicht dazu, aber so ist der Code für andere Programmierer besser zu lesen.
de: Next to the indentation you will find much more there, e.g. one writes `a = a + 3` instead of `a=a+3`, because the former is easier to read. The programming language does not force you to do so, but this way the code is easier for other programmers to read.

source: Viele moderne Editoren können dich durch Autoformatierung und Linting darin unterstützen, **sauberen** Code zu schreiben.
de: Many modern editors can support you in writing clean code through autoformatting and linting.
