Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_framerate.po
Languages: de

source: Concept: Framerate
de: Konzept: Bildfrequenz

source: You can configure how often the `act()` method is called by adjusting the attributes `world.fps` and `world.speed`.
de: Du kannst einstellen, wie oft die Methode `act()` aufgerufen wird, indem du die Attribute `world.fps` und `world.speed` anpasst.

source: `world.fps` defines the **frame rate**. Like a flipbook where pages are turned at a fixed speed, the frame rate defines **how many times per second the screen is redrawn**. The default value is `60`, which means **60 frames per second**.
de: `world.fps` definiert die **Bildfrequenz**. Wie bei einem Daumenkino, bei dem die Seiten in fester Geschwindigkeit umgeblättert werden, legt die Framerate fest, **wie oft pro Sekunde der Bildschirm neu gezeichnet wird**. Der Standardwert ist `60`, was **60 Bilder pro Sekunde** bedeutet.

source: `world.frame` stores the **current frame count**. It increases continuously from the start of the program.
de: `world.frame` speichert die **aktuelle Frame-Zahl**. Sie wird vom Start des Programms an kontinuierlich hochgezählt.

source: `world.speed` defines how often the **game logic** (e.g., `act`) is called per second. A value of `3` means the `act()` function is called **every third frame**.
de: `world.speed` legt fest, wie oft die **Spiellogik** (z. B. `act`) pro Sekunde aufgerufen wird. Ein Wert von `3` bedeutet, dass die Funktion `act()` **alle drei Frames** aufgerufen wird.

source: Example
de: Beispiel

source: Output:
de: Ausgabe:

source: Explanation:
de: Erklärung:

source: The program runs **1 frame per second**.
de: Das Programm läuft mit **1 Bild pro Sekunde**.

source: The `act()` method is called **every 3rd frame**, so it is called **every 3 seconds**.
de: Die Methode `act()` wird **alle 3 Frames** aufgerufen, also **alle 3 Sekunden**.

source: This results in a slow and steady frame count being printed.
de: Dadurch wird die Frame-Zahl langsam und gleichmäßig ausgegeben.
