Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_loops.po
Languages: de

source: Konzept: Schleifen
de: Concept: Loops

source: Die for-Schleife
de: The for-loop

source: Die for-schleife wiederholt -vereinfacht gesprochen- einen Befehl n-mal:
de: The for loop repeats -simplified- a command n times.

source: Beispiel
de: Example

source: Die folgende Schleife wird 5-mal durchlaufen:
de: The following loop will be run 5 times:

source: Das Programm gibt folgende Ausgabe
de: The program gives the following output

source: Die Zählervariable
de: The count variable

source: Man kann die Variable i als Zählervariable verwenden. Sie zählt (von 0 beginnend) hoch:
de: One can use the variable i as a counting variable. It counts (starting from 0) up:

source: Allgemeine Form:
de: General form:

source: Allgemein schreibt man:
de: In general one writes:

source: oder
de: or

source: Man kann jeweils angeben wie oft die Schleife durchlaufen wird oder bestimmte Bereiche angeben:
de: One can specify how often the loop will be run or specify certain areas:

source: Beispiele: Mit Schleifen zeichnen
de: Examples: Drawing with loops

source: Mit Schleifen kann man zeichnen:
de: With loops one can draw:

source: circles
de: Kreise

source: Schachbrettmuster
de: Checkerboard pattern

source: Mit dem module-Operator kann man überprüfen, ob ein Ergebnis, durch 2 teilbar ist, nämlich ``x teilbar durch 2 genau dann wenn x % 2 == 0`
de: Mit dem modulo-Operator kann man überprüfen, ob ein Ergebnis, durch 2 teilbar ist, nämlich ``x teilbar durch 2 genau dann wenn x % 2 == 0`

source: Dies kann man nutzen um schachbrettartige Muster zu zeichnen, indem man Schleifen mit einer if-Abfrage kombiniert:
de: This can be used to draw checkerboard-like patterns by combining loops with an if statement:

source: checkers
de: Dame

source: Auch Graphen lassen sich auf diese Art zeichnen:
de: Also graphs can be drawn in this way:

source: graphs
de: Diagramme

source: Verschachtelte Schleifen
de: Nested loops

source: Mit Hilfe von verschachtelten Schleifen kannst du mehrdimensionale Muster zeichnen.
de: With the help of nested loops you can draw multidimensional patterns.

source: nested loop
de: verschachtelte Schleife

source: Die while-Schleife
de: The while loop

source: Die while-Schleife hat allgemein folgenden Aufbau:
de: The while loop has the following structure in general:

source: Solange die Bedingung wahr ist, wird die Schleife immer wieder wiederholt. Dadurch ist es auch möglich Endlosschleifen zu erstellen.
de: As long as the condition is true, the loop will be repeated again and again. This also makes it possible to create endless loops.

source: Beispiel:
de: Example:

source: Das folgende Programm generiert ein zufälliges Muster:
de: The following program generates a random pattern:

source: random color circles
de: zufällige Farbkreise

source: Die mainloop
de: The mainloop

source: Dein ganzes Programm läuft streng genommen innerhalb einer while Schleife:
de: Your whole program runs strictly speaking within a while loop:

source: Die for-Schleife ist hierfür nicht geeignet, da man für diese im Vorhinein wissen muss, wie viele Schleifendurchläufe durchlaufen werden sollen.
de: The for loop is not suitable for this, since one must know in advance how many loop iterations are to be run.

source: Schleifen innerhalb von registrierten Methoden
de: Loops within registered methods

source: Wenn du innerhalb der `act`-Methode oder einer Ereignis-Methode eine Schleife ausführen willst, dann musst du folgendes wissen:
de: If you want to execute a loop within the `act` method or an event method, then you need to know the following:

source: Die komplette Schleife innerhalb einer solchen Methode wird innerhalb eines einzigen Frames ausgeführt. Eine Schleife ist hier also nicht geeignet, um z.B. eine Figur zu bewegen, da diese ja jeden Frame neu gezeichnet wird - Eine Schleife läuft aber komplett innerhalb eines Frames ab.
de: The complete loop within such a method is executed within a single frame. A loop is therefore not suitable here to, for example, move a figure, as it is redrawn every frame - A loop, however, runs completely within a frame.

source: Am Beispiel einer Ampel-Anlage kann man dies gut veranschaulichen. Man kann den Ablauf der Schleife gut mit einem Zustandsdiagramm visualisieren.
de: Anhand einer Ampel-Installation kann man das gut zeigen. Man kann den Ablauf der Schleife gut mit einem Zustandsdiagramm visualisieren.

source: In Code kann man dies wie folgt umsetzen:
de: Im Code kann man dies wie folgt umsetzen:

source: In der mainloop wird die While-Schleife durch die mainloop "ersetzt":
de: In the mainloop, the While loop is "replaced" by the mainloop:

source: Wie man sieht ist der Programmcode nur an einzelnen Stellen verändert wurden, der Programmablauf bleibt der gleiche. Die `while`-Schleife wird hier durch die `act`-Methode ersetzt.
de: As one sees, the program code has only been changed in individual places, the program flow remains the same. The `while` loop is replaced by the `act` method here.
