Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_defining_functions.po
Languages: de

source: Konzept: Funktionen, Parameter und Rückgabewert
de: Concept: Functions, parameters, and return value

source: Du hast bisher Methoden verwendet, die zu einem World oder einem Actor gehören, z.B. ``on_setup``, ``act``.
de: You have so far used methods that belong to a World or an Actor, e.g. "on_setup", "act".

source: Jetzt lernst du eigene Funktionen zu erstellen. Funktionen sind `Unterprogramme` die dir ermöglichen, Code wiederzuverwenden, anstatt ihn immer wieder zu schreiben.
de: Now you learn to create own functions. Functions are `subprograms` that allow you to reuse code instead of writing it again and again.

source: Erstes Beispiel
de: First example

source: du möchtest vier rote Kreise erstellen, so wie im folgenden Bild dargestellt:
de: you want to create four red circles, as shown in the following image:

source: Dies geht z.B. so:
de: This goes for example like this:

source: ![4 red circles](../_images/processing/4red_circles.png)
de: ![4 rote Kreise](../_images/processing/4red_circles.png)

source: 4 red circles
de: 4 rote Kreise

source: Das Programm ist korrekt. Wenn nun aber alle vier Kreise grün sein sollen, dann musst du das Programm an vier Stellen verändern.
de: The program is correct. If now however all four circles green should be, then must you the program at four places change.

source: Stattdessen kann man das Erstellen des Kreises und das festlegen der Farbe in Unterprogramme auslagern:
de: Instead, one can outsource the creation of the circle and the setting of the color to subprograms:

source: Hier wurde eine Funtion `create_circle` definiert.
de: Here was a function `create_circle` defined.

source: Die Funktion hat den **Namen** `create_circle`
de: The function has the **name** `create_circle`

source: Die Funktion erhält als **Übergabeparameter** die Werte `x` und `y` - An dieser Stelle soll der Kreis erstellt werden.
de: The function receives the values `x` and `y` as **parameters** - At this point the circle should be created.

source: Die Funktion wird mit Hilfe ihres **Namens** und mit Übergabe der **Argumente** (z.B. 20, 20) aufgerufen.
de: The function is called with the help of its **name** and by passing the **arguments** (e.g. 20, 20).

source: Allgemein: Definieren von Funktionen
de: General: Defining functions

source: Oft willst du komplizierte Dinge automatisieren, z.B. das Anlegen von Actors.
de: Häufig willst du komplizierte Dinge automatisieren, z.B. das Anlegen von Actorn.

source: Dies geht, indem du Funktionen selbst definierst - Dies geht im Allgemeinen so:
de: This goes by defining functions yourself - This generally works like this:

source: z.B.:
de: For example:

source: Deine Funktion besteht aus einer *Signatur* und einem *Funktionskörper*.
de: Your function consists of a *signature* and a *function body*.

source: Die Signatur ist die erste Zeile der Funktion. Sie enthält alle Informationen die du brauchst um die Funktion aufzurufen. Dies ist der **Name** und **Parameter**. Der Name dieser Funktion ist `create_actor`, die Parameter sind `x`und `y`. Parameter werden benötigt um der Funktion weitere Informationen zu übergeben. Im Beispiel wird die Information übergeben, *wo* das Objekt erstellt werden soll.
de: The Signature is the first line of the function. It contains all the information you need to call the function. This is the **Name** and **Parameters**. The name of this function is `create_actor`, the parameters are `x` and `y`. Parameters are needed to pass additional information to the function. In the example, the information is passed on *where* the object should be created.

source: Der Funktionskörper ist ein Code-Block. Er enthält alle Befehle, die bei Aufruf der Funktion nacheinander abgearbeitet werden. Hier wird beim Funktionsaufruf zuerst ein Kreis erzeugt und anschließend werden die Farbe des Kreises festgelegt.
de: The functional body is a code block. It contains all commands that are executed one after the other when the function is called. Here, a circle is first created when the function is called, and then the color of the circle is set.

source: Die Befehle werden beim Aufruf der Funktion von oben nach unten abgearbeitet.
de: The commands are executed from top to bottom when the function is called.

source: Aufruf von Funktionen
de: Call of functions

source: Eine Funktion wird mit Hilfe des Namens aufgerufen. Dabei übergibst du der Funktion die als Parameter definierten Argumente.
de: A function is called using the name. Thereby you pass the arguments defined as parameters to the function.

source: Allgemein schreibt man: `method_name(<parameter>)`
de: Im Allgemeinen schreibt man: `method_name(<parameter>)`

source: Dies kann z.B. so aussehen:
de: This can e.g. look like this:

source: Hier wird ein Actor an der Position `x=4` und `y=2` angelegt.
de: Here an Actor is created at position `x=4` and `y=2`.

source: Komplexe Figuren zeichen
de: Complex figures draw

source: Mit Hilfe von Funktionen kannst du komplexe Figuren zeichnen:
de: With the help of functions, you can draw complex figures.

source: In der Funktion `create_face` wird ein Gesicht erzeugt. Dieses kann anschließend an unterschiedlichen Stellen erzeugt werden.
de: In the function `create_face` a face is generated. This can then be created at different locations.

source: ![faces](../_images/processing/face3.png)
de: ![Gesichter](../_images/processing/face3.png)

source: faces
de: Gesichter

source: Actors automatisiert erstellen
de: Actor automatisch erstellen

source: Mit Hilfe von Funktionen kannst du das erstellen von Actors abkürzen:
de: With help of functions you can the creation of Actors shorten:

source: Es werden hier 10 Actors mit 10 Befehlen angelegt. Ohne Funktionen hättest du 30 Befehle benötigt.
de: Here 10 Actors are created with 10 commands. Without functions you would have needed 30 commands.

source: Ausgabe:
de: Issue:

source: ![walls](../_images/walls.png)
de: ![Wände](../_images/walls.png)

source: walls
de: Wände

source: Eigenschaften und Methoden registrieren.
de: Properties and methods register.

source: Das folgende Programm erstellt automatisch "Regentropfen".
de: The following program automatically creates "raindrops".

source: In der funktion raindrop werden nicht nur Eigenschaften für jeden Tropfen festgelegt, sondern auch Methoden registriert.
de: In the function raindrop, properties are not only defined for each drop, but also methods are registered.

source: Rückgabewerte
de: Return values

source: Die bisherigen Funktionen haben ein Unterprogramm ausgeführt und dabei ggf. Informationen über Parameter erhalten.
de: The previous functions have executed a subroutine and possibly received information about parameters.

source: Mit Hilfe von Rückgabewerten kannst du auch Informationen zurückgeben.
de: Using return values, you can also return information.

source: Im einfachen Fall sieht dies so aus:
de: Im 2897 Fall sieht dies so aus:

source: In der letzten Zeile passiert folgendes: Bevor die Funktion `print` ausgeführt werden kann, muss die Funktion `is_even` ausgewertet werden. Das Ergebnis der Funktion (Hier: `True`) wird dann anstelle des Funktionsaufrufs eingesetzt.
de: In the last line the following happens: Before the function `print` can be executed, the function `is_even` must be evaluated. The result of the function (Here: `True`) is then used instead of the function call.

source: Das folgende Programm erstelllt zufällig Kreise. Wenn diese links von der Mitte sind, werden sie rot eingefärbt, ansonsten weiß.
de: The following program randomly creates circles. If they are to the left of the center, they will be colored red, otherwise white.

source: ![is left](../_images/processing/is_left.png)
de: ![ist links](../_images/processing/is_left.png)

source: is left
de: ist links
