Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_conditions.po
Languages: de

source: Konzept: Verzweigungen
de: Concept: Branches

source: Verzweigungen brauchst du immer dann, wenn du Bedingungen überprüfen willst und davon der Programmfluss abhängen soll.
de: Branches you always need when you want to check conditions and the program flow should depend on them.

source: Erstes Beispiel
de: First example

source: Willst du z.B. in deinem Spiel überpfüen, ob ein bestimmter Punktestand erreicht wurde, so geht dies mit einer Anweisung
de: Möchtest du zum Beispiel in deinem Spiel überprüfen, ob ein bestimmter Punktestand erreicht wurde, so kannst du dies mit einem Befehl tun.

source: Allgemeine Syntax
de: General Syntax

source: Boolsche Ausdrücke
de: Boolean expressions

source: Eine Bedingung ist ein Ausdruck, der den Wert `True` oder `False` besitzen kann - Man nennt solche Ausdrücke *boolsche Ausdrücke*.
de: A condition is an expression that can have the value `True` or `False` - such expressions are called *boolean expressions*.

source: Die einfachsten boolschen Ausdrücke sind `True` und `False`. Weitere Ausdrücke erhälst du i.d.R. mit **Vergleichen**, z.B.:
de: The simplest boolean expressions are `True` and `False`. You typically get more expressions with **comparisons**, e.g.:

source: Die Ausdrücke können beliebig kompliziert sein und Variablen enthalten.
de: The expressions can be arbitrarily complicated and contain variables.

source: Achtung: Bei Vergleichen verwendet man immer ein doppeltes Gleichheitszeichen anstelle eines einfachen Gleichheitszeichen
de: Attention: When comparing, always use a double equal sign instead of a single equal sign

source: Vergleiche
de: Compare

source: Folgende Vergleiche kannst du verwenden:
de: The following translations can be used:

source: `<=` : Kleiner als oder gleich
de: `<=` : Less than or equal to

source: `==`: Gleich
de: `==`: Same

source: `>=`: Größer als oder gleich
de: `>=`: Larger than or equal

source: Code Blöcke
de: Code Blocks

source: Willst du mehrere Anweisungen abhängig von der Bedingung durchführen, so geht dies mit Hilfe von Code-Blöcken. Code-Blöcke sind stets gleichweit eingerückt und alle Anweisungen die entsprechend eingerückt sind, werden
de: Do you want to perform several instructions depending on the condition, this can be done with the help of code blocks. Code blocks are always indented equally, and all instructions that are indented accordingly will be

source: Beispiel:
de: Example:

source: Unabhängig von der Punktzahl wird die letzte Code-Zeile auf jeden Fall ausgeführt. Die beiden eingerückten Zeilen werden allerdings nur ausgeführt, wenn der Punktestand größer als 100 ist.
de: Regardless of the score, the last line of code will be executed in any case. However, the two indented lines will only be executed if the score is greater than 100.

source: Elif und Else
de: Elif and Else

source: Mit elif und else kannst du Alternativen einbauen. Dies geht z.B. so:
de: With elif and else you can include alternatives. This works, for example, like this:

source: Die allgemeine Syntax ist:
de: The general syntax is:

source: Sowohl elif als auch else können dabei weggelassen werden. Es sind auch mehrere elif-Blöcke möglich.
de: Both elif and else can be omitted. Multiple elif blocks are possible as well.

source: Ausführliches Beispiel
de: Detailed example

source: Ein Rechteck soll sich von rechts nach links bewegen. Wenn es die linke Seite erreicht, soll es wieder ganz rechts auftauchen.
de: A rectangle should move from right to left. When it reaches the left side, it should appear again all the way to the right.

source: Die erste Variante sieht so aus:
de: The first variant looks like this:

source: Es fehlt noch der entscheidende Teil.
de: The crucial part is still missing.

source: Diesen kann man so formulieren:
de: This can be formulated as follows:

source: `Falls die x-Koordinate den Wert 0 erreicht, setze das Rechteck wieder nach rechts`
de: If the x-coordinate reaches the value 0, move the rectangle back to the right

source: Dies kann man direkt in Python übersetzen:
de: This can be translated directly in Python:

source: Ein weiteres Beispiel - Ein simples Flappy-Bird
de: Another example - A simple Flappy Bird

source: Wir wollen eine Art (einfaches) Flappy-Bird programmieren.
de: We want to program a kind of (simple) Flappy Bird.

source: Unser Hauptcharakter soll ein Ball sein, der bei Tastendruck sich nach oben bewegt. Dies können wir wie folgt realisieren:
de: Our main character should be a ball that moves upwards when a key is pressed. This can be achieved as follows:

source: Der Ball fällt und fällt immer schneller.
de: The ball falls and falls faster and faster.

source: In der Zeile:
de: In the line:

source: wird die Geschwindigkeit erhöht, mit der der Ball fällt. Im ersten Schritt soll sich der Ball nach oben bewegen können, wenn eine Taste gedrückt wird.
de: will the speed increased, with which the ball falls. In the first step the ball should be able to move upwards when a button is pressed.

source: Kolissionen
de: Collisions

source: Nun wollen wir nicht nur einfach Positionen vergleichen, sondern auch die Lage von Objekten zueinander.
de: Now we want to not only compare positions, but also the location of objects to each other.

source: Dafür können wir verschiedene `sensor`-Methoden verwenden.
de: For this we can use various `sensor` methods.

source: Dies geht z.B. so:
de: This goes e.g. so:

source: Die Logik befindet sich in folgenden Zeilen:
de: The logic is in the following lines:

source: Die erste Zeile überprüft mit einem Sensor, welches Actor an der eigenen Position gefunden wurde (und gibt das erste gefundene Actor zurück). Anschließend wird das so gefundene Actor mit dem Rechteck verglichen. Wenn dies die gleichen Objekte sind, dann wird das Spiel abgebrochen.
de: The first line checks with a sensor which Actor was found at its own position (and returns the first found Actor). Then, the found Actor is compared with the rectangle. If these are the same objects, then the game is aborted.
