Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_imports.po
Languages: de

source: Konzept: Importe
de: Concept: Imports

source: Mit import kannst du Bibliotheken importieren und die dort abgelegten Klassen und Funktionen verwenden. Es gibt unterschiedliche Arten, wie du Bibliotheken importieren kannst:
de: With import you can import libraries and use the classes and functions stored there. There are different ways you can import libraries:

source: Unterschiedliche Arten von Imports
de: Different kinds of imports

source: Man kann in Python auf unterschiedliche Arten Bibliotheken importieren. Die folgenden 3 Anweisungen sind alle erlaubt:
de: One can import libraries in Python in different ways. The following 3 statements are all allowed:

source: Mit der hier verwendeten Version `import miniworlds` musst du jedesmal `miniworlds.objekt` schreiben, wenn du ein Objekt aus der miniworlds-Bibliothek importierst. Stattdessen kannst du auch `from miniworlds import *` schreiben - Dann kannst du miniworlds weglassen.
de: With the version `import miniworlds` used here, you have to write `miniworlds.object` every time you import an object from the miniworlds library. Instead, you can also write `from miniworlds import *` - Then you can leave out miniworlds.

source: So sähe das erste Programm aus, wenn wir `import miniworlds` geschrieben hätten:
de: So would the first program look if we had written 'import miniworlds':

source: Explizite vs. Implizit.
de: Explizit vs. Implizit.

source: Die Variante jedesmal `miniworlds.objekt` anstatt einfach nur `objekt` zu schreiben mag zwar zuerst hässlicher erscheinen, weil man mehr Text schreiben muss.
de: The variant each time `miniworlds.object` instead of simply writing `object` may appear uglier at first because you have to write more text.

source: Dies ist trotzdem in Python die bevorzugte Variante, da so erkennbar ist, welche Objekte aus welcher Bibliothek importiert wurden.
de: This is still the preferred option in Python, as it is recognizable which objects were imported from which library.

source: Es könnte ja z.B. sein, dass du in deinem Programm eine Klasse `TiledWorld` definierst und damit zweimal der gleiche Name verwendet wird - Für Leser deines Programms wird es dann schwierig nachzuvollziehen, worauf sich der Name TiledWorld bezieht.
de: It could for example be that you define a class `TiledWorld` in your program and thus the same name is used twice - For readers of your program it then becomes difficult to understand what the name TiledWorld refers to.

source: Die dritte Variante ist ein Kompromiss zwischen erster und zweiter Variante. Wenn die der Name `miniworlds` zu lang ist, dann kannst du einen Alias definieren, z.B. `mwm`
de: The third variant is a compromise between the first and second variants. If the name 'miniworlds' is too long, then you can define an alias, e.g. 'mwm'

source: Das Programm würde dann folgendermaßen aussehen:
de: The program would then look like this:

source: Hinweise für Lehrer
de: Instructions for teachers

source: Es werden in diesen Tutorials beide Varianten verwendet. Als Lehrer sollte man sich aber entscheiden, welche Variante man für den Einstieg bevorzugt.
de: In these tutorials, both variants are used. As a teacher, however, one should decide which variant one prefers for the introduction. Es werden in diesen Tutorials beide Varianten verwendet. Als Lehrer sollte man sich aber entscheiden, welche Variante man für den Einstieg bevorzugt.

source: Für Anfänger kann es hilfreich sein, auf diese Art von Importen zu verzichten.
de: For beginners, it can be helpful to avoid this type of imports.
