Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/concepts/concept_naming.po
Languages: de

source: Konzept: Naming und Variablen
de: Concept: Naming and Variables

source: Naming
de: Benennung

source: Im ersten Kapitel hast du Anweisungen der folgenden Art gesehen:
de: In the first chapter you have seen instructions of the following kind:

source: Das `=` Zeichen hat hier eine andere Funktion als in der Mathematik.
de: The `=` sign has a different function here than in mathematics.

source: Zuerst wird die rechte Seite der Anweisung durchgeführt. In diesem Fall wird ein TiledWorld()-Objekt erzeugt.
de: 0064 0021 6f 20 46 74 6b 6f 20 71 61 64 6c 2034 0063 6b 2033 0065 0026 006c 20 41 6e 776 65 69 73 75 6e 67 280002解70650210500902922803550329。

source: Im zweiten Schritt, wird das erzeugte Objekt mit dem Namen `world` gespeichert. Du kannst später über diesen `Namen` immer wieder auf das erzeugte Objekt zugreifen.
de: In the second step, the generated object with the name `world` is saved. You can access the generated object later through this `name` again.

source: Namen haben also in einer Programmiersprache eine ganz besondere Bedeutung, sie dienen dir als ein Speicher für Objekte und Daten. Indem du Objekten einen Namen gibst, kannst du später wieder auf diese zugreifen. Man nennt solche Namen auch **Variablen**, denn das Objekt auf das über den Namen zugegriffen werden kann, kann meist auf verschiedene Arten verändert werden.
de: Names therefore have a very special meaning in a programming language, they serve as a storage for objects and data. By giving objects a name, you can access them again later. Such names are also called **variables**, because the object that can be accessed by the name can usually be changed in different ways.

source: Im einfachen Fall kann dies so aussehen:
de: Im einfachen Fall kann dies so aussehen: Im einfachen Fall kann dies so aussehen:

source: Indem du Werte unter dem Namen a und b gespeichert hast, kannst du später wieder darauf zugreifen. In der letzten Zeile wird zuerst `a + b` gerechnet und das Ergebnis in `c` gespeichert. Als Ergebnis wird `5` ausgegeben.
de: By storing values under the name a and b, you can access them later. In the last line, 'a + b' is calculated first and the result is stored in c. `5` is output as the result.

source: Variablen können jederzeit neue Werte speichern - Der alte Wert geht dabei verloren:
de: Variables can store new values at any time - The old value is lost in the process.

source: Das Programm gibt `4` aus, da der Wert 3 in der zweiten Zeile überschrieben wird und verloren ist.
de: The program outputs `4` because the value 3 is overwritten and lost in the second line.

source: Das World-Objekt
de: The World object

source: Das World ist ein Objekt und bringt verschiedene Attribute und Methoden mit, auf die du zugreifen kannst, z.B. `rows`, `columns` und `tile_size`.
de: The World is an object and brings various attributes and methods with it, which you can access, such as `rows`, `columns`, and `tile_size`.

source: Attribute
de: Merkmal

source: Auf Attribute greifst du mit der Syntax `objektname.attributsname` zu.
de: You access attributes with the syntax `objectname.attributename`.

source: Beispiel:
de: Example:

source: Dieser Code speichert den Wert 4 in `world.rows` - Das World-Objekt hat danach also 4 Zeilen.
de: This code stores the value 4 in `world.rows` - The World object therefore has 4 rows afterwards.

source: Methoden
de: Methods
