Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/actor.po
Languages: de

source: Actor
de: Schauspieler

source: Actors are objects on your world. Actors can move around the world and have sensors to detect other actors.
de: Schauspieler sind Objekte in Ihrer Welt. Schauspieler können sich in der Welt bewegen und haben Sensoren, um andere Schauspieler zu erkennen.

source: The appearance of a actor is determined by its costume.
de: Das Erscheinungsbild eines Schauspielers wird durch sein Kostüm bestimmt.

source: Examples
de: Beispiele

source: Create a actor:
de: Erstelle einen Schauspieler:

source: Create a actor with an image:
de: Erstellen Sie einen Schauspieler mit einem Bild:

source: Create actor as instance from an custom class
de: Erstelle einen Akteur als Instanz aus einer benutzerdefinierten Klasse

source: Create a Actor at current mouse position:
de: Erstellen Sie einen Akteur an der aktuellen Mausposition:

source: See: :doc:`Actor <../api/actor>`
de: Siehe: :doc:`Akteur <../api/actor>`

source: See: :doc:`Shapes <../api/actor_shapes>`
de: Siehe: :doc:`Formen <../api/actor_shapes>`

source: See: :doc:`TextActors and NumberActors <../api/actor_text>`
de: Siehe: :doc:`TextActors und NumberActors <../api/actor_text>`

source: Public Data Attributes:
de: Öffentliche Datenattribute:

source: collision_type specifies how collisions should be checked:
de: collision_type gibt an, wie Kollisionen überprüft werden sollen:

source: A actor with the property ``is_blockable`` cannot move through actors with the property ``is_blocking``.
de: Ein Schauspieler mit der Eigenschaft ``is_blockable`` kann sich nicht durch Schauspieler mit der Eigenschaft ``is_blocking`` bewegen.

source: Defines the layer on which the actor is drawn if several actors overlap.
de: Definiert die Ebene, auf der der Akteur gezeichnet wird, wenn mehrere Akteure überlappen.

source: Actor position in last frame
de: Akteurposition im letzten Frame

source: Returns number of costumes of actor, 0 if actor has no costume
de: Gibt die Anzahl der Kostüme des Schauspielers zurück, 0 wenn der Schauspieler kein Kostüm hat

source: When a actor is mirrored, it is mirrored across the y-axis.
de: Wenn ein Schauspieler gespiegelt wird, wird er entlang der y-Achse gespiegelt.

source: :py:obj:`costume <miniworlds.actors.actor.Actor.costume>`\
de: :py:obj:`Kostüm <miniworlds.actors.actor.Actor.costume>`\

source: Gets the costume of actor
de: Erhält das Kostüm des Schauspielers

source: :py:obj:`costumes <miniworlds.actors.actor.Actor.costumes>`\
de: :py:obj:`Kostüme <miniworlds.actors.actor.Actor.costumes>`\

source: Gets the costume manager
de: Ruft den Kostümmanager ab

source: :py:obj:`direction <miniworlds.actors.actor.Actor.direction>`\
de: :py:obj:`Richtung <miniworlds.actors.actor.Actor.direction>`\

source: Directions are handled exactly as in the Scratch programming language, see: `Scratch Wiki <https://en.scratch-wiki.info/wiki/Direction_(value)>`_
de: Richtungen werden genau wie in der Scratch-Programmiersprache behandelt, siehe: `Scratch Wiki <https://en.scratch-wiki.info/wiki/Direction_(value)>`_

source: Gets the direction as value in unit circle (0° right, 90° top, 180° left...)
de: Erhält die Richtung als Wert im Einheitskreis (0° rechts, 90° oben, 180° links...)

source: If actor is dirty, it will be repainted.
de: Wenn der Akteur schmutzig ist, wird er neu gestrichen.

source: Size of the actor
de: Größe des Schauspielers

source: :py:obj:`width <miniworlds.actors.actor.Actor.width>`\
de: :py:obj:`Breite <miniworlds.actors.actor.Actor.width>`\

source: The width of the actor in pixels.
de: Die Breite des Akteurs in Pixeln.

source: :py:obj:`height <miniworlds.actors.actor.Actor.height>`\
de: :py:obj:`Höhe <miniworlds.actors.actor.Actor.height>`\

source: The height of the actor in pixels.
de: Die Höhe des Schauspielers in Pixeln.

source: The x-value of a actor
de: Der x-Wert eines Akteurs

source: The y-value of a actor
de: Der y-Wert eines Akteurs

source: x-value of actor topleft-position
de: x-Wert der oberen linken Position des Akteurs

source: x-value of actor center-position inside the current camera-screen
de: x-Wert der Schauspieler-Mittelposition innerhalb des aktuellen Kamerabildschirms

source: x-value of actor center-position
de: x-Wert der Schauspieler-Mittelposition

source: y-value of actor center-position
de: y-Wert der Schauspieler-Mittelposition

source: Defines if the costume of a actor should be rotatable.
de: Legt fest, ob das Kostüm eines Schauspielers drehbar sein soll.

source: Should actor react to events? You can turn this option off for additional performance boost.
de: Sollte der Akteur auf Ereignisse reagieren? Sie können diese Option deaktivieren, um die Leistung weiter zu steigern.

source: The fill color of actor as rgba value, e.g. (255, 0, 0) for red.
de: Die Füllfarbe des Akteurs als RGBA-Wert, z.B. (255, 0, 0) für Rot.

source: :py:obj:`color <miniworlds.actors.actor.Actor.color>`\
de: :py:obj:`Farbe <miniworlds.actors.actor.Actor.color>`\

source: Is actor filled with color?
de: Ist der Schauspieler mit Farbe gefüllt?

source: border color of actor.
de: Randfarbe des Akteurs.

source: The border-size of actor.
de: Die Randgröße des Akteurs.

source: :py:obj:`visible <miniworlds.actors.actor.Actor.visible>`\
de: :py:obj:`sichtbar <miniworlds.actors.actor.Actor.visible>`\

source: You can make this sprite disappear without removing it from the group assign 0 for invisible and 1 for visible
de: Sie können diesen Sprite verschwinden lassen, ohne ihn aus der Gruppe zu entfernen, indem Sie 0 für unsichtbar und 1 für sichtbar zuweisen

source: The surrounding Rectangle as pygame.Rect.
de: Das umgebende Rechteck als pygame.Rect.

source: :py:obj:`world <miniworlds.actors.actor.Actor.world>`\
de: :py:obj:`Welt <miniworlds.actors.actor.Actor.world>`\

source: The image of the actor:
de: Das Bild des Schauspielers:

source: The position of the actor as Position(x, y)
de: Die Position des Schauspielers als Position(x, y)

source: :py:obj:`speed <miniworlds.actors.actor.Actor.speed>`\
de: :py:obj:`Geschwindigkeit <miniworlds.actors.actor.Actor.speed>`\

source: :py:obj:`visible <miniworlds.actors.actor.pygame.sprite.DirtySprite.visible>`\
de: :py:obj:`sichtbar <miniworlds.actors.actor.pygame.sprite.DirtySprite.visible>`\

source: Layer property can only be set before the sprite is added to a group, after that it is read only and a sprite's layer in a group should be set via the group's change_layer() method.
de: Die Ebeneneigenschaft kann nur festgelegt werden, bevor der Sprite zu einer Gruppe hinzugefügt wird. Danach ist sie schreibgeschützt und die Ebene eines Sprites in einer Gruppe sollte über die change_layer()-Methode der Gruppe festgelegt werden.

source: Dynamic, read only property for protected _layer attribute.
de: Dynamische, schreibgeschützte Eigenschaft für das geschützte Attribut _layer.

source: Public Methods:
de: Öffentliche Methoden:

source: :py:obj:`switch_origin <miniworlds.actors.actor.Actor.switch_origin>`\ \(value\)
de: :py:obj:`switch_origin <miniworlds.actors.actor.Actor.switch_origin>`\ \(Wert\)

source: Creates a actor to a specific world
de: Erstellt einen Akteur für eine bestimmte Welt

source: Creates a actor with center at center_position
de: Erstellt einen Akteur mit dem Zentrum bei center_position

source: Flips the actor by 180° degrees.
de: Dreht den Akteur um 180° Grad.

source: Adds a new costume to actor.
de: Fügt einem Darsteller ein neues Kostüm hinzu.

source: Adds multiple costumes
de: Fügt mehrere Kostüme hinzu

source: Removes a costume from actor
de: Entfernt ein Kostüm vom Schauspieler

source: :py:obj:`switch_costume <miniworlds.actors.actor.Actor.switch_costume>`\ \(source\)
de: :py:obj:`switch_costume <miniworlds.actors.actor.Actor.switch_costume>`\ \(Quelle\)

source: Switches the costume of actor
de: Wechselt das Kostüm des Schauspielers

source: :py:obj:`set_background_color <miniworlds.actors.actor.Actor.set_background_color>`\ \(color\)
de: :py:obj:`set_background_color <miniworlds.actors.actor.Actor.set_background_color>`\ \(Farbe\)

source: Switches to the next costume of actor
de: Wechselt zum nächsten Kostüm des Schauspielers

source: :py:obj:`turn_left <miniworlds.actors.actor.Actor.turn_left>`\ \(\[degrees\]\)
de: :py:obj:`turn_left <miniworlds.actors.actor.Actor.turn_left>`\ \(\[Grad\]\)

source: Turns actor by *degrees* degrees left :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`int\``
de: Dreht den Akteur um *degrees* Grad nach links :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`int\``

source: :py:obj:`turn_right <miniworlds.actors.actor.Actor.turn_right>`\ \(\[degrees\]\)
de: :py:obj:`turn_right <miniworlds.actors.actor.Actor.turn_right>`\ \(\[Grad\]\)

source: Turns actor by *degrees* degrees right
de: Dreht den Akteur um *degrees* Grad nach rechts

source: :py:obj:`set_direction <miniworlds.actors.actor.Actor.set_direction>`\ \(direction\)
de: :py:obj:`set_direction <miniworlds.actors.actor.Actor.set_direction>`\ \(Richtung\)

source: Actor points in given direction.
de: Der Schauspieler zeigt in die angegebene Richtung.

source: :py:obj:`point_towards_position <miniworlds.actors.actor.Actor.point_towards_position>`\ \(destination\)
de: :py:obj:`point_towards_position <miniworlds.actors.actor.Actor.point_towards_position>`\ \(Ziel\)

source: Actor points towards a given position
de: Der Schauspieler zeigt auf eine bestimmte Position

source: Actor points towards another actor.
de: Der Schauspieler zeigt auf einen anderen Schauspieler.

source: :py:obj:`set_size <miniworlds.actors.actor.Actor.set_size>`\ \(value\)
de: :py:obj:`set_size <miniworlds.actors.actor.Actor.set_size>`\ \(Wert\)

source: :py:obj:`scale_width <miniworlds.actors.actor.Actor.scale_width>`\ \(value\)
de: :py:obj:`scale_width <miniworlds.actors.actor.Actor.scale_width>`\ \(Wert\)

source: :py:obj:`scale_height <miniworlds.actors.actor.Actor.scale_height>`\ \(value\)
de: :py:obj:`scale_height <miniworlds.actors.actor.Actor.scale_height>`\ \(Wert\)

source: :py:obj:`move <miniworlds.actors.actor.Actor.move>`\ \(\[distance\]\)
de: :py:obj:`move <miniworlds.actors.actor.Actor.move>`\ \(\[Entfernung\]\)

source: Moves actor *distance* steps in current direction
de: Bewegt den Akteur *distance* Schritte in die aktuelle Richtung

source: :py:obj:`move_vector <miniworlds.actors.actor.Actor.move_vector>`\ \(vector\)
de: :py:obj:`move_vector <miniworlds.actors.actor.Actor.move_vector>`\ \(Vektor\)

source: Moves actor in direction defined by the vector
de: Bewegt den Akteur in die durch den Vektor definierte Richtung

source: :py:obj:`move_back <miniworlds.actors.actor.Actor.move_back>`\ \(distance\)
de: :py:obj:`move_back <miniworlds.actors.actor.Actor.move_back>`\ \(Entfernung\)

source: Undo the last move.
de: Mache den letzten Zug rückgängig.

source: :py:obj:`move_towards <miniworlds.actors.actor.Actor.move_towards>`\ \(target\)
de: :py:obj:`move_towards <miniworlds.actors.actor.Actor.move_towards>`\ \(Ziel\)

source: :py:obj:`move_in_direction <miniworlds.actors.actor.Actor.move_in_direction>`\ \(direction\[\, distance\]\)
de: :py:obj:`move_in_direction <miniworlds.actors.actor.Actor.move_in_direction>`\ \(Richtung\[\, Entfernung\]\)

source: Moves actor *distance* steps into a *direction* or towards a position
de: Bewegt den Akteur *distance* Schritte in eine *direction* oder zu einer Position

source: Moves actor *distance* to a specific world_posiition
de: Bewegt den Akteur *distance* zu einer bestimmten Weltposition

source: :py:obj:`remove <miniworlds.actors.actor.Actor.remove>`\ \(\[kill\]\)
de: :py:obj:`remove <miniworlds.actors.actor.Actor.remove>`\ \(\[töten\]\)

source: Removes this actor from world
de: Entfernt diesen Akteur aus der Welt

source: :py:obj:`bounce_from_border <miniworlds.actors.actor.Actor.bounce_from_border>`\ \(borders\)
de: :py:obj:`bounce_from_border <miniworlds.actors.actor.Actor.bounce_from_border>`\ \(Grenzen\)

source: The actor "bounces" from a border.
de: Der Schauspieler "prallt" von einem Rand ab.

source: :py:obj:`detect_all <miniworlds.actors.actor.Actor.detect_all>`\ \(\[actors\, direction\, distance\]\)
de: :py:obj:`detect_all <miniworlds.actors.actor.Actor.detect_all>`\ \(\[Akteure\, Richtung\, Entfernung\]\)

source: Detects if actors are on actor position.
de: Erkennt, ob sich Akteure an der Akteurposition befinden.

source: :py:obj:`detect_borders <miniworlds.actors.actor.Actor.detect_borders>`\ \(\[distance\]\)
de: :py:obj:`detect_borders <miniworlds.actors.actor.Actor.detect_borders>`\ \(\[Abstand\]\)

source: Detects borders
de: Erkennt Grenzen

source: Does the actor touch the left border?
de: Berührt der Schauspieler den linken Rand?

source: Does the actor touch the right border?
de: Berührt der Schauspieler den rechten Rand?

source: Does the actor touch the lower border?
de: Berührt der Schauspieler den unteren Rand?

source: :py:obj:`detect_color <miniworlds.actors.actor.Actor.detect_color>`\ \(\[color\]\)
de: :py:obj:`detect_color <miniworlds.actors.actor.Actor.detect_color>`\ \(\[Farbe\]\)

source: Detects colors in world-background at actor center-position
de: Erkennt Farben im Welt-Hintergrund an der Schauspieler-Mittelposition

source: :py:obj:`detect_color_at <miniworlds.actors.actor.Actor.detect_color_at>`\ \(\[direction\, distance\]\)
de: :py:obj:`detect_color_at <miniworlds.actors.actor.Actor.detect_color_at>`\ \(\[Richtung\, Entfernung\]\)

source: Detects colors in world-background at actor-position
de: Erkennt Farben im Welt-Hintergrund an der Schauspielerposition

source: :py:obj:`detect_actors_at <miniworlds.actors.actor.Actor.detect_actors_at>`\ \(\[direction\, distance\, actors\]\)
de: :py:obj:`detect_actors_at <miniworlds.actors.actor.Actor.detect_actors_at>`\ \(\[Richtung\, Entfernung\, Akteure\]\)

source: Detects a actor in given direction and distance.
de: Erkennt einen Akteur in der angegebenen Richtung und Entfernung.

source: :py:obj:`detect_actor_at <miniworlds.actors.actor.Actor.detect_actor_at>`\ \(\[direction\, distance\, actors\]\)
de: :py:obj:`detect_actor_at <miniworlds.actors.actor.Actor.detect_actor_at>`\ \(\[Richtung\, Entfernung\, Schauspieler\]\)

source: :py:obj:`detect_actors_in_front <miniworlds.actors.actor.Actor.detect_actors_in_front>`\ \(\[actors\, distance\]\)
de: :py:obj:`detect_actors_in_front <miniworlds.actors.actor.Actor.detect_actors_in_front>`\ \(\[Akteure\, Entfernung\]\)

source: :py:obj:`detect_actor_in_front <miniworlds.actors.actor.Actor.detect_actor_in_front>`\ \(\[actors\, distance\]\)
de: :py:obj:`detect_actor_in_front <miniworlds.actors.actor.Actor.detect_actor_in_front>`\ \(\[Akteure\, Entfernung\]\)

source: Is the actor colliding with a specific (global) point?
de: Kollidiert der Schauspieler mit einem bestimmten (globalen) Punkt?

source: Is the actor colliding with a pixel?
de: Kollidiert der Schauspieler mit einem Pixel?

source: Is the actor colliding with a static rect?
de: Kollidiert der Schauspieler mit einem statischen Rechteck?

source: :py:obj:`animate <miniworlds.actors.actor.Actor.animate>`\ \(\[speed\]\)
de: :py:obj:`animate <miniworlds.actors.actor.Actor.animate>`\ \(\[Geschwindigkeit\]\)

source: :py:obj:`animate_costume <miniworlds.actors.actor.Actor.animate_costume>`\ \(costume\[\, speed\]\)
de: :py:obj:`animate_costume <miniworlds.actors.actor.Actor.animate_costume>`\ \(Kostüm\[\, Geschwindigkeit\]\)

source: :py:obj:`animate_loop <miniworlds.actors.actor.Actor.animate_loop>`\ \(\[speed\]\)
de: :py:obj:`animate_loop <miniworlds.actors.actor.Actor.animate_loop>`\ \(\[Geschwindigkeit\]\)

source: Animates a costume with a looping animation
de: Animiert ein Kostüm mit einer Schleifenanimation

source: Stops current animation.
de: Stoppt die aktuelle Animation.

source: :py:obj:`send_message <miniworlds.actors.actor.Actor.send_message>`\ \(message\)
de: :py:obj:`send_message <miniworlds.actors.actor.Actor.send_message>`\ \(Nachricht\)

source: Sends a message to world.
de: Sendet eine Nachricht an die Welt.

source: **on_key_down** is called one time when a key is pressed down.
de: **on_key_down** wird einmal aufgerufen, wenn eine Taste gedrückt wird.

source: **on_key_pressed** is called when while key is pressed.
de: **on_key_pressed** wird aufgerufen, während eine Taste gedrückt wird.

source: on_mouse_over is called, when mouse is moved over actor :type position: :param position: The mouse position
de: on_mouse_over wird aufgerufen, wenn die Maus über den Akteur bewegt wird :type position: :param position: Die Mausposition

source: on_mouse_left is called when left mouse button was pressed.
de: on_mouse_left wird aufgerufen, wenn die linke Maustaste gedrückt wurde.

source: Method is called when right mouse button was pressed.
de: Die Methode wird aufgerufen, wenn die rechte Maustaste gedrückt wurde.

source: Method is called when mouse moves.
de: Die Methode wird aufgerufen, wenn die Maus bewegt wird.

source: Method is called when left mouse key is released.
de: Methode wird aufgerufen, wenn die linke Maustaste losgelassen wird.

source: Method is called when right mouse key is released.
de: Methode wird aufgerufen, wenn die rechte Maustaste losgelassen wird.

source: The mouse is on top of a actor and mouse was clicked.
de: Die Maus befindet sich auf einem Schauspieler und die Maus wurde geklickt.

source: `on_detecting_world` is called, when actor is on the world
de: `on_detecting_world` wird aufgerufen, wenn der Akteur in der Welt ist

source: *on_detect_actor* is called, when actor is detects a actor on same position
de: *on_detect_actor* wird aufgerufen, wenn ein Akteur einen Akteur an derselben Position erkennt

source: :py:obj:`on_detecting_borders <miniworlds.actors.actor.Actor.on_detecting_borders>`\ \(borders\)
de: :py:obj:`on_detecting_borders <miniworlds.actors.actor.Actor.on_detecting_borders>`\ \(Grenzen\)

source: *on_detecting_border* is called, when actor is near a border
de: *on_detecting_border* wird aufgerufen, wenn sich der Akteur in der Nähe einer Grenze befindet

source: :py:obj:`fill <miniworlds.actors.actor.Actor.fill>`\ \(value\)
de: :py:obj:`fill <miniworlds.actors.actor.Actor.fill>`\ \(Wert\)

source: Set fill color for borders and lines
de: Füllfarbe für Ränder und Linien festlegen

source: Hides a actor (the actor will be invisible)
de: Verbirgt einen Schauspieler (der Schauspieler wird unsichtbar)

source: Displays a actor ( an invisible actor will be visible)
de: Zeigt einen Schauspieler an (ein unsichtbarer Schauspieler wird sichtbar)

source: :py:obj:`register <miniworlds.actors.actor.Actor.register>`\ \(method\[\, force\, name\]\)
de: :py:obj:`register <miniworlds.actors.actor.Actor.register>`\ \(Methode\[\, erzwingen\, Name\]\)

source: This method is used for the @register decorator.
de: Diese Methode wird für den @register-Dekorator verwendet.

source: Registers a method to an object to handle specific `on_message` events.
de: Registriert eine Methode bei einem Objekt, um bestimmte `on_message`-Ereignisse zu bearbeiten.

source: This method is used for the @register_sensor decorator.
de: Diese Methode wird für den @register_sensor Dekorator verwendet.

source: Return str(self).
de: Gib str(self) zurück.

source: :py:obj:`set_position <miniworlds.actors.actor.Actor.set_position>`\ \(value\)
de: :py:obj:`set_position <miniworlds.actors.actor.Actor.set_position>`\ \(Wert\)

source: Gets the distance to another actor or a position
de: Ermittelt die Entfernung zu einem anderen Akteur oder einer Position

source: Return repr(self).
de: Gib repr(self) zurück.

source: :py:obj:`add <miniworlds.actors.actor.pygame.sprite.Sprite.add>`\ \(\*groups\)
de: :py:obj:`add <miniworlds.actors.actor.pygame.sprite.Sprite.add>`\ \(\*Gruppen\)

source: add the sprite to groups
de: füge den Sprite zu Gruppen hinzu

source: :py:obj:`remove <miniworlds.actors.actor.pygame.sprite.Sprite.remove>`\ \(\*groups\)
de: :py:obj:`remove <miniworlds.actors.actor.pygame.sprite.Sprite.remove>`\ \(\*Gruppen\)

source: remove the sprite from groups
de: entferne den Sprite aus den Gruppen

source: For adding this sprite to a group internally.
de: Um diesen Sprite intern zu einer Gruppe hinzuzufügen.

source: For removing this sprite from a group internally.
de: Um diesen Sprite intern aus einer Gruppe zu entfernen.

source: method to control sprite behavior
de: Methode zur Steuerung des Verhaltens von Sprites

source: remove the Sprite from all Groups
de: entferne den Sprite aus allen Gruppen

source: :py:obj:`groups <miniworlds.actors.actor.pygame.sprite.Sprite.groups>`\ \(\)
de: :py:obj:`Gruppen <miniworlds.actors.actor.pygame.sprite.Sprite.groups>`\ \(\)

source: list of Groups that contain this Sprite
de: Liste der Gruppen, die diesen Sprite enthalten

source: does the sprite belong to any groups
de: gehört der Sprite zu irgendwelchen Gruppen

source: Private Data Attributes:
de: Private Datenattribute:

source: Private Methods:
de: Private Methoden:

source: set the visible value (0 or 1) and makes the sprite dirty
de: den sichtbaren Wert (0 oder 1) festlegen und den Sprite als verändert markieren

source: return the visible value of that sprite
de: den sichtbaren Wert dieses Sprites zurückgeben

source: Adds a new costume to actor. The costume can be switched with self.switch_costume(index)
de: Fügt dem Schauspieler ein neues Kostüm hinzu. Das Kostüm kann mit self.switch_costume(index) gewechselt werden

source: Rückgabetyp
de: Returntyp

source: Path to the first image of new costume or Tuple with color-value
de: Pfad zum ersten Bild des neuen Kostüms oder Tupel mit Farbwert

source: Add first costume from image:
de: Erstes Kostüm aus dem Bild hinzufügen:

source: Output:
de: Ausgabe:

source: Create Actor with image as costume
de: Schauspieler mit Bild als Kostüm erstellen

source: Add first costume from color:
de: Füge das erste Kostüm aus der Farbe hinzu:

source: Create two costumes and switch between costumes
de: Erstelle zwei Kostüme und wechsle zwischen den Kostümen

source: Create multiple costumes and switch between costumes
de: Erstelle mehrere Kostüme und wechsle zwischen den Kostümen

source: The new costume.
de: Das neue Kostüm.

source: Switches through all costume-images every ``speed``-frame.
de: Wechselt alle Kostümbilder bei jedem „Geschwindigkeit“-Frame durch.

source: Every ``speed`` frame, the image is switched. Defaults to 10.
de: Jedes ``speed``-Frame wird das Bild gewechselt. Standardmäßig auf 10.

source: The value is 0, if actor has no border.
de: Der Wert ist 0, wenn der Akteur keinen Rand hat.

source: You can also set border with ``costume.border`` or you can set the border with ``world.default_border``
de: Sie können auch den Rand mit ``costume.border`` festlegen oder Sie können den Rand mit ``world.default_border`` festlegen

source: Set border of actor:
de: Rand des Akteurs festlegen:

source: Set borders
de: Ränder festlegen

source: The border-color is a rgba value, for example (255, 0, 0) for red, (0, 255, 0) for green and (255, 0, 0, 100).
de: Die Randfarbe ist ein RGBA-Wert, zum Beispiel (255, 0, 0) für Rot, (0, 255, 0) für Grün und (255, 0, 0, 100).

source: If the color-value has 4 values, the last value defines the transparency:
de: Wenn der Farbwert 4 Werte hat, definiert der letzte Wert die Transparenz:

source: 0: Full transparent,
de: 0: Voll transparent,

source: 255: No transparency
de: 255: Keine Transparenz

source: You must also set :py:attr:`Actor.border` to a value > 0
de: Sie müssen auch :py:attr:`Actor.border` auf einen Wert > 0 setzen

source: Aliases: :py:attr:`Actor.stroke_color`
de: Aliase: :py:attr:`Actor.stroke_color`

source: See :py:attr:`Actor.border`
de: Siehe :py:attr:`Actor.border`
