Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/actor.po
Languages: de

source: The direction is set according to the principle input angle = output angle. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~miniworlds.actors.actor.Actor\``
de: Die Richtung wird nach dem Prinzip Eingangswinkel = Ausgangswinkel festgelegt. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~miniworlds.actors.actor.Actor\``

source: You must check for borders first!
de: Sie müssen zuerst die Grenzen überprüfen!

source: A list of borders as strings e.g. ["left", "right"]
de: Eine Liste von Rändern als Zeichenfolgen, z.B. ["left", "right"]

source: The actor
de: Der Schauspieler

source: `default`: tile for Tiledworlds, 'mask' for Pixelworlds
de: `default`: Kachel für Kachelwelten, 'Maske' für Pixelwelten

source: `tile`: Are actors on the same tile? (only TiledWorld)
de: `tile`: Befinden sich die Akteure auf derselben Kachel? (nur TiledWorld)

source: `rect`: Are actors colliding when checking their bounding - boxes? (Only PixelWorld)
de: `rect`: Kollidieren die Akteure beim Überprüfen ihrer Begrenzungsrahmen? (Nur PixelWorld)

source: `static-rect`: Are actors colliding when checking circle with radius = bounding-box-radius.(Only PixelWorld)
de: `static-rect`: Kollidieren Akteure beim Überprüfen eines Kreises mit Radius = Begrenzungsrahmenradius. (Nur PixelWorld)

source: `circle`: Are actors colliding when checking circle with radius = bounding-box-radius.(Only PixelWorld)
de: `circle`: Kollidieren Akteure beim Überprüfen des Kreises mit Radius = Begrenzungsrahmenradius. (Nur PixelWorld)

source: `mask`: Are actors colliding when checking if their image masks are overlapping.
de: `mask`: Überprüfen die Akteure, ob ihre Bildmasken sich überschneiden, wenn sie kollidieren.

source: When ``fill_color`` is set to a color, the attribute ``is_filled`` of costume (See: :py:attr:`.appearances.appearance.Appearance.is_filled`) is set to ``True``.
de: Wenn ``fill_color`` auf eine Farbe gesetzt ist, wird das Attribut ``is_filled`` des Kostüms (siehe: :py:attr:`.appearances.appearance.Appearance.is_filled`) auf ``True`` gesetzt.

source: Aliases: :py:attr:`Actor.color`
de: Aliase: :py:attr:`Actor.color`

source: If you fill a costume with an image, the image will be completely overwritten, even if `fill_color` is transparent.
de: Wenn Sie ein Kostüm mit einem Bild füllen, wird das Bild vollständig überschrieben, selbst wenn `fill_color` transparent ist.

source: This behaviour may change in later releases!
de: Dieses Verhalten kann sich in späteren Versionen ändern!

source: Examples:
de: Beispiele:

source: Add costume and count costumes
de: Kostüm hinzufügen und Kostüme zählen

source: _description_
de: _beschreibung_

source: The costume manager can be iterated to get all costumes
de: Der Kostümmanager kann iteriert werden, um alle Kostüme zu erhalten

source: overwritten in subclasses
de: in Unterklassen überschrieben

source: Detects if actors are on actor position. Returns the first found actor.
de: Erkennt, ob sich Akteure an der Position eines Akteurs befinden. Gibt den zuerst gefundenen Akteur zurück.

source: filter by actor type. Enter a class_name of actors to look for heredirection: int = 0, distance: int = 0
de: nach Schauspielertyp filtern. Geben Sie einen class_name der Schauspieler ein, nach denen gesucht werden soll Richtung: int = 0, Entfernung: int = 0

source: The direction in which actors should be detected.
de: Die Richtung, in der Schauspieler erkannt werden sollen.

source: The distance in which actors should be detected (Start-Point is actor.center)
de: Die Entfernung, in der Akteure erkannt werden sollten (Startpunkt ist actor.center)

source: First actor found by Sensor
de: Erster Schauspieler vom Sensor gefunden

source: The green robot pushes the yellow robot:
de: Der grüne Roboter schiebt den gelben Roboter:

source: A list of actors
de: Eine Liste von Schauspielern

source: Detects if actors are on actor position. Returns a list of actors.
de: Erkennt, ob sich Akteure an der Position eines Akteurs befinden. Gibt eine Liste von Akteuren zurück.

source: filter by actor type. Enter a class_name of actors to look for here
de: nach Schauspielertyp filtern. Geben Sie hier einen class_name der gesuchten Schauspieler ein

source: All actors found by Sensor
de: Alle von Sensor gefundenen Akteure

source: Args: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~typing.List\``
de: Argumente: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~typing.List\``

source: distance: Specifies the distance in front of the actuator to which the sensors reacts.
de: Entfernung: Gibt die Entfernung vor dem Aktuator an, auf die die Sensoren reagieren.

source: True if border was found.
de: Wahr, wenn eine Grenze gefunden wurde.

source: color as tuple
de: Farbe als Tupel

source: True, if color was found
de: Wahr, wenn die Farbe gefunden wurde

source: Specifies the direction where the sensors is searching.
de: Gibt die Richtung an, in der die Sensoren suchen.

source: Specifies the distance in front of the actuator to which the sensors reacts.
de: Gibt den Abstand vor dem Aktuator an, auf den die Sensoren reagieren.

source: All colors found by Sensor
de: Alle vom Sensor gefundenen Farben

source: True if pixel is below actor
de: Wahr, wenn der Pixel unter dem Akteur ist

source: If your want to check if an actor detects a specific pixel, use detect_pixel
de: Wenn Sie überprüfen möchten, ob ein Akteur einen bestimmten Pixel erkennt, verwenden Sie detect_pixel

source: True if point is below actor
de: Wahr, wenn der Punkt unter dem Akteur liegt

source: The default direction is ``0°``. All actors are looking ``"up"``
de: Die Standardrichtung ist ``0°``. Alle Akteure schauen ``"nach oben"``

source: Move on world
de: Bewege dich weiter, Welt

source: **Values for Direction**
de: **Werte für Richtung**

source: ``0°`` or ``"up"``: up
de: ``0°`` oder ``"up"``: oben

source: ``90°`` or ``"right"``: Move right
de: ``90°`` oder ``"rechts"``: Nach rechts bewegen

source: ``-90°`` or ``"left"``: Move left
de: ``-90°`` oder ``"left"``: Nach links bewegen

source: ``180°`` or ``"down"``: Move down
de: ``180°`` oder ``"down"``: Nach unten bewegen

source: ``"forward"``: Current direction
de: ``"forward"``: Aktuelle Richtung

source: Sets direction of the actor.
de: Legt die Richtung des Akteurs fest.

source: You can use an integer or a string to describe the direction
de: Sie können eine ganze Zahl oder einen String verwenden, um die Richtung zu beschreiben

source: Options
de: Optionen

source: ``0``, ``"up"`` - Look up
de: ``0``, ``"up"`` - Nachschlagen

source: ``90``, ``"right"``, - Look right
de: ``90``, ``"right"``, - Schau nach rechts

source: ``-90``, ``"left"``, - Look left
de: ``-90``, ``"left"``, - Schau nach links

source: ``-180``, ``180``, ``"down"`` - Look down
de: ``-180``, ``180``, ``"down"`` - Schau nach unten

source: Move in a direction with WASD-Keys
de: Bewege dich mit den WASD-Tasten in eine Richtung

source: Move 45°:
de: Bewege 45°:

source: Move -45°:
de: Bewege -45°:

source: 1 if actor is dirty/0 otherwise
de: 1, wenn der Akteur schmutzig ist/0 andernfalls

source: Flips the actor by 180° degrees. The costume is flipped and the actor's direction changed by 180 degrees. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`int\``
de: Dreht den Akteur um 180° Grad. Das Kostüm wird umgedreht und die Richtung des Akteurs um 180 Grad geändert. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`int\``

source: Flip a actor in Example flipthefish.py
de: Drehe einen Schauspieler in Beispiel flipthefish.py

source: center_position: Center of actor
de: center_position: Mittelpunkt des Akteurs

source: Actor or Position
de: Schauspieler oder Position

source: The distance between actor (measured from actor.center) to actor or position.
de: Der Abstand zwischen dem Akteur (gemessen von actor.center) zum Akteur oder zur Position.

source: When the height of a actor is changed, the width is scaled proportionally.
de: Wenn die Höhe eines Schauspielers geändert wird, wird die Breite proportional skaliert.

source: Create a actor and scale width/height proportionally:
de: Erstellen Sie einen Akteur und skalieren Sie die Breite/Höhe proportional:

source: Textured image
de: Texturiertes Bild

source: Warning: You should not directly draw on the image (with pygame functions) as the image will be reloaded during animations
de: Warnung: Sie sollten nicht direkt auf das Bild zeichnen (mit pygame-Funktionen), da das Bild während der Animationen neu geladen wird

source: When a actor is mirrored, it is mirrored across the y-axis. You can use this property in 2D platformer games to change the direction of actor.
de: Wenn ein Schauspieler gespiegelt wird, erfolgt die Spiegelung entlang der y-Achse. Sie können diese Eigenschaft in 2D-Plattformspielen verwenden, um die Richtung des Schauspielers zu ändern.

source: It may be necessary to set ``is_rotatable = True``
de: Es kann notwendig sein, ``is_rotatable = True`` festzulegen

source: Flip a costume after 100 frames.
de: Drehe ein Kostüm nach 100 Bildern um.

source: True, if actor is flipped
de: Wahr, wenn der Akteur umgedreht ist

source: Defines if the costume of a actor should be rotatable. The actor can still be rotated with the ``direction`` property, but its costume won't be changed
de: Legt fest, ob das Kostüm eines Schauspielers drehbar sein soll. Der Schauspieler kann immer noch mit der Eigenschaft ``direction`` gedreht werden, aber sein Kostüm wird nicht verändert

source: You can also use ``actor.costume.is_rotatable``
de: Sie können auch ``actor.costume.is_rotatable`` verwenden

source: Create a rotatable and a not rotatable actor
de: Erstellen Sie einen drehbaren und einen nicht drehbaren Akteur

source: Can be used to track changes.
de: Kann verwendet werden, um Änderungen zu verfolgen.

source: Number of steps to move. If distance = 0, the actor speed will be used.
de: Anzahl der Schritte, die bewegt werden sollen. Wenn die Entfernung = 0 ist, wird die Geschwindigkeit des Akteurs verwendet.

source: The moved actor
de: Der bewegte Schauspieler

source: if actor is on the world, move forward:
de: wenn der Akteur in der Welt ist, vorwärts bewegen:

source: 0, "up" - Look up
de: 0, "up" - Nachschlagen

source: 90, "right", - Look right
de: 90, "rechts", - Schau nach rechts

source: -90, "left", - Look left
de: -90, "links", - Schau nach links

source: -180, 180, "down" - Look down
de: -180, 180, "unten" - Schau nach unten

source: Direction as angle
de: Richtung als Winkel

source: Detects obj "distance" steps in front of current actor.
de: Erkennt Objekte "Entfernung" Schritte vor dem aktuellen Akteur.

source: The actor itself
de: Der Schauspieler selbst

source: The position to which the actor should move. The position can be a 2-tuple (x, y)
de: Die Position, zu der sich der Akteur bewegen soll. Die Position kann ein 2-Tupel (x, y) sein

source: move to (3, 2) on mouse_click
de: bewege zu (3, 2) bei Maus-Klick

source: The new costume
de: Das neue Kostüm

source: Registering a on_click event:
de: Registrieren eines on_click-Ereignisses:

source: Actual mouse position as tuple (x,y)
de: Aktuelle Mausposition als Tupel (x,y)

source: The error is raised when method is not overwritten or registered.
de: Der Fehler tritt auf, wenn die Methode nicht überschrieben oder registriert wird.

source: The found actor
de: Der gefundene Schauspieler

source: Register detect_actor event
de: Registriere detect_actor-Ereignis

source: A list of strings with found borders, e.g.: ['left', 'top']
de: Eine Liste von Zeichenfolgen mit gefundenen Grenzen, z.B.: ['left', 'top']

source: Register on_detecting_border_event:
de: Registrieren Sie on_detecting_border_event:

source: Register on_detecting_world method:
de: Registrieren Sie die Methode on_detecting_world:

source: Instead of **on_key_down** you can use **on_key_down_letter**, e.g. **on_key_down_a** or **on_key_down_w** , if you want to handle an on_key_down event for a specific letter.
de: Statt **on_key_down** können Sie **on_key_down_letter** verwenden, z. B. **on_key_down_a** oder **on_key_down_w**, wenn Sie ein on_key_down-Ereignis für einen bestimmten Buchstaben behandeln möchten.

source: Register a key_down event:
de: Registriere ein key_down-Ereignis:

source: Register on_key_down_a event
de: Registriere on_key_down_a Ereignis

source: The typed key as list (e.g. ['A', 'a']) containing both uppercase and lowercase of typed letter.
de: Der eingegebene Schlüssel als Liste (z. B. ['A', 'a']), die sowohl Groß- als auch Kleinbuchstaben des eingegebenen Buchstabens enthält.

source: **on_key_pressed** is called when while key is pressed. If you hold the key, on_key_pressed is repeatedly called again and again until the key is released.
de: **on_key_pressed** wird aufgerufen, wenn eine Taste gedrückt wird. Wenn Sie die Taste gedrückt halten, wird on_key_pressed immer wieder aufgerufen, bis die Taste losgelassen wird.

source: Like `on_key_down` the method can be called in the variant `on_key_pressed_[letter]` (e.g. `on_key_pressed_w(self)`).
de: Wie `on_key_down` kann die Methode in der Variante `on_key_pressed_[letter]` aufgerufen werden (z.B. `on_key_pressed_w(self)`).

source: Register on_key_pressed event:
de: Registrieren Sie das on_key_pressed-Ereignis:

source: The typed key as list (e.g. ['C', 'c', 'D', 'd']) containing both uppercase and lowercase
de: Der eingegebene Schlüssel als Liste (z. B. ['C', 'c', 'D', 'd']), die sowohl Groß- als auch Kleinbuchstaben enthält

source: on_mouse_left is called when left mouse button was pressed. You must *register* or *implement* this method as an event.
de: on_mouse_left wird aufgerufen, wenn die linke Maustaste gedrückt wurde. Sie müssen diese Methode als Ereignis *registrieren* oder *implementieren*.

source: The event is triggered, when mouse-left was clicked, even when the current mouse position is not related to actor position.
de: Das Ereignis wird ausgelöst, wenn die linke Maustaste geklickt wurde, selbst wenn die aktuelle Mausposition nicht mit der Position des Akteurs in Zusammenhang steht.

source: You can use :py:meth:`Actor.detect_pixel` to check, if the mouse_position is *inside* the actor.
de: Sie können :py:meth:`Actor.detect_pixel` verwenden, um zu überprüfen, ob sich die mouse_position *innerhalb* des Akteurs befindet.

source: A circle will be moved, if you click on circle.
de: Ein Kreis wird verschoben, wenn Sie auf den Kreis klicken.

source: You can use on_mouse_left_release to implement a drag_and_drop event
de: Sie können on_mouse_left_release verwenden, um ein drag_and_drop-Ereignis zu implementieren

source: Method is called when mouse moves. You must *register* or *implement* this method as an event.
de: Die Methode wird aufgerufen, wenn die Maus bewegt wird. Sie müssen diese Methode als Ereignis *registrieren* oder *implementieren*.

source: The event is triggered, when mouse is moved, even when the current mouse position is not related to actor position.
de: Das Ereignis wird ausgelöst, wenn die Maus bewegt wird, selbst wenn die aktuelle Mausposition nicht mit der Position des Akteurs in Zusammenhang steht.

source: Method is called when right mouse button was pressed. You must *register* or *implement* this method as an event.
de: Methode wird aufgerufen, wenn die rechte Maustaste gedrückt wurde. Sie müssen diese Methode als Ereignis *registrieren* oder *implementieren*.

source: The event is triggered, when mouse was clicked,even when the current mouse position is not related to actor position.
de: Das Ereignis wird ausgelöst, wenn die Maus geklickt wurde, selbst wenn die aktuelle Mausposition nicht mit der Position des Akteurs in Zusammenhang steht.

source: See: :py:meth:`Actor.on_mouse_left`.
de: Siehe: :py:meth:`Actor.on_mouse_left`.

source: Method is called when right mouse key is released. See :py:meth:`Actor.on_mouse_left_released`.
de: Methode wird aufgerufen, wenn die rechte Maustaste losgelassen wird. Siehe :py:meth:`Actor.on_mouse_left_released`.

source: The other actor
de: Der andere Schauspieler

source: The new direction
de: Die neue Richtung

source: The position to which the actor should pointing
de: Die Position, auf die der Schauspieler zeigen sollte

source: Point towards mouse_position:
de: Zeige auf mouse_position:

source: The surrounding Rectangle as pygame.Rect. The rect coordinates describes the local coordinates and depend on the camera view.
de: Das umgebende Rechteck als pygame.Rect. Die Rechteckkoordinaten beschreiben die lokalen Koordinaten und hängen von der Kameraperspektive ab.

source: If the actor is rotated, the rect vertices are not the vertices of the actor image.
de: Wenn der Schauspieler gedreht wird, sind die Eckpunkte des Rechtecks nicht die Eckpunkte des Schauspielerbildes.

source: This method is used for the @register decorator. It adds a method to an object
de: Diese Methode wird für den @register-Dekorator verwendet. Sie fügt einem Objekt eine Methode hinzu

source: The method which should be added to the actor
de: Die Methode, die dem Akteur hinzugefügt werden sollte

source: Should register forced, even if method is not handling a valid event?
de: Sollte erzwungen registriert werden, auch wenn die Methode kein gültiges Ereignis verarbeitet?

source: Registers method with specific name
de: Registriert Methode mit spezifischem Namen

source: This decorator links a method to a specific event message, triggering it automatically when the designated message is received.
de: Dieser Dekorator verknüpft eine Methode mit einer bestimmten Ereignisnachricht und löst sie automatisch aus, wenn die vorgesehene Nachricht empfangen wird.

source: Example of two actors who are communicating.
de: Beispiel von zwei Schauspielern, die kommunizieren.

source: The specific message event this method will react to.
de: Das spezifische Nachrichtenereignis, auf das diese Methode reagieren wird.

source: Examples: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~collections.defaultdict\``
de: Beispiele: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~collections.defaultdict\``

source: Removes robots in thecrash.py :
de: Entfernt Roboter in thecrash.py :

source: The index of the new costume or costume-object. Defaults to actual costume
de: Der Index des neuen Kostüms oder Kostüm-Objekts. Standardmäßig das aktuelle Kostüm

source: The message can be received with the ``on_message``-event
de: Die Nachricht kann mit dem ``on_message``-Ereignis empfangen werden

source: Send and receive messages:
de: Nachrichten senden und empfangen:

source: A string containing the message.
de: Eine Zeichenkette, die die Nachricht enthält.

source: You can use a integer or a string to describe the direction
de: Sie können eine ganze Zahl oder einen String verwenden, um die Richtung zu beschreiben

source: Stops current animation. Costume ``is_animated`` is set to False
de: Stoppt die aktuelle Animation. Das Kostüm ``is_animated`` wird auf False gesetzt

source: Number of costume or Costume object
de: Anzahl der Kostüme oder Kostümobjekt

source: Switch a costume:
de: Ein Kostüm wechseln:

source: Options:
de: Optionen:

source: You can set the value actor.is_rotatable = False if you don't want the actor to be rotated.
de: Sie können den Wert actor.is_rotatable = False setzen, wenn Sie nicht möchten, dass der Akteur gedreht wird.

source: degrees in left direction
de: Grad in linker Richtung

source: New direction
de: Neue Richtung

source: Undo the last move. Moves the actor to the last position and resets direction.
de: Mache den letzten Zug rückgängig. Bewegt den Akteur zur letzten Position und setzt die Richtung zurück.

source: move_back when field is blocked:
de: zurückbewegen, wenn das Feld blockiert ist:

source: When the width of a actor is changed, the height is scaled proportionally.
de: Wenn die Breite eines Akteurs geändert wird, wird die Höhe proportional skaliert.
