Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/actor_shapes.po
Languages: de

source: Actor > Shapes
de: Akteur > Formen

source: Shape
de: Form

source: Base class for shapes
de: Basisklasse für Formen

source: Shape is the parent class for various geometric objects that can be created.
de: Shape ist die übergeordnete Klasse für verschiedene geometrische Objekte, die erstellt werden können.

source: Each geometric object has the following properties:
de: Jedes geometrische Objekt hat die folgenden Eigenschaften:

source: border: The border thickness of the object.
de: Rand: Die Randstärke des Objekts.

source: is_filled: True/False if the object should be filled.
de: is_filled: Wahr/Falsch, ob das Objekt gefüllt werden soll.

source: fill_color: The fill color of the object
de: fill_color: Die Füllfarbe des Objekts

source: border_color: The border color of the object.
de: border_color: Die Randfarbe des Objekts.

source: Shapes
de: Formen

source: Point
de: Punkt

source: A point is a Circle with Radius 1
de: Ein Punkt ist ein Kreis mit Radius 1

source: Init a Point at specified position
de: Initialisiere einen Punkt an der angegebenen Position

source: Circle
de: Kreis

source: A circular shape, definied by position and radius
de: Eine kreisförmige Form, definiert durch Position und Radius

source: The position as 2-tuple. The circle is created with its center at the position
de: Die Position als 2-Tupel. Der Kreis wird mit seinem Mittelpunkt an der Position erstellt

source: The radius of the circle
de: Der Radius des Kreises

source: Examples
de: Beispiele

source: Create a circle at center position (200,100) with radius 20:
de: Erstelle einen Kreis an der Position (200,100) mit Radius 20:

source: Create a circle at topleft position
de: Erstelle einen Kreis in der oberen linken Position

source: Creates a circle with center at position
de: Erstellt einen Kreis mit dem Mittelpunkt an der Position

source: Creates a circle with topleft at position
de: Erstellt einen Kreis mit der oberen linken Ecke an der Position

source: The radius of the circle. If you change the circle-size (e.g. with self.size = (x, y), the radius value will be changed too.
de: Der Radius des Kreises. Wenn Sie die Kreisgröße ändern (z. B. mit self.size = (x, y)), wird der Radiuswert ebenfalls geändert.

source: An elliptic shape.
de: Eine elliptische Form.

source: The position as 2-tuple. The ellipse is created at topleft position
de: Die Position als 2-Tupel. Die Ellipse wird an der oberen linken Position erstellt

source: The width of the ellipse
de: Die Breite der Ellipse

source: The height of the ellipse
de: Die Höhe der Ellipse

source: Create an ellipse at topleft position (200,100) with width 20 and height 30
de: Erstellen Sie eine Ellipse an der oberen linken Position (200,100) mit einer Breite von 20 und einer Höhe von 30

source: Create an ellipse at center-position (200,100) width width 10 and height 10
de: Erstellen Sie eine Ellipse an der Position (200,100) mit einer Breite von 10 und einer Höhe von 10

source: (Alternative) Create an ellipse at center-position (200,100) with width 10 and height 10
de: (Alternative) Erstellen Sie eine Ellipse an der Position (200,100) mit einer Breite von 10 und einer Höhe von 10

source: Creates an ellipse with center at position
de: Erstellt eine Ellipse mit dem Mittelpunkt an der Position

source: Creates an ellipse with topleft at position
de: Erstellt eine Ellipse mit der oberen linken Ecke an der Position

source: Line
de: Linie

source: A Line-Shape defined by start_position and end_position.
de: Eine Linienform, definiert durch start_position und end_position.

source: The start_position as 2-tuple.
de: Die start_position als 2-Tupel.

source: The end_position as 2-tuple.
de: Die end_position als 2-Tupel.

source: Create a line from (200, 100) to (400, 100)
de: Erstelle eine Linie von (200, 100) bis (400, 100)

source: -> see border
de: -> Grenze sehen

source: Directions are handled exactly as in the Scratch programming language, see: `Scratch Wiki <https://en.scratch-wiki.info/wiki/Direction_(value)>`_
de: Die Richtungen werden genau wie in der Programmiersprache Scratch behandelt, siehe: `Scratch Wiki <https://en.scratch-wiki.info/wiki/Direction_(value)>`_

source: The default direction is ``0°``. All actors are looking ``"up"``
de: Die Standardrichtung ist ``0°``. Alle Akteure schauen ``"nach oben"``

source: Move on world
de: Bewege dich weiter, Welt

source: **Values for Direction**
de: **Werte für Richtung**

source: ``0°`` or ``"up"``: up
de: ``0°`` oder ``"up"``: oben

source: ``90°`` or ``"right"``: Move right
de: ``90°`` oder ``"right"``: Nach rechts bewegen

source: ``-90°`` or ``"left"``: Move left
de: ``-90°`` oder ``"left"``: Nach links bewegen

source: ``180°`` or ``"down"``: Move down
de: ``180°`` oder ``"down"``: Nach unten bewegen

source: ``"forward"``: Current direction
de: ``"vorwärts"``: Aktuelle Richtung

source: Sets direction of the actor.
de: Legt die Richtung des Akteurs fest.

source: You can use an integer or a string to describe the direction
de: Sie können eine ganze Zahl oder einen String verwenden, um die Richtung zu beschreiben

source: Options
de: Optionen

source: ``0``, ``"up"`` - Look up
de: ``0``, ``"up"`` - Nachschlagen

source: ``90``, ``"right"``, - Look right
de: ``90``, ``"right"``, - Schau nach rechts

source: ``-90``, ``"left"``, - Look left
de: ``-90``, ``"left"``, - Schau nach links

source: ``-180``, ``180``, ``"down"`` - Look down
de: ``-180``, ``180``, ``"down"`` - Nach unten schauen

source: Move in a direction with WASD-Keys
de: Bewege dich in eine Richtung mit den WASD-Tasten

source: Move 45°:
de: Bewege 45°:

source: Move -45°:
de: Bewege -45°:

source: Rectangle
de: Rechteck

source: A rectangular shape defined by position, width and height
de: Eine rechteckige Form, definiert durch Position, Breite und Höhe

source: Topleft Position of Rect
de: Obere linke Position des Rechtecks

source: The height of the rect
de: Die Höhe des Rechtecks

source: The width of the rect
de: Die Breite des Rechtecks

source: Create a rect with the topleft position (200, 100), the width 20 and the height 10
de: Erstellen Sie ein Rechteck mit der oberen linken Position (200, 100), der Breite 20 und der Höhe 10

source: Creates a rectangle with center at position
de: Erstellt ein Rechteck mit dem Mittelpunkt an der Position

source: Creates a rectangle with topleft at position
de: Erstellt ein Rechteck mit der oberen linken Ecke an der Position

source: A Polygon-Shape.
de: Eine Polygon-Form.

source: A list of points
de: Eine Liste von Punkten

source: Example Creation of a polygon
de: Beispielerstellung eines Polygons

source: Example Creation of a filled polygon
de: Beispielerstellung eines gefüllten Polygons
