Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/actor_number.po
Languages: de

source: Actor > Number
de: Actor > Nummer

source: A number actor shows a Number.
de: Ein Zahlen-Actor zeigt eine Nummer.

source: You have to set the size of the actor with self.size() manually so that the complete text can be seen.
de: Du musst die Größe des Actors mit self.size() manuell einstellen, damit der vollständige Text gesehen werden kann.

source: Parameter
de: Parameter Parameter

source: Top-Left position of Number.
de: Oben-links-position von Nummer.

source: The initial number
de: Die Anfangszahl

source: The size of the font (default: 80)
de: Die Größe der Schriftart (standardmäßig: 80)

source: Examples
de: Beispiele

source: Sets a new NumberActor to display the score.::
de: Setzt einen neuen NumberActor ein, um den Punktestand anzuzeigen.

source: Gets the number stored in the NumberActor::
de: Holt die Nummer, die im NumberActor:: gespeichert ist.

source: Sets the number stored in the NumberActor::
de: Setzt die Nummer, die im NumberActor:: gespeichert ist.

source: add the sprite to groups
de: fuege das sprite zu gruppen hinzu

source: Sprite.add(*groups): return None
de: Sprite.add(*Gruppen): gibt None zurück

source: Any number of Group instances can be passed as arguments. The Sprite will be added to the Groups it is not already a member of.
de: Eine beliebige Anzahl von Gruppeninstanzen kann als Argumente übergeben werden. Der Sprite wird zu den Gruppen hinzugefügt, denen er noch nicht angehört.

source: Rückgabetyp
de: Return-Typ

source: Rückgabe
de: Return

source: The current number
de: Die aktuelle Nummer

source: Increases the number by one
de: Erhöht die Zahl um eins

source: Sets the number
de: Legt die Nummer fest

source: The number which should be displayed
de: Die Nummer, die angezeigt werden soll
