Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/actor_textbox.po
Languages: de

source: Actor > Textbox
de: Actor > Textfeld

source: Generates a textbox with fixed width and height
de: Erzeugt eine Textbox mit fester Breite und Höhe

source: Parameter
de: Parameter Parameter

source: The topleft position of textbox
de: Die obere linke Position des Textfeldes

source: The width of the textbox
de: Die Breite des Textfeldes

source: The height of the textbox
de: Die Höhe des Textfelds

source: Does the textbox has a border?
de: Hat das Textfeld einen Rahmen?

source: The font size
de: Die Schriftgröße

source: Creates a new text-line
de: Erstellt eine neue Textzeile

source: Rückgabetyp
de: Return type

source: position of line
de: Position der Linie

source: Text of line. Defaults to "".
de: Text der Zeile. Standardeinstellung "".

source: Rückgabe
de: Return

source: A Text-Actor
de: Ein Text-Actor

source: creates the lines actor - One actor per line. Split long lines after words.
de: erstellt die Zeilen Actor - Ein Actor pro Zeile. Lange Zeilen nach Wörtern aufteilen.
