Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/actor_text.po
Languages: de

source: Actor > Text
de: Schauspieler > Text

source: A Text-Actor is a actor which contains a Text.
de: Ein Text-Schauspieler ist ein Schauspieler, der einen Text enthält.

source: You have to set the size of the actor with self.size() manually so that the complete text can be seen.
de: Sie müssen die Größe des Schauspielers manuell mit self.size() festlegen, damit der gesamte Text gesehen werden kann.

source: Parameter
de: Parameter Parameter

source: Top-Left position of Text.
de: Obere linke Position des Textes.

source: The initial text
de: Der anfängliche Text

source: Examples
de: Beispiele

source: Create a new texts::
de: Erstelle einen neuen Text:

source: _summary_
de: Zusammenfassung

source: _description_. Defaults to (0,0).
de: Beschreibung. Standardmäßig auf (0,0) festgelegt.

source: The text (otherwise empty string "")
de: Der Text (sonst leerer String)

source: Set font size to a value, e.g. 10, 12, ...
de: Setzen Sie die Schriftgröße auf einen Wert, z.B. 10, 12, ...

source: Examples:
de: Beispiele:

source: Sets size of actor to 10::
de: Legt Größe des Schauspielers auf 10 fest::

source: Gets the currently displayed text
de: Erhält den aktuell angezeigten Text

source: Rückgabe
de: Return

source: The currently displayed text
de: Der aktuell angezeigte Text

source: Sets the text of the actor
de: Setzt den Text des Schauspielers

source: The text
de: Der Text

source: changes the text.
de: ändert den Text.
