Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/music.po
Languages: de

source: Sound and Music
de: Klang und Musik

source: Music
de: Musik

source: Public Methods:
de: Öffentliche Methoden:

source: pauses a music
de: pausiert einen Musik

source: returns True, if world is playing a music (and music ist not paused)
de: gibt True zurück, wenn Welt Musik spielt (und Musik ist nicht pausiert)

source: gets path to current music
de: erhält Pfad zur aktuellen Musik

source: plays a music from path
de: spielt eine Musik aus dem Pfad

source: stops a music
de: stoppt einen Musik

source: sets volume of music
de: stellt Lautstärke der Musik ein

source: gets volume of music
de: erhält Lautstärke von Musik

source: Rückgabetyp
de: Return type

source: Rückgabe
de: Return

source: The path to current music file
de: Der Pfad zur aktuellen Musikdatei

source: current volume
de: aktueller Band

source: Parameter
de: Parameter Parameter

source: The path to the music
de: Der Weg zur Musik

source: Specifies how often the music must be repeated (-1: infinitely often)
de: Gibt an, wie oft die Musik wiederholt werden muss (-1: unendlich oft)

source: Returns:
de: Rückgaben:

source: Volume between 0 and 100
de: Volumen zwischen 0 und 100

source: Sound
de: Klang

source: :py:obj:`play <miniworlds.worlds.manager.sound_manager.SoundManager.play>`\ \(\[path\, volume\]\)
de: :py:obj:`spielen <miniworlds.worlds.manager.sound_manager.SoundManager.play>`\ \(\[Pfad\, Lautstärke\]\)

source: plays a sound from path
de: spielt einen ton aus dem pfad

source: :py:obj:`register <miniworlds.worlds.manager.sound_manager.SoundManager.register>`\ \(\[path\]\)
de: :py:obj:`registrieren <miniworlds.worlds.manager.sound_manager.SoundManager.register>`\ \(\[path\]\)

source: Registers a sound.
de: Registriert einen Ton.

source: The path to the sound
de: Der Weg zum Ton

source: The volume, the sound should be played (0 min, 100 max)
de: Das Volumen, der Ton sollte gespielt werden (0 Min, 100 Max)

source: Registers a sound. It can slow down the performance, if sounds are loaded on the fly and it can be faster to register all sounds at program start.
de: Registriert einen Klang. Es kann die Leistung verlangsamen, wenn Klänge im Flug geladen werden und es kann schneller sein, alle Klänge beim Programmstart zu registrieren.
