Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/positions_vector.po
Languages: de

source: Positions -> Vector
de: Positionen -> Vektor

source: Describes a two-dimensional vector.
de: Beschreibt einen zweidimensionalen Vektor.

source: It is used to describe a position, acceleration or velocity.
de: Es wird verwendet, um eine Position, Beschleunigung oder Geschwindigkeit zu beschreiben.

source: Examples
de: Beispiele

source: Create a circle which follows the mouse.
de: Erstellen Sie einen Kreis, der der Maus folgt.

source: Public Data Attributes:
de: Öffentliche Datenattribute:

source: :py:obj:`angle <miniworlds.positions.vector.Vector.angle>`\
de: :py:obj:`Winkel <miniworlds.positions.vector.Vector.angle>`\

source: describes the angle as miniworlds direction
de: beschreibt den Winkel als Miniweltenrichtung

source: the x component of the vector
de: die x-Komponente des Vektors

source: the y component of the vector
de: die y-komponente des vektors

source: Public Methods:
de: Öffentliche Methoden:

source: Create a vector from actor and position
de: Erstelle einen Vektor aus Schauspieler und Position

source: Create a vector from two actors.
de: Erstellen Sie einen Vektor aus zwei Akteuren.

source: Creates a vector from miniworlds direction.
de: Erzeugt einen Vektor aus der Richtung der Miniwelten.

source: Creates a vector from actor direction
de: Erstellt einen Vektor aus der Richtung des Schauspielers

source: Creates a vector from actor position
de: Erstellt einen Vektor aus der Schauspielerposition

source: :py:obj:`rotate <miniworlds.positions.vector.Vector.rotate>`\ \(theta\)
de: :py:obj:`drehen <miniworlds.positions.vector.Vector.rotate>`\ \(theta\)

source: rotates Vector by theta degrees
de: rotiert Vektor um theta Grad

source: Returns miniworlds direction from vector.
de: Gibt Miniweltenrichtung vom Vektor zurück.

source: :py:obj:`normalize <miniworlds.positions.vector.Vector.normalize>`\ \(\)
de: :py:obj:`normalisieren <miniworlds.positions.vector.Vector.normalisieren>`\ \(\)

source: sets length of vector to 1
de: setzt Länge des Vektors auf 1

source: :py:obj:`length <miniworlds.positions.vector.Vector.length>`\ \(\)
de: :py:obj:`Länge <miniworlds.positions.vector.Vector.length>`\ \(\)

source: returns length of vector
de: gibt länge des Vektors zurück

source: returns -v for Vector v
de: Gibt -v für Vektor v zurück

source: :py:obj:`multiply <miniworlds.positions.vector.Vector.multiply>`\ \(other\)
de: :py:obj:`multiplizieren <miniworlds.positions.vector.Vector.multiply>`\ \(anderes\)

source: product self * other: * returns product, if ``other`` is scalar (return-type: Vector) :rtype: :sphinx_autodoc_typehints_type:`\:py\:data\:\`\~typing.Union\`\\ \\\[\:py\:class\:\`float\`\, \:py\:class\:\`\~miniworlds.positions.vector.Vector\`\]`
de: Produkt Selbst * Andere: * gibt Produkt zurück, wenn „andere“ skalar ist (Rückgabetyp: Vektor) :rtype: :sphinx_autodoc_typehints_type:`\:py\:data\:\`\~typing.Union\`\\ \\\[\:py\:class\:\`float\`\, \:py\:class\:\`\~miniworlds.positions.vector.Vector\`\]`

source: Return str(self).
de: Gib str(self) zurück.

source: :py:obj:`__sub__ <miniworlds.positions.vector.Vector.__sub__>`\ \(other\)
de: :py:obj:`__sub__ <miniworlds.positions.vector.Vector.__sub__>`\ \(anderer\)

source: adds vector `other` from self.
de: fügt Vektor `andere` von selbst hinzu.

source: adds vector `other` to self.
de: fügt Vektor `other` zu sich selbst hinzu.

source: :py:obj:`limit <miniworlds.positions.vector.Vector.limit>`\ \(value\)
de: :py:obj:`limit <miniworlds.positions.vector.Vector.limit>`\ \(Wert\)

source: limits length of vector to value
de: Begrenzt Länge des Vektors auf Wert

source: Rückgabetyp
de: Return type

source: Parameter
de: Parameter Parameter

source: other Vector
de: anderer Vektor

source: Rückgabe
de: Return

source: `self` + `other`
de: `selbst` + `anderer`

source: Add two vectors:
de: Füge zwei Vektoren hinzu:

source: Alternative:
de: Alternative: Alternative

source: The vector describes is generated from: actor2.center - position
de: Der Vektor beschreibt wird erzeugt aus: actor2.center - position

source: Examples: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~miniworlds.positions.vector.Vector\``
de: Beispiele: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~miniworlds.positions.vector.Vector\``

source: Creates rotating rectangle
de: Erzeugt rotierendes Rechteck

source: The vector describes is generated from: actor2.center - actor1.center
de: Der Vektor beschreibt wird generiert aus: actor2.center - actor1.center.

source: Examples: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`float\``
de: Beispiele: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`float\``

source: Length of vector
de: Länge des Vektors

source: returns dot-product, if ``other`` is vector (return-type: float)
de: gibt das Skalarprodukt zurück, wenn "andere" ein Vektor ist (Rückgabetyp: float)

source: a scalar or vector
de: ein Skalar oder Vektor

source: Product and dot-product:
de: Produkt und Punktprodukt:

source: Inverse of vector:
de: Inverse von Vektor:

source: Normalized vector with length 1:
de: Normalisierter Vektor mit Länge 1:

source: Subtracts two vectors:
de: Zieht zwei Vektoren voneinander ab:
