Repository: asbl/miniworlds
Catalog: docs/source/locales/*/LC_MESSAGES/api/world.po
Languages: de

source: World
de: Welt

source: Die Basisklasse für all deine Welten.
de: The base class for all your worlds.

source: A world is a playing field on which actors can move.
de: Eine Welt ist ein Spielfeld, auf dem Schauspieler sich bewegen können.

source: A world has a `background` and provides basic functions for the positioning of actors and for the collision detection of actors, which can be queried via the sensors of the actors.
de: Eine Welt hat einen `Hintergrund` und bietet grundlegende Funktionen für die Positionierung von Schauspielern und für die Kollisionserkennung von Schauspielern, die über die Sensoren der Schauspieler abgefragt werden können.

source: You can create your own world by creating a class that inherits from World or you can directly create a world object of type `World` or one of its child classes (`TiledWorld`, `PhysicsWorld`, ...).
de: Sie können Ihre eigene Welt erstellen, indem Sie eine Klasse erstellen, die von World erbt, oder Sie können direkt ein Weltobjekt vom Typ `World` oder einer seiner Kindklassen (`TiledWorld`, `PhysicsWorld`, ...) erstellen.

source: *World*
de: *Welt*

source: A world for pixel accurate games.
de: Eine Welt für pixelgenaue Spiele.

source: The position of a actor on a World is the pixel at topleft of actor.
de: Die Position eines Schauspielers in einer Welt ist das Pixel oben links des Schauspielers.

source: New actors are created with top-left corner of actor rect at position.
de: Neue Schauspieler werden mit der oberen linken Ecke des Schauspieler-Rechtecks an Position erstellt.

source: Two actors collide when their sprites overlap.
de: Zwei Schauspieler kollidieren, wenn ihre Sprites sich überschneiden.

source: Asteroids
de: Asteroiden

source: **Other worlds:**
de: Andere Welten:

source: TiledWorld: For worlds using Tiles, like rogue-like rpgs, see :doc:`TiledWorld <../api/world.tiledworld>`)
de: TiledWorld: Für Welten, die Kacheln verwenden, wie Rogue-Like-RPGs, siehe :doc:`TiledWorld <../api/world.tiledworld>`)

source: PhysicsWorld: For worlds using the PhysicsEngine, see :doc:`PhysicsWorld <../api/world_physicsworld>`)
de: PhysicsWorld: Für Welten, die den PhysicsEngine verwenden, siehe :doc:`PhysicsWorld <../api/world_physicsworld>`)

source: Examples
de: Beispiele

source: Creating a TiledWorld Object:
de: Erstellen eines TiledWorld-Objekts:

source: Creating a TiledWorld-Subclass.
de: Erstellen einer TiledWorld-Unterklasse.

source: Creating a World Object:
de: Erstellen eines World-Objekts:

source: Creating a World Subclass
de: Erstellen einer Welt-Unterklasse

source: See: :doc:`World <../api/world>`
de: Siehe: :doc:`Welt <../api/world>`

source: See: :doc:`TiledWorld <../api/world.tiledworld>`
de: Siehe: :doc:`TiledWorld <../api/world.tiledworld>`

source: Parameter
de: Parameter Parameter

source: columns of new world (default: 40)
de: Spalten der neuen Welt (Standard: 40)

source: rows of new world (default:40)
de: Zeilen der neuen Welt (Standard: 40)

source: Size of tiles (1 for normal worlds, can differ for Tiledworlds)
de: Größe der Fliesen (1 für normale Welten, kann sich für Kachelwelten unterscheiden)

source: Public Data Attributes:
de: Öffentliche Datenattribute:

source: :py:obj:`surface <miniworlds.worlds.world.World.surface>`\
de: :py:obj:`Oberfläche <miniworlds.worlds.world.World.surface>`\

source: :py:obj:`step <miniworlds.worlds.world.World.step>`\
de: :py:obj:`Schritt <miniworlds.worlds.world.World.step>`\

source: Step defines how often the method ``act()`` will be called.
de: Schritt definiert, wie oft die Methode " act() " aufgerufen wird.

source: Frames per second shown on the screen.
de: Frames pro Sekunde angezeigt auf dem Bildschirm.

source: The x-world_size (defaults to view_size)
de: Die x-world_size (Standardwert: view_size)

source: The y-world_size (defaults to view_size)
de: Die y-world_size (Standard: view_size)

source: :py:obj:`size <miniworlds.worlds.world.World.size>`\
de: :py:obj:`Größe <miniworlds.worlds.world.World.size>`\

source: Set the size of world
de: Stellen Sie die Größe der Welt ein

source: Set default fill color for borders and lines
de: Setzen Sie die Standardfüllfarbe für Rahmen und Linien

source: Set default stroke color for borders and lines.
de: Stellen Sie die Standardschlagfarbe für Rahmen und Linien ein.

source: Set default border color for borders and lines.
de: Setze Standard-Rahmenfarbe für Rahmen und Linien.

source: Sets default border color for actors
de: Setzt Standard-Rahmenfarbe für Schauspieler fest

source: :py:obj:`backgrounds <miniworlds.worlds.world.World.backgrounds>`\
de: :py:obj:`Hintergründe <miniworlds.worlds.world.World.backgrounds>`\

source: Returns all backgrounds of the world as list.
de: Gibt alle Hintergründe der Welt als Liste zurück.

source: :py:obj:`background <miniworlds.worlds.world.World.background>`\
de: :py:obj:`Hintergrund <miniworlds.worlds.world.World.background>`\

source: Returns the current background
de: Gibt den aktuellen Hintergrund zurück.

source: :py:obj:`has_background <miniworlds.worlds.world.World.has_background>`\
de: :py:obj:`hat_hintergrund <miniworlds.worlds.world.World.has_background>`\

source: :py:obj:`registered_events <miniworlds.worlds.world.World.registered_events>`\
de: :py:obj:`angemeldete_veranstaltungen <miniworlds.worlds.world.World.registered_events>`\

source: :py:obj:`image <miniworlds.worlds.world.World.image>`\
de: :py:obj:`Bild <miniworlds.worlds.world.World.image>`\

source: The current displayed image
de: Das aktuelle angezeigte Bild

source: :py:obj:`color <miniworlds.worlds.world.World.color>`\
de: :py:obj:`Farbe < miniworlds.worlds.world.World.color>`\

source: :py:obj:`window <miniworlds.worlds.world.World.window>`\
de: :py:obj:`Fenster <miniworlds.worlds.world.World.window>`\

source: Gets the parent window
de: Holt das übergeordnete Fenster

source: :py:obj:`actors <miniworlds.worlds.world.World.actors>`\
de: :py:obj:`Schauspieler <miniworlds.worlds.world.World.actors>`\

source: :py:obj:`frame <miniworlds.worlds.world.World.frame>`\
de: :de:obj:`frame <miniworlds.worlds.world.World.frame>`\

source: :py:obj:`clock <miniworlds.worlds.world.World.clock>`\
de: :py:obj:`Uhr <miniworlds.worlds.world.World.uhr>`\

source: :py:obj:`music <miniworlds.worlds.world.World.music>`\
de: :py:obj:`musik <miniworlds.worlds.world.World.music>`\

source: :py:obj:`window <miniworlds.worlds.world_base.WorldBase.window>`\
de: :py:obj:`Fenster <miniworlds.worlds.world_base.WorldBase.window>`\

source: :py:obj:`height <miniworlds.worlds.world_base.WorldBase.height>`\
de: :py:obj:`Höhe <miniworlds.worlds.world_base.WorldBase.height>`\

source: Public Methods:
de: Öffentliche Methoden:

source: :py:obj:`add_bottom <miniworlds.worlds.world.World.add_bottom>`\ \(world\[\, size\]\)
de: :py:obj:`add_bottom <miniworlds.worlds.world.World.add_bottom>`\ \(Welt\[\, Größe\]\)

source: Checks if position is in the world.
de: Überprüft, ob die Position auf der Welt ist.

source: Detects if rect is completely on the world.
de: Erkennt, ob Rechteck vollständig auf der Welt ist.

source: :py:obj:`set_columns <miniworlds.worlds.world.World.set_columns>`\ \(value\)
de: :py:obj:`set_columns <miniworlds.worlds.world.World.set_columns>`\ \(Wert\)

source: :py:obj:`borders <miniworlds.worlds.world.World.borders>`\ \(value\)
de: :py:obj: 'Grenzen <miniworlds.worlds.world.World.borders>'\ \(Wert\)

source: Gets all borders from a source (`Position` or `Rect`).
de: Holt alle Grenzen von einer Quelle (`Position` oder `Rect`).

source: :py:obj:`default_fill <miniworlds.worlds.world.World.default_fill>`\ \(value\)
de: :py:obj:`default_fill <miniworlds.worlds.world.World.default_fill>`\ \(Wert\)

source: :py:obj:`switch_background <miniworlds.worlds.world.World.switch_background>`\ \(background\)
de: :py:obj:`switch_background <miniworlds.worlds.world.World.switch_background>`\ \(Hintergrund\)

source: Switches the background
de: Schaltet den Hintergrund um

source: :py:obj:`remove_background <miniworlds.worlds.world.World.remove_background>`\ \(\[background\]\)
de: :py:obj:`remove_background <miniworlds.worlds.world.World.remove_background>`\ \(\[Hintergrund\]\)

source: Removes a background from world
de: Entfernt einen Hintergrund aus der Welt

source: :py:obj:`set_background <miniworlds.worlds.world.World.set_background>`\ \(source\)
de: :py:obj:`set_background <miniworlds.worlds.world.World.set_background>`\ \(Quelle\)

source: Adds a new background to the world
de: Fügt eine neuen Hintergrund in die Welt hinzu

source: :py:obj:`add_background <miniworlds.worlds.world.World.add_background>`\ \(source\)
de: :py:obj:`add_background <miniworlds.worlds.world.World.add_background>`\ \(Quelle\)

source: Starts the world, if world is not running.
de: Startet die Welt, wenn die Welt nicht läuft.

source: Stops the world.
de: Stoppt die Welt.

source: :py:obj:`run <miniworlds.worlds.world.World.run>`\ \(\[fullscreen\, fit\_desktop\, replit\, ...\]\)
de: :py:obj:`ausführen <miniworlds.worlds.world.World.run>`\ \(\[vollbild\, fit\_desktop\, replit\, ...\]\)

source: The method show() should always be called at the end of your program.
de: Die Methode show() sollte immer am Ende Ihres Programms aufgerufen werden.

source: :py:obj:`play_sound <miniworlds.worlds.world.World.play_sound>`\ \(path\)
de: :py:obj:`play_sound <miniworlds.worlds.world.World.play_sound>`\ \(Pfad\)

source: plays sound from path
de: spielt klang von pfad

source: :py:obj:`play_music <miniworlds.worlds.world.World.play_music>`\ \(path\)
de: :py: obj:`play_music <miniworlds.worlds.world.World.play_music>`\ \(Pfad\)

source: plays a music from path
de: spielt eine Musik aus Pfad

source: stops a music
de: stoppt eine Musik

source: Gets the current mouse_position
de: Bekommt die aktuelle Maus_Position

source: Gets x-coordinate of mouse-position
de: Erhält x-Koordinate der Mausposition

source: Gets y-coordinate of mouse-position
de: Erhält y-Koordinate der Mausposition

source: gets mouse-position of last frame
de: erhält Mausposition des letzten Frames

source: Returns True, if mouse is pressed
de: Gibt True zurück, wenn Maus gedrückt ist

source: Returns True, if mouse left button is pressed
de: Gibt True zurück, wenn Maus linker Knopf ist gedrückt

source: Returns True, if mouse right button is pressed
de: Gibt True zurück, wenn Maus-rechte Taste gedrückt ist

source: :py:obj:`send_message <miniworlds.worlds.world.World.send_message>`\ \(message\[\, data\]\)
de: :py:obj:`send_message <miniworlds.worlds.world.World.send_message>`\ \(Nachricht\[\, Daten\]\)

source: Sends broadcast message
de: Sendet Rundfunknachricht

source: quits app and closes the window
de: beendet die App und schließt das Fenster

source: Resets the world Creates a new world with init-function - recreates all actors and actors on the world.
de: Setzt die Welt zurück Erstellt eine neue Welt mit der Init-Funktion - erstellt alle Schauspieler und Schauspieler auf der Welt neu.

source: :py:obj:`clear <miniworlds.worlds.world.World.clear>`\ \(\)
de: :py:obj:`klar <miniworlds.worlds.world.World.clear>`\ \(\)

source: Switches to another world
de: Wechselt in eine andere Welt

source: Returns the color at a specific position
de: Gibt die Farbe an einer bestimmten Position zurück

source: Gets Position from pixel
de: Erhält Position aus Pixel

source: Overwrite or register this method to call `on_setup`-Actions
de: Überschreiben oder registrieren Sie diese Methode, um "on_setup"-Aktionen aufzurufen.

source: :py:obj:`add_to_world <miniworlds.worlds.world.World.add_to_world>`\ \(actor\, position\)
de: :py:obj:`add_to_world <miniworlds.worlds.world.World.add_to_world>`\ \(Schauspieler\, Position\)

source: Adds a Actor to the world.
de: Fügt einen Schauspieler der Welt hinzu.

source: Gets all actors which are found at a specific position.
de: Erhalte alle Schauspieler, die an einer bestimmten Position gefunden werden.

source: Implemented in subclasses
de: Implementiert in Unterklassen

source: The mainloop, called once per frame.
de: Die Hauptschleife, die einmal pro Frame aufgerufen wird.

source: Event handling
de: Ereignisverarbeitung

source: :py:obj:`register <miniworlds.worlds.world.World.register>`\ \(method\)
de: :py:obj:`register <miniworlds.worlds.world.World.register>`\ \(methode\)

source: Used as decorator e.g. @register def method.
de: Verwendet als Dekorateur z.B. @register def Methode.

source: :py:obj:`direction <miniworlds.worlds.world.World.direction>`\ \(point1\, point2\)
de: :py:obj:`Richtung <miniworlds.worlds.world.World.direction>`\ \(Punkt1\, Punkt2\)

source: :py:obj:`load_world_from_db <miniworlds.worlds.world.World.load_world_from_db>`\ \(file\)
de: :py:obj:`load_world_from_db <miniworlds.worlds.world.World.load_world_from_db>`\ \(Datei\)

source: Loads a sqlite db file.
de: Lädt ein sqlite db-Datei.

source: :py:obj:`load_actors_from_db <miniworlds.worlds.world.World.load_actors_from_db>`\ \(file\, actor\_classes\)
de: :py:obj:`load_actors_from_db <miniworlds.worlds.world.World.load_actors_from_db>`\ \(datei\, schauspieler\_klassen\)

source: Loads all actors from db.
de: Lädt alle Schauspieler aus db.

source: Saves the current world an all actors to database.
de: Speichert die aktuelle Welt und alle Schauspieler in der Datenbank.

source: Creates a screenshot in given file.
de: Erstellt einen Screenshot in der angegebenen Datei.

source: :py:obj:`get_columns_by_width <miniworlds.worlds.world.World.get_columns_by_width>`\ \(width\)
de: :py:obj:`get_columns_by_width <miniworlds.worlds.world.World.get_columns_by_width>`\ \(Breite\)

source: :py:obj:`get_rows_by_height <miniworlds.worlds.world.World.get_rows_by_height>`\ \(height\)
de: :py:obj:`get_rows_by_height <miniworlds.worlds.world.World.get_rows_by_height>`\ \(Höhe\)

source: Gets a set of all events you can register
de: Erhält eine Reihe von allen Ereignissen, für die Sie sich registrieren können.

source: implemented in subclasses
de: implementiert in Unterklassen

source: :py:obj:`remove <miniworlds.worlds.world_base.WorldBase.remove>`\ \(actor\)
de: :py:obj:`remove <miniworlds.worlds.world_base.WorldBase.remove>`\ \(Schauspieler\)

source: Private Data Attributes:
de: Private Datenattribute:

source: :py:obj:`_animated <miniworlds.worlds.world.World._animated>`\
de: :py:obj:`_animiert <miniworlds.worlds.world.World._animated>`\

source: Private Methods:
de: Private Methoden:

source: needed by get_world_connector in parent class
de: benötigt von get_world_connector in Elternklasse

source: updates costumes for all actors on the world
de: Aktualisierungen Kostüme für alle Schauspieler auf der Welt

source: Overwritten in subclasses, e.g. physics_world.
de: Überschrieben in Unterklassen, z.B. physics_world.

source: If multiple backgrounds are added, the last adds background will be set as active background.
de: Wenn mehrere Hintergründe hinzugefügt werden, wird der letzte hinzugefügte Hintergrund als aktiver Hintergrund festgelegt.

source: Rückgabetyp
de: Return type

source: The path to the first image of the background or a color (e.g. (255,0,0) for red or "images/my_background.png" as path to a background.
de: Der Pfad zum ersten Bild des Hintergrunds oder einer Farbe (z.B. (255,0,0) für Rot oder "images/my_background.png" als Pfad zu einem Hintergrund.

source: Add multiple Backgrounds:
de: Füge mehrere Hintergründe hinzu:

source: Rückgabe
de: Return

source: The new created background.
de: Der neu erstellte Hintergrund.

source: Position or rect
de: Position oder Rekt

source: A list of borders, e.g. ["left", "top"], if rect is touching the left a top border.
de: Eine Liste von Grenzen, z.b. ["left", "top"], wenn das Rechteck die linke obere Grenze berührt.

source: A rectangle as tuple (top, left, width, height)
de: Ein Rechteck als Tupel (oben, links, Breite, Höhe)

source: You must also set a border for actor.
de: Du musst auch einen Rand für den Schauspieler festlegen.

source: Set default border for actors:
de: Standardgrenze für Schauspieler festlegen:

source: ``world.default_border_color`` does not have an effect, if no border is set.
de: ``world.default_border_color`` hat keinen Effekt, wenn kein Rahmen gesetzt ist.

source: You must also set ``world.border`` > 0.
de: Sie müssen auch "world.border" > 0 setzen.

source: Create actors with and without with border
de: Erstelle Schauspieler mit und ohne Rand

source: Output:
de: Ausgabe:

source: borders
de: Grenzen

source: Set default stroke color for borders and lines. (equivalent to border-color)
de: Setze Standardstrichfarbe für Rahmen und Linien fest. (entspricht border-color)

source: Position, where actors should be searched.
de: Position, wo Schauspieler gesucht werden sollen.

source: A list of actors
de: Eine Liste von Schauspielern

source: Get all actors at mouse position:
de: Erhalte alle Schauspieler an der Mausposition:

source: True, if Position is in the world.
de: Wahr, wenn Position in der Welt ist.

source: This controls how often the screen is redrawn. However, the game logic can be called more often or less often independently of this with ``world.speed.``
de: Dies steuert wie oft der Bildschirm neu gezeichnet wird. Allerdings kann die Spiellogik unabhängig davon öfter oder weniger oft mit "world.speed." aufgerufen werden.

source: Examples: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`tuple\``
de: Beispiele: :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`tuple\``

source: Output: (255, 0, 0, 255)
de: Ausgabe: (255, 0, 0, 255)

source: get color of red screen
de: Hol dir Farbe von rotem Bildschirm

source: The position to search for
de: Die Position suchen

source: The color
de: Die Farbe

source: PixelWorld: the pixel position is returned TiledWorld: the tile-position is returned
de: PixelWorld: die Pixelposition wird zurückgegeben TiledWorld: die Kachelposition wird zurückgegeben

source: Position as pixel coordinates
de: Position als Pixelkoordinaten

source: The pixel position, if position is on the world, None if position is not on World.
de: Die Pixelposition, wenn die Position auf der Welt ist, Keine, wenn die Position nicht auf der Welt ist.

source: Returns the mouse position if mouse is on the world. Returns None otherwise
de: Gibt die Mausposition zurück, wenn die Maus auf der Welt ist. Andernfalls wird None zurückgegeben

source: Create circles at current mouse position:
de: Erstellen Sie Kreise an der aktuellen Mausposition:

source: Circles at mouse-position
de: Kreise bei Mausposition

source: Loads all actors from db. Usually you load the actors in __init__() or in on_setup()
de: Lädt alle Schauspieler aus der Datenbank. Normalerweise lädst du die Schauspieler in __init__() oder in on_setup()

source: reference to db file
de: Verweis auf die Datenbankdatei

source: a list of all Actor Classes which should be imported.
de: eine Liste aller Schauspielklassen, die importiert werden sollen.

source: All Actors
de: Alle Schauspieler

source: The path to the music
de: Der Weg zur Musik

source: Returns:
de: Rückgaben:

source: Used as decorator e.g. @register def method...
de: Verwendet als Dekorierer z.B. @register def Methode...

source: The index of the new background. Defaults to -1 (last background) or an Appearance
de: Der Index des neuen Hintergrunds. Standardmäßig -1 (letzter Hintergrund) oder ein Aussehen

source: Restarts flappy the bird game after collision with pipe:
de: Startet das Flappy Bird Spiel neu nach Kollision mit Rohr:

source: The method show() should always be called at the end of your program. It starts the mainloop.
de: Die Methode show() sollte immer am Ende Ihres Programms aufgerufen werden. Sie startet die mainloop.

source: A minimal miniworlds-program:
de: Ein minimales Miniworlds-Programm:

source: Minimal program
de: Minimalprogramm

source: Saves the current world an all actors to database. The file is stored as db file and can be opened with sqlite.
de: Speichert die aktuelle Welt und alle Schauspieler in der Datenbank. Die Datei wird als db-Datei gespeichert und kann mit sqlite geöffnet werden.

source: The file as relative location
de: Die Datei als relativer Standort

source: The location of the file. The folder must exist. Defaults to "screenshot.jpg".
de: Der Speicherort der Datei. Der Ordner muss vorhanden sein. Standardmäßig auf "screenshot.jpg" gesetzt.

source: A message can be received by the world or any actor on world
de: Eine Nachricht kann von der Welt oder jedem Akteur auf der Welt empfangen werden.

source: Create a world with 800 columns and 600 rows:
de: Erstelle eine Welt mit 800 Spalten und 600 Zeilen:

source: If e.g. ``step = 30``, the game logic will be called every 30th-frame.
de: Wenn z. B. ``Schritt = 30``, wird die Spiellogik alle 30. Frame aufgerufen.

source: You can adjust the frame-rate with ``world.fps``
de: Sie können die Bildrate mit ``world.fps`` anpassen.

source: Set speed and fps.
de: Setze Geschwindigkeit und fps.

source: If ``frames`` is set, world will be stopped in n frames. . Defaults to 0.
de: Wenn ``frames`` gesetzt ist, wird die Welt in n Frames gestoppt. Standardmäßig 0.

source: The index of the new background or an Appearance. If index = -1, the next background will be selected
de: Der Index des neuen Hintergrunds oder eines Aussehens. Wenn index = -1, wird der nächste Hintergrund ausgewählt.

source: Switch between different backgrounds:
de: Wechseln Sie zwischen verschiedenen Hintergründen:

source: Switch background
de: Ändern Hintergrund

source: The new background
de: Der neue Hintergrund

source: _description_
de: _Beschreibung_

source: Called in app.update() when update() from all containers is called.
de: Aufgerufen in app.update() wenn update() aus allen Containern aufgerufen wird.

source: The window
de: Das Fenster
